{
  "metadata": {
    "sermon_title": "Afterward . . . After George . . . After Bill . . . Newness",
    "bible_text": "Isaiah 1:21–27",
    "estimated_word_length": 1650,
    "estimated_duration_minutes": 16,
    "sermon_start_end": "They would not let me delay my sermon title until after the election. I therefore had to include both the president and the governor (or alternatively, the president and the president-elect), knowing of course that we would indeed be “after” one of them. My assigned topic in this series [...] Our insistence is that the city has been misunderstood because the Holy actor at its core has been unnoticed. And where God’s “therefore” is unnoticed, God’s “afterward” will not be received. But that future is indeed sure . . . and it is coming."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 7,
      "findings": "The sermon is strictly bound to Isaiah 1:21–27. It identifies the unique 'therefore' and 'afterward' structure of this specific pericope. However, it tends to generalize the city of Jerusalem into 'every major city,' which slightly dilutes the radical specificity Dekker demands.",
      "quotes": [
        "At the outset of the book of Isaiah, there is this poem in 1:21–27 which anticipates the whole of the long book of Isaiah.",
        "I have taken up this text, because I suggest Isaiah gives the long-term story of every major city, and not only Jerusalem."
      ],
      "improvement_point": "Avoid the immediate leap to 'every city' and dwell longer on why this specific prophetic word was spoken to this specific Jerusalem, to find the 'nowhere else' quality."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 6,
      "findings": "The preacher demonstrates knowledge of the Hebrew context (widows/orphans, the era of Judges). However, the exegesis is more thematic than linguistic. There is no explicit reference to the original languages as Dekker requires for a 'bicycle mechanic' level of competence.",
      "quotes": [
        "It refers back to the book of Judges, and that is not good. It is a comment on the breakdown of the urban infrastructure...",
        "Widows and orphans in that ancient, patriarchal society are the ones who have lost their male advocates..."
      ],
      "improvement_point": "Incorporate more precise exegetical work on the Hebrew terms for 'justice' (mishpat) and 'righteousness' (tsedaqah) to ground the application in the text's original weight."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 7,
      "findings": "The application is highly concrete regarding the political zeitgeist (the election of 'George and Bill'). It avoids vague pietism. However, it risks becoming a political commentary rather than a spiritual application of the Word to the hearer's soul.",
      "quotes": [
        "I suspect that George and Bill still belong to the season of regression...",
        "The 'therefore' is powerful and we can see it all around us. And maybe that is all there is."
      ],
      "improvement_point": "Connect the political 'zeitgeist' more deeply to the 'spiritual life and the congregation' (Thesis 3) rather than just the socio-political landscape."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 8,
      "findings": "The sermon excels here. Exposition and application are not separate blocks; the text is used as a lens through which the current city is viewed simultaneously. The hearer is 'expounded' alongside the text.",
      "quotes": [
        "So take the poem and with it reimagine your favorite city, even this city.",
        "That part of the poem could have been uttered yesterday, for it does indeed characterize what is happening in the city."
      ],
      "improvement_point": "Maintain this movement but ensure the 'present of revelation' remains centered on God's act rather than human political cycles."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "The 'misery' (the whoring city/judgment) is strongly present. 'Redemption' is present as a 'gift of God's grace.' 'Gratitude' (the third part) is the weakest, appearing only as a 'resolve' at the end.",
      "quotes": [
        "The poem begins by plunging us into an honest notice of the mess in the city.",
        "What is required is a new gift of God’s grace that is promised..."
      ],
      "improvement_point": "Develop the 'gratitude' aspect more clearly—how does the 'afterward' result in a specific life of service and thankfulness in the present city?"
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 5,
      "findings": "The sermon touches on 'being lost in time' (societal collapse), but it lacks the 'eternal' dimension Dekker mentions. The 'therefore' of judgment is presented more as a sociopolitical process than a personal confrontation with God's wrath.",
      "quotes": [
        "The trouble to come is not in the form of a supernatural pouncing that will come directly from God. The trouble rather is a stunning sociopolitical process..."
      ],
      "improvement_point": "Strengthen the 'two ways' by emphasizing that the choice for or against 'fidelity' has ultimate, perhaps even eternal, consequences for the individual, not just the collective."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 4,
      "findings": "This is the sermon's greatest weakness according to Dekker's criteria. Christ is mentioned only in passing ('risks of Jesus'). Christ is not the 'telos' or the 'one Lord' of the sermon; the 'afterward' remains a somewhat abstract prophetic hope.",
      "quotes": [
        "...we text-people—who treasure the poetry of Isaiah, the promises of Israel and the risks of Jesus..."
      ],
      "improvement_point": "Make Christ the explicit 'telos.' The 'afterward' must be identified with the person of Christ as the only one who fulfills the 'righteousness' the city lacks."
    },
    "8_depth_and_length": {
      "score_1_to_10": 5,
      "findings": "At approximately 16 minutes (1650 words), the sermon falls short of Dekker's 20-minute minimum requirement for 'depth.' It lacks the 'breadth' needed for true homiletical weight.",
      "improvement_point": "Expand the exegetical and dogmatic sections to reach the 20-minute threshold, allowing the 'three parts' to breathe more fully."
    }
  },
  "overall_assessment": {
    "summary": "The sermon is a strong example of 'interwoven' preaching that takes the contemporary city seriously. However, it fails significantly on the Christocentric requirement (Thesis 7) and the minimum length (Thesis 8). It leans heavily toward a sociopolitical 'lostness' while neglecting the individual and eternal dimensions of the 'two ways.'",
    "strengths": [
      "Excellent interwoven structure of text and contemporary reality.",
      "Strong, unsentimental diagnosis of 'misery' in the urban context.",
      "Clear adherence to a specific pericope (Isaiah 1:21-27)."
    ],
    "weaknesses": [
      "Insufficiently Christocentric; Christ is a footnote rather than the telos.",
      "Duration is too short to achieve the 'breadth' required for depth.",
      "Exegesis lacks the technical rigor (Greek/Hebrew) expected of a 'mechanic' of the Word."
    ],
    "final_judgment_according_to_dekker": "While this is a compelling speech, it is an incomplete sermon by Dekker's standards. It lacks the necessary Christological focus and the required length to properly 'expound' the hearer before God."
  }
}