{
  "metadata": {
    "sermon_title": "The New Math of Fidelity",
    "bible_text": "Luke 20:27-38; Psalm 17",
    "estimated_word_length": 1150,
    "estimated_duration_minutes": 11.5,
    "sermon_start_end": "They asked him a trick question. They appeared to probe his wisdom, but in fact they were trying to catch him out. “They” are the Sadducees, the religious elite who served the big steeple churches, perhaps the Dean of the Cathedral and a tenured theological professor or two. [...] We are free enough, as the apple of God’s eye, to get on with the new life to which we have been called, a life beyond fear and control, to give as we have received."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 5,
      "findings": "The sermon identifies the specific pericope of the Sadducees' question. However, it fails Dekker’s test of finding what is in THIS text that is nowhere else. Instead of the specific theological problem of the levirate marriage or the nature of the resurrection body, it treats the text as a general example of 'God's newness' versus 'human control.'",
      "quotes": [
        "Your calculus for the present simply does not work for God’s future.",
        "The future is in the hands of the narrative-breaking God who makes all things new out beyond our mastery and our control."
      ],
      "improvement_point": "Focus more sharply on the specific logic of the Sadducees' denial of the resurrection and Jesus’ specific use of the Pentateuch (the burning bush) rather than general themes of 'change' and 'newness'."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 4,
      "findings": "The exegesis is thin. While it identifies the Sadducees, it immediately modernizes them into 'Deans' and 'professors,' losing the specific historical-theological weight of their position on the Torah. The reference to the burning bush is mentioned but not explored for its original exegetical necessity.",
      "quotes": [
        "“They” are the Sadducees, the religious elite who served the big steeple churches, perhaps the Dean of the Cathedral and a tenured theological professor or two.",
        "As support for his teaching of this radical newness he appeals to Moses whom God, at the burning bush..."
      ],
      "improvement_point": "Explain why Jesus uses the burning bush text specifically to prove the resurrection to Sadducees who only accepted the Torah. This requires the 'Hebrew and Greek' depth Dekker demands."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 5,
      "findings": "The application is contemporary but tends toward the general. It mentions 'schools' and 'health care,' but these remain categories rather than concrete spiritual or ethical demands. It frames the zeitgeist as a struggle for 'control,' which is a psychological abstraction.",
      "quotes": [
        "The old categories of the economy, or the neighborhood, or our schools, or health care delivery do not work.",
        "We are like these old Sadducees; we would like to imagine that the future will be like the past."
      ],
      "improvement_point": "Move beyond the general feeling of 'uncertainty' to concrete contemporary situations where the promise of the resurrection specifically challenges a current political or social 'dead end'."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 6,
      "findings": "The sermon follows a clear structure that moves from text to contemporary situation, but it feels somewhat segmented (I, II, III, IV, V). The 'interweaving' is present in the thematic bridge of 'control,' but the hearer is not fully 'expounded' together with the text.",
      "quotes": [
        "It does not take much to transfer this Gospel confrontation and this Psalm-prayer to our own time and place."
      ],
      "improvement_point": "Avoid the explicit 'transfer' language. Let the exposition of the text immediately illuminate the hearer's reality so that the 'present of revelation' occurs naturally."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "The three parts are present in the background. Misery is defined as the 'desperate attempts to keep the world the way it was.' Redemption is the 'steadfast love' of God. Gratitude appears at the end. However, 'misery' here feels more like a management failure than a theological condition before God.",
      "quotes": [
        "We need only to be dazzled and grateful...",
        "The truth is that we are all now at a risk point."
      ],
      "improvement_point": "Deepen the 'misery' aspect. The Sadducees' problem wasn't just 'old math'; it was a rejection of God's power to give life to the dead. This is a more profound misery than 'outdated categories'."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 3,
      "findings": "This is the weakest point. There is no sense of being 'lost' in the eternal sense, and the temporal 'loss' is framed as being 'irrelevant' rather than facing destruction. The sermon remains in a 'safe' zone of 'God's bottomless love' without the gravity of the narrow way.",
      "quotes": [
        "Jesus had declared their irrelevance for the future.",
        "We will be safe there, because his steadfast love is bottomless."
      ],
      "improvement_point": "Address the seriousness of the Sadducees' position: to deny the resurrection is to remain in death. The choice between 'management' and 'faith' must have higher stakes."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 6,
      "findings": "Christ is the speaker and the one at risk, and the sermon concludes with the table (grace). However, the 'two natures' and Christ as the 'telos' (God Himself) is more assumed than proclaimed. He is more a model of trust than the objective source of life.",
      "quotes": [
        "Jesus finally falls back on God’s steadfast love...",
        "Jesus knows that the future is not cast in our old categories."
      ],
      "improvement_point": "Explicitly link the 'God of the living' to the person of Christ as the Resurrection and the Life, rather than just a teacher who 'knows better'."
    },
    "8_depth_and_length": {
      "score_1_to_10": 4,
      "findings": "The sermon is significantly too short. At approximately 1150 words, it lasts about 11-12 minutes. According to Dekker/Miskotte, it lacks the 'breadth' necessary for 'depth'.",
      "improvement_point": "Expand the exegetical section (Thesis 2) and the concrete application (Thesis 3) to reach the 20-minute threshold."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short primarily in its brevity and its tendency to turn a specific biblical confrontation into a general psychological trope about 'control' versus 'newness.' It lacks the rigorous exegetical depth (Hebrew/Greek context) and the gravity of the 'two ways' that Dekker demands. While it correctly identifies the conflict between human systems and God's future, it remains too 'safe' and abstract.",
    "strengths": [
      "Clear thematic focus on the 'calculus' of the Sadducees versus the 'new math' of God.",
      "Effective use of the Psalm to provide a prayerful, human dimension to the Gospel narrative.",
      "Adequate movement toward the Eucharist as the concrete location of grace."
    ],
    "weaknesses": [
      "Insufficient length (11 minutes) prevents the 'breadth' required for theological depth.",
      "Lack of specific exegetical rigor regarding the Sadducees' theology and Jesus' response.",
      "Absence of the 'two ways'; the sermon lacks the 'seriousness of being lost' and stays in a comfortable register of 'steadfast love'."
    ],
    "final_judgment_according_to_dekker": "This is a 'speech about a biblical idea' rather than a 'sermon' in Dekker's strict sense. It fails the formal requirement of length and the substantive requirement of specific, non-general truth."
  }
}