{
  "metadata": {
    "sermon_title": "Meat, Anxiety, Injustice",
    "bible_text": "1 Kings 4:22–23; Luke 12:13-34",
    "estimated_word_length": 1650,
    "estimated_duration_minutes": 16,
    "sermon_start_end": "Before we started worrying about polyunsaturated fats, meat was the well-established measure of a well-consumed life. If you were successful, you could eat meat several times a day. You could serve up rich banquets with multiple meats to exhibit your success. But if you were a subsistence peasant, meat was limited [...] This is a moment when Jesus calls yet again to his disciples, away from the table of much meat, from every idol, saying, 'Christian, love me more than these.' May 2018"
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon utilizes two main passages (1 Kings 4 and Luke 12). While it connects them thematically through the concept of 'meat' and 'surplus,' it risks becoming a thematic speech about 'greed' rather than an exposition of one specific pericope. It does, however, find a unique angle in the 1 Kings text regarding the 'forced labor' behind the meat.",
      "quotes": [
        "King Solomon was an aggressive carnivore who could not get enough meat. Did you notice this in the reading?",
        "Jesus picks up on this because a man came up to him and said, 'My brother is cheating me out of my share of the family farm.'"
      ],
      "improvement_point": "Focus more intensely on what the Luke 12 passage says that cannot be found in the 1 Kings passage, rather than harmonizing them into a general critique of greed."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 7,
      "findings": "The preacher demonstrates strong knowledge of the socio-economic structures of the ancient world, particularly the 'IRS tax-collecting system' and 'forced labor' in Solomon's kingdom. This provides a solid historical-critical foundation.",
      "quotes": [
        "In the long dry paragraph just before this one, we are given a sketch of his IRS tax-collecting system.",
        "The last officer named is the 'secretary of labor,' only he is said to be 'in charge of forced labor'"
      ],
      "improvement_point": "While the socio-economic context is strong, the theological-literary context of why these specific animals (deer, gazelles) are mentioned in 1 Kings could deepen the exposition."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 6,
      "findings": "The application is concrete in its critique of modern consumerism and political economy (Goldman Sachs, tweets, health care). However, it occasionally slips into generalities about 'the anxiety system' which can become a new 'general truth.'",
      "quotes": [
        "...sounds as contemporary as the kind of folk from Goldman Sachs who occupy the president’s cabinet.",
        "the righteousness of fair wages and the justice of health care and schools and all the rest."
      ],
      "improvement_point": "Ensure the application addresses the specific spiritual 'misery' of the hearer's heart, not just the systemic political failures of the zeitgeist."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 7,
      "findings": "The sermon moves fluidly between the biblical narrative and contemporary reality. The 'meat' metaphor serves as a bridge that keeps the hearer 'inside' the text while looking at their own world.",
      "quotes": [
        "Solomon had to have such storage! Alongside that we are told that he had cities for his chariots... not unlike going into our cities and noticing that downtown is mainly filled with banks."
      ],
      "improvement_point": "Avoid the 'lecture' style in section III where Jesus is described as a 'master teacher' explaining 'one-syllable words,' which creates distance between the text and the event of revelation."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 5,
      "findings": "The sermon is heavy on 'misery' (anxiety/greed) and 'gratitude/vocation' (justice), but the 'redemption' (the work of Christ) is thin. It leans toward a moralistic call to 'strive' rather than a proclamation of what has been done for the sinner.",
      "quotes": [
        "Get out of the anxiety system because it will destroy you!",
        "Discipleship is the great refusal of the fake news. Discipleship requires disciplines, willful choices to the contrary."
      ],
      "improvement_point": "Strengthen the 'redemption' aspect. The sermon suggests man must 'get out' of the system by his own 'willful choices,' which risks Pelagianism. Proclaim the grace that enables this exit."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 8,
      "findings": "This is a strong point. The preacher explicitly uses the language of 'holy reckoning' and the 'two ways' (anxiety vs. kingdom). The reality of being 'lost'—both temporally and in the 'night' of death—is clear.",
      "quotes": [
        "The anxiety system will devour your life and you will die in the night when you do not notice.",
        "Jesus sees and exhibits the contradiction... It is his great either/or."
      ],
      "improvement_point": "Maintain the tension of the 'eternal' loss more clearly; the sermon leans heavily toward 'temporal' loss (societal collapse/personal burnout)."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 4,
      "findings": "Christ is presented primarily as a 'master teacher,' a 'rabbi,' or an 'exhibitor' of the Father's goodness. He is an example to follow rather than the 'One Lord' who is the telos. The doctrine of the two natures is not felt; Christ is a herald of the kingdom rather than the King himself.",
      "quotes": [
        "Jesus, master teacher that he is...",
        "the creator God—exhibited in the life of Jesus—makes anxiety inappropriate"
      ],
      "improvement_point": "Move beyond Jesus as a teacher of an 'alternative system.' Proclaim Christ as the one who has conquered the 'anxiety system' on our behalf."
    },
    "8_depth_and_length": {
      "score_1_to_10": 5,
      "findings": "At approximately 1650 words, the sermon likely clocks in at 16-17 minutes. According to Dekker, this is insufficient for the 'breadth' required for true 'depth.'",
      "quotes": [
        "N/A"
      ],
      "improvement_point": "Expand the theological exposition of the 'Father's good pleasure' to reach the 20-minute threshold, allowing the grace of God more 'room' to breathe."
    }
  },
  "overall_assessment": {
    "summary": "The sermon is a sharp socio-economic critique that successfully bridges the world of Solomon with modern capitalism. However, it falls short of Dekker's criteria by being too short in duration and significantly under-emphasizing the redemptive work of Christ. It functions more as a prophetic call to social justice and a psychological warning against anxiety than as a proclamation of the Gospel where Christ is the telos.",
    "strengths": [
      "Excellent use of socio-economic context to make the biblical text concrete and 'current'.",
      "Strong emphasis on the 'Two Ways' and the seriousness of human choice and mortality.",
      "Effective use of a central metaphor ('meat') to unify disparate texts."
    ],
    "weaknesses": [
      "Duration is below the 20-minute threshold required for homiletic depth.",
      "Christology is functional/exemplarist rather than ontological; Christ is a teacher, not the Savior.",
      "The 'Redemption' part of the 3-2-1 rule is replaced by a call to 'willful choices' and 'disciplines'."
    ],
    "final_judgment_according_to_dekker": "This text is more an 'ethical-prophetic speech' than a 'sermon' in the strict sense of Dekker’s theses. While it is a strong exposition of human misery (anxiety), it lacks the substantive weight of Christ as the one Lord who justifies the ungodly."
  }
}