{
  "metadata": {
    "sermon_title": "Bragging about the Right Stuff",
    "bible_text": "Jeremiah 9:23-24 (with references to Psalm 87, 1 Kings 4, 10, and 1 Corinthians 1)",
    "estimated_word_length": 1850,
    "estimated_duration_minutes": 18,
    "sermon_start_end": "All great cities brag. They gather their energy, produce their images of success and prosperity, and unleash their propaganda in ads, slogans, and campaigns. They do so because they know, intuitively, that stories of success and prosperity draw people, mobilize resources, generate jobs, accumulate wealth, and eventually—raise the standard [...] The Gospel to which the church testifies in the city may be put this way: Brag! But get it right! Delight in the delights of the God of neighborly fidelity. And then brag . . . endlessly!"
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 5,
      "findings": "While Jeremiah 9:23-24 is the pivot, the sermon functions more as a thematic exploration of 'urban bragging' across the canon. It fails Dekker's test of finding what is in THIS text that is nowhere else, instead treating the text as a representative of a general biblical 'wavelength'.",
      "quotes": [
        "Jeremiah gives Jerusalem another triad for bragging.",
        "Paul lives close to Jeremiah because they are on the same wavelength."
      ],
      "improvement_point": "Focus exclusively on the specific linguistic and prophetic weight of Jeremiah 9, rather than diluting it with Solomon's history and Paul's theology."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 6,
      "findings": "The preacher demonstrates historical-critical awareness, dating the text and placing Jeremiah in opposition to the Solomonic liturgical tradition. However, it remains at the level of 'religious history' rather than deep linguistic exposition of the Hebrew 'hesed' or 'mishpat'.",
      "quotes": [
        "It is likely that Psalm 87 comes early in the Israelite history of Jerusalem, perhaps from the liturgic committees of Solomon in 950 B.C.E.",
        "Jeremiah had noticed the use of the word 'forever,' a pretentious liturgical term."
      ],
      "improvement_point": "Deepen the exposition of the specific Hebrew terms for 'steadfast love, justice, and righteousness' to move beyond sociological categories."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 7,
      "findings": "The application is concrete and culturally sharp. It identifies the 'zeitgeist' of the modern city (Atlanta, New York, etc.) and links it to the biblical triad of wisdom, might, and wealth. It avoids vague pietism.",
      "quotes": [
        "Atlanta, a city too busy to hate... New York, New York, the city that doesn’t sleep.",
        "Justice is the willingness to submit the economy to the requirements of the neighborhood."
      ],
      "improvement_point": "Ensure the application arises strictly from the text's revelation rather than a pre-existing social critique."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 6,
      "findings": "The sermon moves back and forth between Jerusalem and the modern city. However, it follows a somewhat 'blocky' structure (Ancient Jerusalem vs. Modern City) rather than a singular movement where the hearer is 'expounded' by the text.",
      "quotes": [
        "So imagine that ancient city of Jerusalem—or this contemporary city—bragging about its wisdom."
      ],
      "improvement_point": "Avoid the 'parallel track' method; let the contemporary reality be discovered within the biblical narrative itself."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 5,
      "findings": "The 'misery' of false bragging is clear. However, 'redemption' is presented more as a 'choice' or an 'alternative agenda' than a radical act of God. The movement toward gratitude is replaced by a call to social action.",
      "quotes": [
        "Jeremiah gives Jerusalem another triad for bragging.",
        "And so there we are, needing to choose, not wanting to choose, but able to choose and being offered life."
      ],
      "improvement_point": "Ground the 'redemption' in God's act rather than the human 'choice' of an alternative agenda."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 7,
      "findings": "The sermon explicitly presents a choice between life and death. It takes the 'temporal loss' of the city seriously, which aligns with Dekker's liberal tradition of the 'two ways'.",
      "quotes": [
        "Jeremiah knows that the city is destined to failure if it continues to brag about the wrong stuff.",
        "brag about the very matters that lead to death: wisdom, might, wealth."
      ],
      "improvement_point": "Strengthen the sense that this is not just a 'better way' for society, but a matter of being 'lost' or 'found' before God."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 4,
      "findings": "Christ is mentioned via Paul and the 'teaching of Jesus', but He is not the 'telos' of the sermon. He appears as an example of a 'wavelength' rather than the one in whom our life is hidden outside ourselves.",
      "quotes": [
        "And then caught short by the teaching of Jesus about steadfast love, justice, and righteousness."
      ],
      "improvement_point": "Move beyond Jesus as a teacher of social ethics to Christ as the 'one Lord' who is the only ground for boasting."
    },
    "8_depth_and_length": {
      "score_1_to_10": 5,
      "findings": "At approximately 1850 words, the sermon likely falls just under the 20-minute threshold required for 'breadth'. It feels slightly hurried in its transition from Jeremiah to Paul.",
      "quotes": [],
      "improvement_point": "Expand the theological depth of the 'knowledge of God' to reach the 20-minute mark."
    }
  },
  "overall_assessment": {
    "summary": "The sermon is a strong piece of social-prophetic rhetoric but falls short of Dekker's definition of a sermon as the 'actualization of the written Word'. It relies heavily on a thematic 'triad' comparison and treats the Bible as a source of 'wavelengths' rather than a specific, unique revelation. The Christology is functional/ethical rather than ontological, and the focus on human choice overshadows the radical nature of grace.",
    "strengths": [
      "Concrete cultural analysis of the 'zeitgeist' of urban success.",
      "Clear articulation of the 'two ways' regarding the city's survival or destruction.",
      "Effective use of historical-critical context to contrast Solomon and Jeremiah."
    ],
    "weaknesses": [
      "Lack of Christological telos; Christ is an ethical teacher rather than the Savior.",
      "Thematic approach overrides the specificity of the single Bible passage.",
      "Redemption is framed as a human choice of 'alternative agendas' rather than a work of the Spirit."
    ],
    "final_judgment_according_to_dekker": "This is an adequate ethical-prophetic speech, but it is not yet a 'sermon' in the strict Dekkerian sense because it lacks the necessary Christological depth and the specific 'present of revelation' where the text alone speaks."
  }
}