{
  "metadata": {
    "sermon_title": "The Surge of Dangerous, Restless Power",
    "bible_text": "Acts 3:1–4:12 (with references to Psalm 98 and Isaiah 2)",
    "estimated_word_length": 1150,
    "estimated_duration_minutes": 11.5,
    "sermon_start_end": "Mostly the world believes all the assets are frozen, and things will stay the way they are. You know: If you’re dead, you’re dead, and will stay so. And if you are alive, you had better scramble and get it all, because that’s all there is [...] No more frightened hearts, but hearts alive, bodies restored, communities, families, the world—like the lame man, jumping up, leaping, singing, and praising God. It is the same one who used to sit disabled. It could be us!"
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 5,
      "findings": "While the sermon focuses on the narrative of Acts 3-4, it treats the text as an example of a general concept ('dangerous power') rather than mining the specific, unique features of the pericope. It leans toward a 'biblical idea' (resurrection power) which Dekker warns against.",
      "quotes": [
        "The book of Acts, in scene after scene, is a hard meeting between the church and worldly authorities",
        "Israel has this very old song, Psalm 98, that asserts that Yahweh is a God of odd, dangerous, surging power"
      ],
      "improvement_point": "Identify what is in Acts 4 that is found nowhere else. Move away from the general theme of 'power' and focus on the specific apostolic testimony before the Sanhedrin."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 4,
      "findings": "The exegesis is superficial. There is no evidence of engagement with the original languages or the specific religious-historical context of the Sadducees/Sanhedrin beyond a general 'authorities vs. church' trope.",
      "quotes": [
        "The story does not explain how this could happen, indeed, doesn’t even indicate curiosity.",
        "The authorities ever since Pharaoh in the Old Testament and Herod in the New Testament have recognized..."
      ],
      "improvement_point": "Incorporate the specific theological conflict between the Sadducees (who denied resurrection) and the Apostles. Use the Greek nuances of 'saved' (sōzō) which links healing and salvation in this text."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 6,
      "findings": "The application is broad and touches on psychology and politics, which Dekker encourages. However, it often remains at the level of 'general truths' about 'newness' rather than concrete local congregational reality.",
      "quotes": [
        "power released among the nations that will stop the attraction of fear and hate and greed and war",
        "power that lets families get past old, disabling quarrels"
      ],
      "improvement_point": "Make the application less about global 'patterns of war' and more about the specific 'frozen assets' of the local congregation or the specific zeitgeist of the current year."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 7,
      "findings": "The sermon successfully avoids a block-like structure. It moves between the narrative of Acts and contemporary reflections on power and despair throughout.",
      "quotes": [
        "Peter has no doubt that the power unloosed in Jesus has now come to be present in the lame man. As a result, the lame man no longer respects our controlling categories."
      ],
      "improvement_point": "Ensure the 'exposition' part is more rigorous so that the 'application' feels like a necessary consequence of the text rather than a thematic leap."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "The categories of misery (complacency/despair) and redemption (resurrection power) are present. Gratitude is framed as 'leaping and praising,' though it remains somewhat abstract.",
      "quotes": [
        "some of us end in complacency... some of us end in despair",
        "hearts alive, bodies restored, communities, families, the world—like the lame man, jumping up, leaping, singing, and praising God."
      ],
      "improvement_point": "Deepen the 'misery' section by addressing man's condition 'before God' specifically, rather than just as a psychological state of 'frozenness'."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 5,
      "findings": "The sermon hints at the 'two ways' through the contrast of 'old habits of deathliness' vs. 'newness,' but it lacks the sharp edge of being 'lost' that Dekker requires. It feels more like an invitation to a better life than a warning of destruction.",
      "quotes": [
        "The old ways of greed and hate and fear are about to destroy us.",
        "In our annoyance, when we love the old deathly ways, we frontally deny Easter."
      ],
      "improvement_point": "The preacher should more explicitly address the possibility of being 'lost in time'—the failure to answer God's calling—as a serious consequence of rejecting the 'new power'."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 6,
      "findings": "Christ is mentioned as the source of power, but the sermon risks turning 'Resurrection' into a general principle of 'newness' or 'change' rather than the specific person of the God-Man.",
      "quotes": [
        "the name of Jesus Christ of Nazareth, whom you crucified, whom God raised from the dead.",
        "The resurrection is not just about a dead man come back to life. It is about power at work that we cannot control."
      ],
      "improvement_point": "Strengthen the 'two natures' aspect. Ensure Christ is not just a 'trigger' for power but the 'telos' (goal) toward which the hearer is drawn away from themselves."
    },
    "8_depth_and_length": {
      "score_1_to_10": 3,
      "findings": "At approximately 1,150 words, the sermon would likely take 11-12 minutes to deliver. This fails Dekker's absolute requirement of 20 minutes for 'depth'.",
      "quotes": [],
      "improvement_point": "Expand the exegetical depth and the concrete application to reach the 20-minute threshold. The current brevity suggests a lack of 'breadth' for the 'depth' required."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short primarily in its duration and exegetical rigor. It functions more as a thematic meditation on 'power' and 'newness' than a strict exposition of Acts 4. While it successfully avoids being a dry lecture, it sacrifices the specific 'Word of God' found in the pericope for a general 'Easter' message that could be preached from many texts.",
    "strengths": [
      "Effective interwoven structure that prevents the sermon from becoming a history lesson.",
      "Strong psychological awareness of 'complacency' and 'despair' as modern forms of misery.",
      "Clear attempt to make the resurrection a public, socio-political reality rather than just a private feeling."
    ],
    "weaknesses": [
      "Insufficient length (approx. 11-12 minutes) which prevents the necessary 'breadth' for theological depth.",
      "Lack of specific exegesis regarding the original context and the unique claims of the Acts 4 text.",
      "The 'two ways' are presented as options for a better life rather than the serious choice between life and destruction/being lost."
    ],
    "final_judgment_according_to_dekker": "This is an adequate speech about 'the power of God' and 'resurrection,' but it is not yet a 'sermon' in the full sense of Dekker's theses. It lacks the required length, the specific exegetical grounding in the original context, and the sharp urgency of the 'two ways'."
  }
}