{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "A City Hard to Love . . . but Loved",
    "bible_text": "Luke 13:31–35, Luke 19:41–44 (Palm/Passion Sunday)",
    "notes": "The sermon uses a socio-political lens to bridge biblical Jerusalem with modern urban life (Louisville/Cincinnati)."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 8,
        "score_explanation": "10 = Completely free from coercive judgments. The preacher avoids 'shaming' the listener, focusing instead on a systemic critique of power.",
        "presence_of_coercion": "Low",
        "analysis": "The CP is directed toward 'the authorities' and 'demons' (racism, sexism) rather than the congregation. There is no 'you must or burn' rhetoric.",
        "quotes": [
          "It is a city that skews justice; it impedes truth-telling artists."
        ]
      },
      "healthy_care_NP": {
        "score": 9,
        "score_explanation": "10 = Healthy, non-smothering care. The preacher models Jesus' 'tough love' which is empathetic but demands agency.",
        "presence": "High",
        "analysis": "The care is expressed through the metaphor of 'weeping' for the city, which invites the listener into a shared emotional experience without creating dependency.",
        "quotes": [
          "He wept over it because he loved it.",
          "Jesus loved old Jerusalem with tough love."
        ]
      }
    },
    "adult": {
      "score": 9,
      "score_explanation": "10 = Strong Adult presence. The sermon is highly analytical, processing historical, sociological, and biblical data.",
      "presence": "High",
      "analysis": "The preacher addresses the listener as a thinking subject, providing a 'reality check' on the political nature of Galilee vs. Jerusalem and the mechanics of urban power.",
      "quotes": [
        "Because politically, economically, and sociologically, all cities have much in common.",
        "Have you considered what his attitude was toward the city...?"
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 9,
        "score_explanation": "10 = Free from fear/compliance. The sermon does not use fear-based manipulation to gain compliance.",
        "presence_of_adaptation": "Low",
        "analysis": "The preacher speaks with the 'Free Child's' courage against the 'Parent' (the state/authorities), encouraging the congregation to do the same.",
        "quotes": [
          "Go tell that fox... tell him I have three days’ work to do."
        ]
      },
      "free_child_FC": {
        "score": 7,
        "score_explanation": "10 = Authentic, playful, joyful. There is a sense of 'Free Child' spontaneity in the descriptions of the donkey and the 'buzz' of the city.",
        "presence": "Medium",
        "analysis": "The FC is present in the imaginative reconstruction of the scene, though it is tempered by the gravity of the 'Passion' theme.",
        "quotes": [
          "The donkey on which he rode did not wave, but I imagine he smiled.",
          "I imagine that Jesus loved being in the city with all of its buzz."
        ]
      }
    },
    "dominant_ego_position": "Adult (supported by Nurturing Parent)"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Adult -> Adult",
    "analysis": "The preacher primarily invites the congregation into an Adult-level analysis of their environment. He uses 'I imagine' and 'consider' rather than 'God says you must.'",
    "ulterior_motives": "None detected. The social and psychological messages are aligned: 'The city is broken, Jesus loves it, we should too.'",
    "communicative_purity_score": 9,
    "purity_explanation": "10 = Completely transparent. The sermon is remarkably free of the 'bait and switch' common in Passion Sunday sermons.",
    "risk_explanation": "The only slight risk is a 'Social Adult / Psychological Parent' transaction where the preacher's expertise might make the listener feel 'small,' but his inclusive language ('we') mitigates this."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "None",
        "probability": "Low",
        "formula_g_analysis": {
          "con": "N/A",
          "gimmick": "N/A",
          "switch": "N/A",
          "payoff": "N/A"
        },
        "evidence_quotes": []
      }
    ],
    "absence_of_games_analysis": "The sermon avoids 'NIGYSOB' by not hunting for the congregation's sins. It avoids 'Ain't It Awful' by moving from the lament (weeping) to concrete action (casting out demons/cures). It avoids the 'Bait & Switch' by being upfront about the 'Passion' (suffering) from the beginning."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "Low. He presents Jesus as the model, but places the responsibility for 'cures' on the church/congregation.",
      "persecutor": "Low. Only persecutes systemic 'demons' (racism/sexism), not the listeners.",
      "victim": "None. The preacher does not present himself or the church as a victim of the city."
    },
    "congregation_position": "The congregation is invited to be 'Co-Agents' with Jesus, moving from potential Victims of the city's 'demons' to Adult actors.",
    "escape_possibilities": "Yes. The sermon promotes autonomy by defining the church as an 'engine for forgiveness' and 'common good,' which are Adult-driven activities."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 9,
    "summary": "This sermon is psychologically robust and exceptionally healthy. It avoids the common trap of using the Passion narrative to induce Adapted Child guilt. Instead, it utilizes a strong Adult ego state to analyze systemic issues while using a Nurturing Parent voice to provide emotional depth (the weeping). It promotes autonomy by suggesting that the 'demons' of the city are identifiable and can be addressed through collective Adult action. The preacher maintains a horizontal relationship with the congregation ('we'), avoiding the Drama Triangle.",
    "strengths": [
      "High level of Adult-to-Adult engagement.",
      "Avoidance of guilt-based manipulation.",
      "Clear distinction between systemic critique and personal care."
    ],
    "areas_for_improvement": [
      "Could further empower the 'Free Child' by expanding on the 'joy' of the new city beyond just 'work'.",
      "Slight risk of intellectualism (Adult) overshadowing the emotional needs of the Child."
    ],
    "advice_for_game_free_communication": "Continue using 'I imagine' and 'we are called' to maintain the Adult-Adult contract. Ensure the 'tough love' doesn't drift into 'Critical Parent' territory when discussing public policy."
  }
}