{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "07_Montfoort_11-jan-2026",
    "bible_text": "Hebrews 10:12-14 / Heidelberg Catechism Lord's Day 19",
    "notes": "Sermon focuses on the 'sitting' of Christ (finished work) and His reign at the right hand of God."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 4,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "Medium",
        "analysis": "The preacher uses a 'must' and 'should' framework regarding psychological states (unrest). He explicitly demands the unconverted feel 'unrest' and 'distress' as a prerequisite for grace.",
        "quotes": [
          "Je moet vol zijn met onrust, zodat je leert rusten.",
          "Die schuld die mag je echt wel achtervolgen. Die schuld die mag je wel benauwen en drukken."
        ]
      },
      "healthy_care_NP": {
        "score": 6,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "Medium",
        "analysis": "There is a strong nurturing element regarding the 'security' of the believer, though it borders on creating a dependency on the preacher's specific emotional definitions of faith.",
        "quotes": [
          "U kunt het gewoon laten zitten, omdat de Heer Jezus is gaan zitten.",
          "Het is een heerlijk kind... verzekerd van papa's liefde."
        ]
      }
    },
    "adult": {
      "score": 5,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "Medium",
      "analysis": "The preacher uses logical structures (D-Day vs V-Day) and textual analysis to explain dogma. However, the Adult is often bypassed by emotional appeals to the 'Child' ego state.",
      "quotes": [
        "Wij noemen dit met een duur woord: Christus' middelaarsheerschappij.",
        "Het is een beeld uit de Tweede Wereldoorlog... tussen D-Day en V-Day."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 3,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "High",
        "analysis": "The preacher explicitly targets the Adapted Child by defining 'true' faith as a specific emotional response (unrest followed by total passivity/sitting).",
        "quotes": [
          "Als je dat niet hebt geleerd, ben je geen kind van God.",
          "Wees je wel bewust en wees wel herinnerd aan je zonde."
        ]
      },
      "free_child_FC": {
        "score": 4,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "Low",
        "analysis": "Joy is present but it is a 'permitted' joy based on theological compliance, rather than spontaneous Free Child expression.",
        "quotes": [
          "We kunnen gerust blij zijn en opgelucht."
        ]
      }
    },
    "dominant_ego_position": "Critical Parent (disguised as Nurturing Parent)"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Parent -> Child (Complementary)",
    "analysis": "The preacher assumes a pedagogical Parent role, especially in the 'Pietje' illustration, addressing the congregation as children who need complex concepts simplified into behavioral commands (sitting vs. standing).",
    "ulterior_motives": "The social transaction is Adult-Adult (explaining a text), but the psychological transaction is Parent-Child ('I will tell you how you must feel to be safe').",
    "communicative_purity_score": 4,
    "purity_explanation": "10 = Completely transparent. 0 = Highly manipulative.",
    "risk_explanation": "The 'double bottom' lies in the definition of rest: the preacher commands the listener to 'do nothing' (Adult), but enforces this through a Parent-driven threat of 'unrest' (Child fear)."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "Bait & Switch / Redemption",
        "probability": "High",
        "formula_g_analysis": {
          "con": "The promise of total 'rest' and 'sitting' (no more work).",
          "gimmick": "The listener's guilt and desire for relief.",
          "switch": "The preacher then demands the listener must first be 'overwhelmed with unrest' and 'persecuted by guilt' to qualify for this rest.",
          "payoff": "The listener remains in a state of emotional dependency on the preacher's validation of their 'unrest'."
        },
        "evidence_quotes": [
          "U kunt het gewoon laten zitten... [Switch] ...Je moet vol zijn met onrust, zodat je leert rusten."
        ]
      },
      {
        "name": "ITHY (I'm Only Trying To Help You)",
        "probability": "Medium",
        "formula_g_analysis": {
          "con": "Providing a simple solution to the 'sin problem'.",
          "gimmick": "The listener's fear of the 'openstanding account'.",
          "switch": "If the listener doesn't feel the 'rest' exactly as described, they are told they aren't a 'child of God'.",
          "payoff": "Preacher maintains superiority as the one who defines who is 'in' or 'out'."
        },
        "evidence_quotes": [
          "En als je dat niet hebt geleerd, ben je geen kind van God."
        ]
      }
    ],
    "absence_of_games_analysis": "N/A"
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "High. Offers the 'finished work of Christ' as the ultimate rescue from the 'Persecutor' (Law/God's judgment).",
      "persecutor": "Medium. Shifts to Persecutor when addressing the 'unconverted', demanding they feel misery.",
      "victim": "Low. Only present in the implication that the 'world' or 'Europe' is a threat to the flock."
    },
    "congregation_position": "Victim (helpless under sin/guilt) or Child (needing the Rescuer's instructions on how to 'sit').",
    "escape_possibilities": "Limited. Autonomy is discouraged; the 'Adult' decision to trust is framed as a 'Child' dependency ('like a child of one year old')."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 4,
    "summary": "The sermon is psychologically ambivalent. While it offers strong theological comfort (Nurturing Parent), it tethers this comfort to a rigid emotional script. By mandating 'unrest' as a prerequisite for 'rest', the preacher creates a double-bind that can lead to religious OCD or chronic scrupulosity. The use of the 'Pietje' story infantilizes the congregation, reinforcing a Parent-Child dynamic rather than an Adult-Adult spiritual partnership.",
    "strengths": [
      "Clear use of metaphors (D-Day/V-Day) to provide cognitive structure.",
      "Strong emphasis on the 'finished' nature of grace, which can reduce performance anxiety."
    ],
    "areas_for_improvement": [
      "Avoid 'emotional engineering' (telling people exactly how they must feel).",
      "Reduce the use of exclusionary language ('If you haven't learned this, you aren't...')."
    ],
    "advice_for_game_free_communication": "Address the congregation as Adult subjects capable of experiencing God's grace without first being coerced into a specific 'unrest' phase. Move from 'You must feel X' to 'The text offers Y, how do you process this?'"
  }
}