{
  "metadata": {
    "sermon_title": "42_[plaatsnaam]",
    "bible_text": "John 21 (Peter's restoration)",
    "estimated_word_length": 1450,
    "estimated_duration_minutes": 14.5,
    "sermon_start_end": "Nou, wat kunnen vrouwen doorgaans beter dan mannen? Zullen we eens kijken. Wat roepen ze? Twee dingen doen. Ja, heel goed. Twee dingen tegelijk. Wat nog meer? Koken. Koken. Koken. Strijken, ja. Overhandigen, ook altijd iets anders nog? Luisteren, ja, heel goed. Slapen zonder geluid. Ja, Jan, dat wist je niet, hè? [...] Wilt U ons daarin zegenen, mannen en vrouwen, kinderen, tieners, iedereen bij elkaar. God, voor de ene vanzelfsprekend en voor de ander juist dat duwtje in de rug. Zegen ons daarin, God. Amen."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 4,
      "findings": "The sermon uses the narrative of Peter's restoration in John 21. However, it fails Dekker's requirement of finding what is unique to THIS text. The preacher treats the passage as a general psychological illustration of 'heart-connection' rather than a unique revelatory word. The specificity of the charcoal fire, the specific Greek wordplay (agape/phileo), or the commission to 'feed my sheep' is largely ignored in favor of a general lesson on vulnerability.",
      "quotes": [
        "En dan komen we bij die tekst waar vandaag eigenlijk alles omdraait. Want Jezus vraagt aan Petrus: 'Heb je Mij lief?'"
      ],
      "improvement_point": "Identify what is unique to John 21 that cannot be found in other 'restoration' stories. Focus on the specific ecclesiological commission (feeding sheep) rather than just the psychological state of Peter."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 3,
      "findings": "There is almost no formal exegesis. The preacher mentions 'different words in Greek' in the closing prayer, but does not explain them during the sermon. There is no mention of the significance of the 153 fish, the context of the post-resurrection appearances, or the Johannine theology of love. The preacher relies on modern psychological categories (EMDR, trauma) rather than biblical-theological ones.",
      "quotes": [
        "...klonken die drie keer die vragen vanuit Grieks, verschillende woorden..."
      ],
      "improvement_point": "Explain the actual meaning of the Greek terms during the exposition and relate the charcoal fire in John 21 to the charcoal fire in John 18 to show the textual unity of Peter's fall and restoration."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 5,
      "findings": "The application is concrete in terms of human relationships (men vs. women, vulnerability), but it is 'general' in the sense Dekker forbids. It turns into a general psychological advice session about 'showing your heart.' The application to the 'zeitgeist' is present through mentions of Ajax and EMDR, but it lacks the spiritual depth of 'misery' or 'eternal loss'.",
      "quotes": [
        "Durf naar elkaar je hart te laten zien.",
        "En ik heb ontdekt dat de meeste vrouwen daar veel beter in zijn dan mannen."
      ],
      "improvement_point": "Move the application from 'psychological vulnerability' to 'spiritual obedience.' How does Peter’s love for Christ specifically impact the hearer's vocation in the church today?"
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 4,
      "findings": "The sermon is structured more like a topical talk than an interwoven exposition. It starts with a long anecdotal introduction about gender differences, then moves to the Bible as an example of these differences. The text is used to support the preacher's theme of 'vulnerability' rather than the text 'expounding' the hearer.",
      "quotes": [
        "Vandaag denken we na over een van die dingen waar vrouwen beter in zijn.",
        "En dat kan een vrouw trouwens ook beter, drie keer hetzelfde vragen."
      ],
      "improvement_point": "Start with the text itself and let the contemporary situation be judged by the Word, rather than using the Word to validate a psychological observation about gender."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 5,
      "findings": "Misery is present as 'failure' and 'trauma,' but it is more psychological than theological (sin before God). Redemption is mentioned as Jesus' love, but it feels like a soft acceptance rather than a radical justification of the sinner. Gratitude is framed as 'showing your heart' rather than a life lived in response to the Gospel.",
      "quotes": [
        "Heb je wel eens gehuild om je eigen falen en onvermogen?",
        "Ook al kan je die vraag nu niet met ja beantwoorden, Ik hou van jou."
      ],
      "improvement_point": "Deepen the concept of 'misery' from 'failure/trauma' to 'denial of the Lord,' and 'redemption' from 'acceptance' to 'sovereign grace that reinstates the fallen'."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 2,
      "findings": "This is almost entirely absent. There is no sense of the 'seriousness of being lost' or the 'narrow way.' The tone is therapeutic and affirming. The choice presented is merely whether one 'dares' to be vulnerable, not a matter of life and death or eternal destination.",
      "quotes": [
        "Durf naar elkaar je hart te laten zien. Soms maar een heel klein stapje wat je kan maken..."
      ],
      "improvement_point": "Incorporate the gravity of Peter's potential loss—not just a bruised ego, but a lost apostleship and a lost relationship with the Living God."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 6,
      "findings": "Christ is present and is the one asking the questions. The sermon correctly identifies that grace is the foundation of Jesus' approach to Peter. However, Christ is used somewhat as a 'coach' who helps Peter get to his feelings, rather than the 'One Lord' who is the telos of all existence.",
      "quotes": [
        "Dat is de plek waar God connectie wil maken...",
        "Uiteindelijk waren de drie jaar ook nodig om uiteindelijk bij zijn hart te komen."
      ],
      "improvement_point": "Present Christ not just as a facilitator of human emotional health, but as the God-man whose grace creates a new reality for the believer."
    },
    "8_depth_and_length": {
      "score_1_to_10": 3,
      "findings": "The estimated duration is approximately 14-15 minutes. According to Dekker, a sermon under 20 minutes lacks the necessary 'breadth' for 'depth.' The long anecdotal opening about women's skills further reduces the time spent on substantive scriptural depth.",
      "quotes": [
        "We gaan gewoon eindigen, jongens."
      ],
      "improvement_point": "Increase the length to at least 20 minutes by replacing the anecdotal introduction with deeper exegetical and dogmatic exploration of the text."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker’s criteria primarily by prioritizing psychological categories over theological and exegetical ones. The introduction is overly anecdotal and occupies space that should be used for scriptural depth. The 'two ways' and the 'specific uniqueness' of the passage are neglected in favor of a general message on emotional vulnerability. While Christ is present, he functions more as a therapeutic figure than the sovereign Lord of the Church.",
    "strengths": [
      "Concrete contemporary references (Ajax, EMDR) make the message relatable.",
      "Clear focus on the human subject (Peter) aligns with the 'three parts' making man the subject.",
      "The preacher avoids overly 'objective' preaching by focusing on the heart."
    ],
    "weaknesses": [
      "Insufficient length (approx. 15 min) prevents theological depth.",
      "Lack of formal exegesis (Hebrew/Greek/Context) weakens the authority of the proclamation.",
      "The 'seriousness of being lost' (Thesis 6) is entirely absent; the tone is purely therapeutic.",
      "The specific uniqueness of John 21 is lost in generalities about 'showing your heart'."
    ],
    "final_judgment_according_to_dekker": "This is not a sermon in the strict sense of Dekker's definition. It is a 'speech about a biblical character' used to deliver a psychological lesson. It lacks the formal requirements of exposition and the substantive weight of the 'two ways'."
  }
}