{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "49_[plaatsnaam]",
    "bible_text": "Luke 2:41-52 (Jesus in the Temple)",
    "notes": "Traditional Dutch Reformed context; emphasizes the emotional and spiritual distance between the believer and Christ."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 2,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "High",
        "analysis": "The preacher heavily utilizes the Critical Parent to shame the congregation for 'indifference' and 'ignorance.' He uses 'must' (moet) and threatens eternal punishment to enforce compliance.",
        "quotes": [
          "Onwetendheid. Ongemeente, dat is de kortste weg naar de hel.",
          "Wist u dat niet? Ja, u weet het. Daarom zult u met vele slagen worden geslagen."
        ]
      },
      "healthy_care_NP": {
        "score": 3,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "Medium",
        "analysis": "Nurturing Parent is present but often 'smothering'—it is used to create an emotional dependency on the preacher's definition of 'feeling' Jesus.",
        "quotes": [
          "Ach, lief kind. Kind van God. Blijf op Jezus."
        ]
      }
    },
    "adult": {
      "score": 2,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "Low",
      "analysis": "The Adult is largely bypassed in favor of emotional appeals and dogmatic threats. There is little room for the listener to process the text objectively; the preacher provides all 'correct' emotional responses.",
      "quotes": [
        "Ik snap dit niet... Mens, dan ben je nog dood."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 1,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "High",
        "analysis": "The sermon explicitly invites the Adapted Child through fear ('angst') and guilt. The listener is encouraged to feel small, sinful, and 'spiritually dead' unless they conform to the preacher's emotional standard.",
        "quotes": [
          "Je mag je handjes wel samen knijpen van dankbaarheid.",
          "Wist u niet, dat als u zonder Jezus bent, verloren bent, en verloren gaat voor eeuwig."
        ]
      },
      "free_child_FC": {
        "score": 4,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "Medium",
        "analysis": "There is a flicker of Free Child in the descriptions of the 'shining' Jesus and the 'burning heart,' but it is quickly re-captured by the Critical Parent to check if the listener 'really' feels it.",
        "quotes": [
          "Heel zijn hart begon te branden van liefde."
        ]
      }
    },
    "dominant_ego_position": "Critical Parent"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Parent -> Child (Complementary)",
    "analysis": "The preacher speaks as a dominant Parent (knowing, judging, scolding) to an Adapted Child (ignorant, failing, fearful). This creates a stable but regressive dynamic.",
    "ulterior_motives": "Social: 'I am teaching the Bible.' Psychological: 'I am making you feel guilty so you will depend on my pastoral rescue.'",
    "communicative_purity_score": 3,
    "purity_explanation": "10 = Completely transparent/Pure. 0 = Highly manipulative/Ulterior.",
    "risk_explanation": "The 'double bottom' lies in the invitation to 'love' Jesus, which is immediately used as a yardstick to prove the listener is actually 'dead' or 'indifferent' if they don't feel it exactly like the preacher."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "NIGYSOB (Now I've Got You, You Son of a Bitch)",
        "probability": "High",
        "formula_g_analysis": {
          "con": "Asking if the listener 'misses' Jesus (invitation to intimacy).",
          "gimmick": "The listener's inevitable spiritual dry spells or lack of intense emotion.",
          "switch": "The preacher shifts from talking about love to accusing the listener of being 'spiritually dead' and 'ignorant.'",
          "payoff": "The listener feels crushed/guilty; the preacher confirms his role as the one who knows the truth."
        },
        "evidence_quotes": [
          "Vindt allemaal zo gewoon, hè, gemeente... Mens, dan ben je nog dood."
        ]
      },
      {
        "name": "Bait & Switch",
        "probability": "High",
        "formula_g_analysis": {
          "con": "The 'sweetness' of the child Jesus.",
          "gimmick": "The desire for peace and salvation.",
          "switch": "The shift to the 'hell' that awaits those who are 'indifferent.'",
          "payoff": "Fear-based compliance."
        },
        "evidence_quotes": [
          "Oneindig lief. Lief. Eén en al liefde... maar je zal tot de hel toe nedergestoten worden."
        ]
      }
    ],
    "absence_of_games_analysis": "N/A - Games are the primary structural element of this sermon."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "High: Offers the 'only way' to find Jesus through his preaching.",
      "persecutor": "High: Scolds the congregation for not reading the Bible enough and for their 'onwetendheid' (ignorance).",
      "victim": "Low: Briefly mentions 'I also struggle,' but quickly returns to Parent."
    },
    "congregation_position": "Victim: They are portrayed as lost, ignorant, and in danger of hell without the preacher's intervention.",
    "escape_possibilities": "Minimal. The sermon reinforces dependency on the 'Word' as interpreted through the preacher's emotional lens rather than Adult autonomy."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 2,
    "summary": "The sermon is psychologically taxing, relying heavily on the Critical Parent ego state. It utilizes fear and shame as primary motivators, creating a 'NIGYSOB' game where the listener can never be 'spiritual' enough to satisfy the preacher's criteria. While theologically traditional, the psychological impact is one of regression and dependency rather than adult spiritual growth.",
    "strengths": [
      "High emotional resonance.",
      "Strong use of narrative and family anecdotes to build rapport."
    ],
    "areas_for_improvement": [
      "Over-reliance on shame and the threat of hell.",
      "Lack of Adult-to-Adult engagement; the congregation is treated as children.",
      "The 'love' of God is used as a weapon rather than a gift."
    ],
    "advice_for_game_free_communication": "Try speaking from the Adult ego state: 'We see in this text a struggle with distance. How do you experience this?' instead of 'You are dead if you don't feel this.' Move from Persecutor to Teacher by offering information without the 'payoff' of guilt."
  }
}