{
  "metadata": {
    "sermon_title": "Encountering the Risen Jesus",
    "bible_text": "Mark 14:27-31; John 21:15-19",
    "estimated_word_length": 3400,
    "estimated_duration_minutes": 34,
    "sermon_start_end": "At Easter, Christians celebrate the resurrection of Jesus that changed history, but the resurrection isn’t supposed to just change history; it’s supposed to change us. [...] We want to know the power of Jesus Christ’s resurrection in our lives now. We know how it can happen."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon uses the pericope of Peter’s restoration (John 21) as a 'paradigm case study.' It successfully avoids generalities by focusing on the specific dialogue between Jesus and Peter. However, it leans heavily on the Markan parallel of the denial, which risks turning the text into a 'biblical character' study rather than an exposition of the unique contribution of the John 21 text itself.",
      "quotes": [
        "Peter is a kind of paradigm case study for us as we consider that question"
      ],
      "improvement_point": "Focus more on what John 21 offers that is found nowhere else—specifically the 'breakfast on the beach' as a unique post-resurrection liturgy—rather than relying on the character arc of Peter as a general moral lesson."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 7,
      "findings": "The preacher demonstrates the necessary academic background. He references the Greek 'poimainō' and the transitive nature of the verb for 'curse.' He correctly identifies the 'shame and honor' culture of the first century, which is essential for understanding the weight of Peter's failure.",
      "quotes": [
        "the word for curse here is a transitive verb",
        "This is a shame and honor culture. This is an ancient culture.",
        "the Greek word poimainō, and it’s a word that means shepherd."
      ],
      "improvement_point": "While the Greek is used, the preacher should ensure that these linguistic insights serve the 'exposition' of the text's original meaning for the first readers rather than just serving as 'fun facts' for the application."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 5,
      "findings": "The application is somewhat concrete (referencing Joni Eareckson Tada and Dick Lucas), but it often veers into general psychological truths about 'disordered loves' or 'self-sufficiency.' The application to the 'zeitgeist' is present but leans on older anecdotes rather than a sharp analysis of the current cultural moment.",
      "quotes": [
        "If your loves are rightly ordered, then you live the life you ought to live.",
        "I’m thinking about Saint Augustine, who we often allude to here."
      ],
      "improvement_point": "Move away from 'timeless' illustrations like Augustine or 40-year-old anecdotes. Address how the specific text challenges the specific idols of the current year/culture."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 4,
      "findings": "The sermon follows a very traditional 'lecture' structure: four principles. This separates the 'what it meant' from 'what it means.' The hearer is not drawn into the text in one movement; rather, the text is used as a source of evidence for a thematic speech about resurrection power.",
      "quotes": [
        "Here are the four principles we’ll learn here.",
        "1. You have to believe... 2. You have to understand..."
      ],
      "improvement_point": "Abandon the 'four principles' structure. Allow the narrative of the text to dictate the movement of the sermon so that exposition and application happen simultaneously."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 8,
      "findings": "This is a strong point. The sermon deals extensively with Peter's misery (the denial), the redemption (Jesus' grace at the fire), and the resulting gratitude/service (feeding the sheep). It avoids being 'too objective' by grounding the theology in Peter's psychological breakdown.",
      "quotes": [
        "Lord, I am a total moral failure.",
        "Your failures plunged into the grace of Jesus Christ make you more effective"
      ],
      "improvement_point": "Ensure that 'misery' is not just a psychological state of 'feeling bad' but is clearly defined as misery 'before God' (coram Deo)."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 5,
      "findings": "The 'two ways' are present in the discussion of Peter's choice to either remain in his failure or follow Jesus. However, the 'seriousness of being lost' is softened. The preacher mentions 'death with poise' but avoids the sharp Dekkerian edge of 'destruction' or 'eternal loss.'",
      "quotes": [
        "Which of those two has far greater resources to face death with poise?"
      ],
      "improvement_point": "The preacher should more explicitly address the possibility of 'being lost'—both in time (failing one's calling) and eternity—to heighten the urgency of the 'Follow me' command."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 7,
      "findings": "Christ is clearly the telos. The sermon emphasizes Christ as the substitute rather than a mere example. The 'doctrine of the two natures' is implied in the discussion of the resurrection's reality and Christ's divine authority to forgive.",
      "quotes": [
        "He came as a substitute. He didn’t come to sacrifice his life courageously just as an example.",
        "The resurrection is your proof that it was all paid for."
      ],
      "improvement_point": "Make the 'One Lord' even more central to the text's specific action—showing how the *Risen* Christ specifically (not just the 'idea' of grace) acts upon the hearer."
    },
    "8_depth_and_length": {
      "score_1_to_10": 8,
      "findings": "At approximately 3,400 words, the sermon is roughly 34 minutes. This meets Dekker's requirement that 'depth needs breadth.' It allows for the detailed storytelling and theological reflection required.",
      "quotes": [
        "Unfortunately, it’s almost comical I’m going to try to cover all of those principles so briefly"
      ],
      "improvement_point": "While the length is adequate, the 'four principles' structure makes it feel like a lecture; use the time instead for deeper 'exposition-application' of the narrative itself."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker's ideal primarily in its formal structure; it is a thematic speech about 'Resurrection Power' using Peter as an example, rather than a pure exposition of John 21. It relies on a 'points-based' system that separates application from exposition. However, it is strong in its Trinitarian background (misery, redemption, gratitude) and its insistence on the reality of the resurrection over mere symbolism.",
    "strengths": [
      "Adequate length allows for theological depth.",
      "Strong emphasis on the 'three parts' (misery, redemption, gratitude).",
      "Clear rejection of the 'Jesus as example' moralism in favor of 'Jesus as substitute'."
    ],
    "weaknesses": [
      "Thematic structure (4 principles) prevents the 'interwoveness' Dekker demands.",
      "The 'two ways' (the seriousness of being lost) is present but lacks the necessary 'sharpness'.",
      "Heavy reliance on secondary anecdotes (Dick Lucas, Joni Eareckson Tada) over the specific text's unique voice."
    ],
    "final_judgment_according_to_dekker": "This is a substantial piece of preaching that takes the Word seriously. However, according to Dekker's strict definition, it functions more as a 'speech about the gospel' through the lens of a biblical character than a sermon that recreates a specific Bible passage into a 'new, current, proclamatory word.' It is a strong theological lecture, but a mediocre 'Dekkerian' sermon."
  }
}