{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "Encountering the Risen Jesus",
    "bible_text": "Mark 14:27-31; John 21:15–19",
    "notes": "A classic Tim Keller-style apologetic/expository sermon focusing on the restoration of Peter."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 8,
        "score_explanation": "10 = Completely free from coercive judgments. The preacher avoids 'shaming' the listener directly, instead using Peter as a proxy to discuss failure.",
        "presence_of_coercion": "Low",
        "analysis": "Coercion is replaced by 'Reality Testing'. The preacher uses the 'must' of logic (Adult) rather than the 'must' of dogma (CP). However, the description of the human condition as 'radically self-centered' carries a trace of CP judgment.",
        "quotes": [
          "You are... homo incurvatus in se. You are man curved in on himself, radically self-centered."
        ]
      },
      "healthy_care_NP": {
        "score": 9,
        "score_explanation": "10 = Healthy, non-smothering care. High score due to the emphasis on grace and restoration rather than dependency.",
        "presence": "High",
        "analysis": "The Nurturing Parent is channeled through the character of Jesus. The preacher presents a God who 'puts life back together,' promoting the listener's autonomy through 'self-knowledge'.",
        "quotes": [
          "Jesus said this to indicate the kind of death by which Peter would glorify God. Then he said to him, 'Follow me!'"
        ]
      }
    },
    "adult": {
      "score": 9,
      "score_explanation": "10 = Strong Adult presence. The sermon is highly analytical, using historical evidence and logical frameworks.",
      "presence": "High",
      "analysis": "The preacher addresses the listener as a thinking subject. He explicitly invites the listener to 'do the hard work' and 'look at the evidence.' He uses the Adult ego state to dismantle the 'magical thinking' of the Child.",
      "quotes": [
        "You need to do the hard work by looking at the internal and external evidence, the objective and subjective material."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 8,
        "score_explanation": "10 = Free from fear/compliance. The sermon discourages 'willpower' (AC compliance) in favor of 'grace'.",
        "presence_of_adaptation": "Low",
        "analysis": "The preacher critiques the Adapted Child's attempt to please God through oaths and willpower, labeling it a failure. He warns against the 'shame culture' which is the natural habitat of the AC.",
        "quotes": [
          "If Jesus Christ came as a moral exemplar so we could summon up all of our willpower... it crushes us."
        ]
      },
      "free_child_FC": {
        "score": 7,
        "score_explanation": "10 = Authentic, playful, joyful. The sermon uses humor and vivid imagery (The Princess Bride, dancing on earth).",
        "presence": "Medium",
        "analysis": "The Free Child is present in the imaginative descriptions of the 'new body' and the 'restored world,' though it is often filtered through Adult analysis.",
        "quotes": [
          "We’re going to dance and not just float. We’re going to dance on the earth again."
        ]
      }
    },
    "dominant_ego_position": "Adult"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Adult -> Adult",
    "analysis": "The preacher primarily uses a teaching style that provides data (historical context, Greek word meanings) and invites the listener to process this data to reach a conclusion.",
    "ulterior_motives": "The 'Social' level is an intellectual lecture on history/theology. The 'Psychological' level is an invitation to the listener's Child to feel safe and accepted despite failure.",
    "communicative_purity_score": 9,
    "purity_explanation": "10 = Completely transparent. The preacher is very open about his rhetorical goals and the 'process' of belief.",
    "risk_explanation": "The only risk is a subtle 'I'm Only Trying To Help You' (ITHY) if the preacher positions his intellectual framework as the only valid way to process grief or failure."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "None",
        "probability": "High",
        "formula_g_analysis": {
          "con": "N/A",
          "gimmick": "N/A",
          "switch": "N/A",
          "payoff": "N/A"
        },
        "evidence_quotes": [
          "This stuff happened. This isn’t legendary."
        ]
      }
    ],
    "absence_of_games_analysis": "The sermon avoids games by explicitly deconstructing the 'Bait & Switch' (Grace vs Law). The preacher argues against using Jesus as a 'Moral Exemplar' (which usually leads to the game of 'Look How Hard I'm Trying') and instead points to 'Substitution' (Adult reality)."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "Low. He points to Jesus as the Rescuer, but avoids the 'I have the simple answer' trap by calling it a 'long process'.",
      "persecutor": "None. He avoids blaming the listener for their failures, instead normalizing failure as part of the 'Peter paradigm'.",
      "victim": "Low. He briefly uses a self-deprecating story (Dick Lucas) to show human limitation, but not to garner pity."
    },
    "congregation_position": "The congregation is invited into the 'Adult' position to observe the 'Victim' (Peter) being restored by the 'Rescuer' (Jesus).",
    "escape_possibilities": "The sermon offers an escape through 'Autonomy'—encouraging the listener to take responsibility for their 'ordered loves'."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 9,
    "summary": "This sermon is psychologically robust, moving away from the typical 'Critical Parent' stance of religious discourse. By using an Adult-Adult transaction, the preacher respects the listener's intellect and agency. The focus on 'ordered loves' and 'death-resurrection patterns' provides a healthy framework for personal growth that avoids the 'Adapted Child' trap of perfectionism. The use of Peter's failure as a 'paradigm' serves to de-stigmatize shame, moving the listener toward psychological integration.",
    "strengths": [
      "Strong Adult-to-Adult engagement.",
      "Deconstruction of shame-based compliance (Adapted Child).",
      "High level of transparency regarding the difficulty of belief."
    ],
    "areas_for_improvement": [
      "The 'radically self-centered' description could be softened to avoid triggering a 'Bad Child' script.",
      "The intellectual density may occasionally bypass the 'Free Child's' need for simple emotional connection."
    ],
    "advice_for_game_free_communication": "Continue to use self-deprecating examples (like the Dick Lucas story) to prevent the preacher from being perceived as a 'Perfect Parent' figure, which maintains the Adult-Adult equilibrium."
  }
}