{
  "metadata": {
    "sermon_title": "Encountering the Risen Jesus",
    "bible_text": "Mark 14:27-31, John 21:15–19",
    "estimated_word_length": 3400,
    "estimated_duration_minutes": 34,
    "sermon_start_end": "At Easter, Christians celebrate the resurrection of Jesus that changed history, but the resurrection isn’t supposed to just change history; it’s supposed to change us. It’s supposed to change you and me. Paul, years after the resurrection, met the risen Christ on the road to Damascus and it revolutionized his life. [...] We want to know the power of Jesus Christ’s resurrection in our lives now. We know how it can happen."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 5,
      "findings": "The sermon uses the text as a 'paradigm case study' rather than allowing the text to dictate the unique word. It treats the narrative as a source for 'principles' (reality, achievement, pattern, life), which risks turning the specific encounter into general theological categories.",
      "quotes": [
        "Peter is a kind of paradigm case study for us",
        "Here are the four principles we’ll learn here."
      ],
      "improvement_point": "Avoid extracting 'timeless principles' and instead focus on what this specific dialogue between Jesus and Peter says that cannot be found in other restoration narratives."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 6,
      "findings": "The preacher demonstrates knowledge of the original context, specifically the 'shame and honor culture' and the Greek transitive verb for 'curse'. However, the exegesis is used primarily to prove the historical reliability of the text (apologetics) rather than to deepen the theological exposition of the Word itself.",
      "quotes": [
        "This is a shame and honor culture. This is an ancient culture.",
        "the word for curse here is a transitive verb which means it doesn’t just say he cursed, but it means he cursed someone or something."
      ],
      "improvement_point": "Shift the focus from using exegesis to prove 'this really happened' toward using it to illuminate the specific character of God's address in this moment."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 7,
      "findings": "The application is concrete and psychologically astute. The preacher connects the text to specific human experiences: spinal cord injuries, career reversals, and even the mundane frustrations of a bachelor dealing with teenagers. It avoids vague 'be good' moralisms.",
      "quotes": [
        "Imagine the hope this gives someone spinal-cord injured like me?",
        "If your career is number one and you have a career reversal, you’re devastated.",
        "a stream of girls aged 12 to 15 coming in... 'and he doesn’t even know I exist.'"
      ],
      "improvement_point": "Ensure the application remains tied to the specific text's 'newness' rather than general psychological truths about 'disordered loves'."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 4,
      "findings": "The sermon follows a highly structured, thematic format (1. Reality, 2. Achievement, etc.). This creates a separation where the text is 'used' to support a point, rather than the hearer being 'expounded' through the text in a single movement. It feels more like a lecture on the text than a proclamatory word.",
      "quotes": [
        "Here are the four principles we’ll learn here.",
        "Let’s look at each one of those at least briefly."
      ],
      "improvement_point": "Abandon the 'four points' structure. Allow the movement of the biblical narrative to provide the structure of the sermon."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 8,
      "findings": "The sermon is strongly aligned with this thesis. It takes human misery (Peter's failure, the 'man curved in on himself') seriously, points to redemption outside the self (substitutionary atonement), and moves toward gratitude/service (feeding the lambs).",
      "quotes": [
        "You are man curved in on himself, radically self-centered.",
        "He came to live the life we should have lived and die the death we should have died.",
        "Nothing makes you more effective... than your failure plunged into a sea of my grace."
      ],
      "improvement_point": "Maintain this balance but ensure 'misery' is always 'misery before God' rather than just psychological failure."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 5,
      "findings": "The sermon mentions the 'broad way' implicitly through Peter's failure, but lacks the sharp edge of the 'ultimate possibilities' Dekker demands.",
      "quotes": [
        "He is revealed to himself... the magnitude, the immensity of what he has done breaks in on him.",
        "You can be lost in time and in eternity."
      ],
      "improvement_point": "Make the alternative to 'following' more concrete; what does it mean for the hearer to remain 'lost' in their denial?"
    },
    "7_christocentric_grace": {
      "score_1_to_10": 8,
      "findings": "Christ is clearly the telos. The preacher emphasizes the two natures (Jesus as God who knows all things, yet man who eats fish) and focuses on grace as the only source of life. The sermon successfully detaches man from himself and points to salvation in Christ.",
      "quotes": [
        "The resurrection is your proof that it was all paid for.",
        "Man has no life in himself, it is Christ who is his life.",
        "He came as our Savior. He came as a substitute."
      ],
      "improvement_point": "Ensure the 'Christocentric' focus doesn't become a 'general truth' about grace, but remains tied to the specific 'One Lord' of the Galilee shore."
    },
    "8_depth_and_length": {
      "score_1_to_10": 9,
      "findings": "At approximately 3,400 words, the sermon likely exceeds 30 minutes. This provides the 'breadth' Miskotte and Dekker require for theological depth. It does not rush the gravity of the text.",
      "improvement_point": "None. The length is adequate for the substantive weight attempted."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker's ideal primarily in its formal structure; it functions as a thematic lecture on 'resurrection principles' rather than a direct recreation of the Bible passage into a new, proclamatory word. It relies heavily on a 'points-based' system that separates exposition from application. However, it is substantively strong in its Trinitarian depth, its refusal of moralism, and its concrete psychological application of the 'three parts' (misery, redemption, gratitude).",
    "strengths": [
      "Theologically substantive treatment of substitutionary atonement and grace.",
      "Concrete, non-vague application to modern suffering and psychological states.",
      "Serious engagement with the 'misery' of the human condition (homo incurvatus in se)."
    ],
    "weaknesses": [
      "Thematic structure ('4 principles') hinders the 'interwovenness' of the Word.",
      "Apologetic focus on 'proving' the resurrection distracts from the 'proclamation' of the Word.",
      "Treats the specific text as a 'case study' for general principles rather than a unique revelation."
    ],
    "final_judgment_according_to_dekker": "This is a strong, substantive piece of Christian teaching that meets many of Dekker's substantive criteria (3-2-1 rule), but it struggles with the formal definition of a sermon as the 'actualization' of a specific text. It is more a 'speech about the gospel' using Peter as an example than a sermon that lets THIS text say what can be found nowhere else."
  }
}