{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "Encountering the Risen Jesus",
    "bible_text": "Mark 14:27-31; John 21:15–19",
    "notes": "A sophisticated homiletic approach using historical-critical evidence and psychological vulnerability to build rapport."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 8,
        "score_explanation": "10 = Completely free from coercive judgments. The preacher avoids 'shaming' the listener directly, instead using Peter as a proxy for human failure.",
        "presence_of_coercion": "Low",
        "analysis": "Coercion is replaced by 'historical necessity' and 'logical consequence.' The preacher doesn't say 'You must,' but rather 'If you want X, you have to do Y.'",
        "quotes": [
          "If you want to encounter the risen Christ, you have to believe..."
        ]
      },
      "healthy_care_NP": {
        "score": 7,
        "score_explanation": "10 = Healthy, non-smothering care. The preacher offers a path for restoration without demanding dependency on himself.",
        "presence": "Medium",
        "analysis": "The Nurturing Parent is channeled through the character of Jesus in the narrative, offering 'grace' as a solution to 'failure.'",
        "quotes": [
          "Jesus starts to restore him. How? ... He is cooking fish so they can sit down and eat."
        ]
      }
    },
    "adult": {
      "score": 9,
      "score_explanation": "10 = Strong Adult presence. The preacher uses a high degree of logic, historical evidence, and literary analysis.",
      "presence": "High",
      "analysis": "The preacher addresses the listener as a thinking subject, citing scholars (Bauckham) and using logical 'if-then' propositions. He invites the listener to 'think about it for a second.'",
      "quotes": [
        "You need to do the hard work by looking at the internal and external evidence...",
        "Think of the resources that belief in the resurrection gives you..."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 7,
        "score_explanation": "10 = Free from fear/compliance. The preacher admits his own struggle with the text, avoiding a 'perfect' persona.",
        "presence_of_adaptation": "Low",
        "analysis": "The preacher uses the 'Dick Lucas' anecdote to show a preacher moving from a rigid Adapted Child/Critical Parent state toward an authentic Free Child/Adult state.",
        "quotes": [
          "Who will deliver me from this body of death?"
        ]
      },
      "free_child_FC": {
        "score": 6,
        "score_explanation": "10 = Authentic, playful, joyful. The preacher uses humor and cultural references (The Princess Bride).",
        "presence": "Medium",
        "analysis": "There is a controlled use of the Free Child to make the sermon engaging, though it remains largely within the Adult/Parent instructional framework.",
        "quotes": [
          "Every time you watch The Princess Bride you feel good.",
          "Stop your blubbering. Suck it up, woman!"
        ]
      }
    },
    "dominant_ego_position": "Adult (processing data and history) transitioning to Nurturing Parent (offering grace)."
  },
  "transaction_analysis": {
    "primary_transaction_style": "Adult -> Adult",
    "analysis": "The preacher primarily uses an informational style, providing evidence for the resurrection and the mechanics of the 'death-resurrection pattern.'",
    "ulterior_motives": "The 'Social' transaction is Adult-Adult (discussing history/theology), while the 'Psychological' transaction is Nurturing Parent -> Child (offering comfort for the listener's hidden failures).",
    "communicative_purity_score": 8,
    "purity_explanation": "10 = Transparent. The preacher is quite open about his rhetorical goals and the 'process' of belief.",
    "risk_explanation": "The risk lies in the 'Bait & Switch' of using historical logic (Adult) to lead into a requirement for total 'death of self' (Child submission)."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "Redemption / Bait & Switch",
        "probability": "Low",
        "formula_g_analysis": {
          "con": "The promise of historical evidence and intellectual respectability.",
          "gimmick": "The listener's secret sense of moral failure/inadequacy.",
          "switch": "Moving from 'Is this true?' to 'You are a failure who needs grace.'",
          "payoff": "The listener feels relieved/accepted despite their 'shame'."
        },
        "evidence_quotes": [
          "This story is strong evidence that the Gospels are eyewitness accounts... [Switch] ...Lord, I am a total moral failure."
        ]
      }
    ],
    "absence_of_games_analysis": "The sermon largely avoids 'NIGYSOB' because the preacher includes himself and his heroes (Peter, Lucas) in the category of 'failures,' preventing a Persecutor role."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "High. The preacher presents the 'Gospel' as the solution to the listener's 'disordered loves' and 'failures.'",
      "persecutor": "Low. The preacher avoids blaming the congregation, instead using Peter as the 'Victim' of his own ego.",
      "victim": "Low. The preacher briefly adopts a 'Victim' stance through the Dick Lucas story to build empathy."
    },
    "congregation_position": "The congregation is invited to identify with Peter (the Victim/Failure) to be 'Rescued' by the grace described.",
    "escape_possibilities": "The sermon offers a path to 'Autonomy' by encouraging the listener to 'do the hard work' of thinking and to develop 'strength and boldness' in their own life."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 8,
    "summary": "This sermon is psychologically robust because it avoids direct coercion and shaming. By utilizing a strong Adult ego position (historical evidence), it builds a foundation of intellectual trust before moving into the more emotive Nurturing Parent/Child dynamics of 'grace' and 'failure.' The preacher avoids the Drama Triangle by placing the 'Persecutor' role on the internal 'disordered loves' rather than the congregation or the outside world.",
    "strengths": [
      "High Adult-Adult engagement through historical reasoning.",
      "Vulnerability through self-deprecating anecdotes (Dick Lucas).",
      "Avoidance of 'Ain't it Awful' collective complaining."
    ],
    "areas_for_improvement": [
      "The 'death-resurrection pattern' could be interpreted as a demand for 'Adapted Child' compliance if not careful.",
      "The 'you have to' language occasionally slips into Critical Parent territory."
    ],
    "advice_for_game_free_communication": "Continue to emphasize the 'Adult' process of questioning. Ensure that the 'death of self' is presented as a liberating choice (Free Child/Adult) rather than a required submission (Adapted Child)."
  }
}