{
  "metadata": {
    "sermon_title": "How to Dress for a Wedding: Salisbury",
    "bible_text": "Matthew 22:1-14",
    "estimated_word_length": 1850,
    "estimated_duration_minutes": 18,
    "sermon_start_end": "In cultures the world over, weddings are generally the biggest parties that families ever give. God loves parties. Did you know that? From one end to another, the Bible is full of imagery about parties. We read in the book of the Exodus: “Moses and Aaron went to Pharaoh [...] No wonder St. Paul summons us (in today’s lesson) to “rejoice in the Lord always, and again I say rejoice!” (Philippians 4:4). “Blessed are those who are invited to the marriage supper of the Lamb” (Revelation 19:9). Amen."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 5,
      "findings": "The sermon uses Matthew 22 as a springboard, but quickly deviates into a general thematic discourse on 'parties'. It fails to identify what is unique to this specific text that cannot be found elsewhere, treating it instead as a generic illustration of God's hospitality.",
      "quotes": [
        "From one end to another, the Bible is full of imagery about parties.",
        "Today’s parable is usually called 'The Parable of the Marriage Feast,' but one wise commentator calls it 'The Parable of God’s Rejected Invitation,' and that is a much more helpful title."
      ],
      "improvement_point": "Focus on the specific violent and abrupt elements of the Matthean version (the king's rage, the burning of the city) which distinguish it from Luke's 'Great Banquet' and other 'party' texts."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 4,
      "findings": "Exegesis is superficial. While Middle Eastern hospitality is mentioned, there is no engagement with the Greek text or the specific theological-historical context of Matthew's community. The preacher relies on 'wise commentators' rather than rigorous linguistic or historical analysis.",
      "quotes": [
        "Hospitality in the ancient Near East... is a major cultural preoccupation.",
        "Calvin solves the first problem nicely, to my mind..."
      ],
      "improvement_point": "Incorporate the historical-critical reality of the 'king' as a figure of judgment and the specific meaning of the 'wedding garment' in the context of first-century Jewish-Christian expectations."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 6,
      "findings": "The application is concrete regarding social class and church culture (Episcopalians vs. Pentecostals), which aligns with Dekker's demand for sociological awareness. However, it often veers into personal anecdote (the Opera story) which risks becoming 'psychology' rather than 'proclamation'.",
      "quotes": [
        "It’s a little difficult for us Episcopalians to get on board with this feasting business.",
        "I tell this little story to illustrate the theme... that we are all members of the fellowship of human foolishness."
      ],
      "improvement_point": "Move from personal 'foolishness' to the concrete 'misery' of the contemporary hearer's refusal of God's grace."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 5,
      "findings": "The sermon is a mixture, but not the 'recreative' movement Dekker describes. It functions more as a thematic essay where the text is used to support observations about parties and social snobbery, rather than the text 'expounding' the hearer.",
      "quotes": [
        "I tell this little story to illustrate the theme I have been talking about ever since I arrived..."
      ],
      "improvement_point": "Allow the text's own structure to dictate the flow, so that the application arises directly from the specific words of the pericope rather than external themes."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "Misery is present in the form of 'human foolishness' and social snobbery. Redemption is framed as the 'invitation to joy'. However, the 'misery' lacks the depth of being 'before God'; it feels more like social critique.",
      "quotes": [
        "we are all members of the fellowship of human foolishness.",
        "The invitation was sheer grace."
      ],
      "improvement_point": "Deepen the 'misery' aspect by emphasizing the radical nature of the 'outer darkness' as a consequence of rejecting the specific righteousness (garment) of Christ."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 7,
      "findings": "This is a stronger point. The preacher does not shy away from the 'outer darkness' or the 'weeping and gnashing of teeth', though she attempts to soften it as a 'metaphorical way of describing' self-exclusion. The seriousness of the choice is maintained.",
      "quotes": [
        "Then the king said to the attendants, ‘Bind him hand and foot, and cast him into the outer darkness...’",
        "The problem is our unwillingness to put on the garment that God gives us."
      ],
      "improvement_point": "Avoid the impulse to immediately 'solve' the tension of the two ways with metaphors; let the threat of loss stand as a concrete possibility of the human 'life design'."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 6,
      "findings": "Christ is identified as the garment and the goal (telos). However, the sermon spends more time on the 'party' concept than on the person of Christ. The 'two natures' doctrine is not explicitly or implicitly foundational to the argument.",
      "quotes": [
        "What is the garment? St. Paul tells us: 'As many of you as were baptized into Christ have put on Christ'.",
        "the marriage of Christ the Bridegroom to the Church his Bride."
      ],
      "improvement_point": "Make Christ's divinity and sacrifice more central to why the 'garment' is necessary and how it is provided, rather than treating it as a clothing metaphor."
    },
    "8_depth_and_length": {
      "score_1_to_10": 5,
      "findings": "At approximately 18 minutes (1850 words), the sermon falls just short of Dekker's 20-minute minimum. The 'breadth' is filled with anecdotes rather than the 'depth' of theological exegesis.",
      "improvement_point": "Increase the exegetical weight and theological density to reach the 20-minute threshold of 'depth'."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker’s ideal primarily by substituting rigorous exegesis with thematic storytelling and personal anecdotes. While it captures the 'two ways' and addresses social 'misery', it treats the Bible passage as an illustration for a general truth about 'God's hospitality' rather than a unique, current word that can be found nowhere else. The duration is insufficient for the 'depth' Dekker demands.",
    "strengths": [
      "Concrete sociological application regarding class and church identity.",
      "Refusal to ignore the 'hard' ending of the parable (the outer darkness).",
      "Clear identification of Grace as the source of the invitation."
    ],
    "weaknesses": [
      "Lack of original language engagement and historical-critical depth.",
      "Over-reliance on personal narrative (the Opera anecdote) which distracts from the Word.",
      "Failure to isolate the 'uniqueness' of the Matthew 22 text compared to other banquet parables."
    ],
    "final_judgment_according_to_dekker": "This is an adequate homily but a weak 'sermon' by Dekker's standards. It functions more as a 'speech about the gospel' than an actualization of the specific written Word of God. It lacks the 'bicycle mechanic's' precision in mounting the wheel of exegesis to the frame of application."
  }
}