{
  "metadata": {
    "sermon_title": "Living Water for the Ungodly",
    "bible_text": "Romans 5:6–8; John 4:7-14",
    "estimated_word_length": 1850,
    "estimated_duration_minutes": 18,
    "sermon_start_end": "When I was a little girl here in Franklin, my grandmother, Emily Norfleet Parker, used to read to me out of the Bible. There is no question in my mind that her devoted love for me created the context for my lifelong love for the Bible. [...] Draw near today with renewed faith as our living Lord speaks to us all in the words he spoke to that outcast Samaritan woman: “Whoever drinks of the water that I shall give him will never thirst; the water that I shall give him will become in him a spring of water welling up to eternal life.” AMEN."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon utilizes two passages, which Dekker warns against as it risks general themes. However, the preacher successfully uses Romans 5 as a lens for John 4. The specificity of the Samaritan woman's isolation is well-handled, but the 'nowhere else' quality is slightly diluted by the heavy use of external historical anecdotes.",
      "quotes": [
        "This sermon shows how the Epistle to the Romans illuminates a story from the Gospels.",
        "That is the reason for the woman coming to the well in the middle of the day; she did not want to face the other women of the town."
      ],
      "improvement_point": "Focus more on the unique dialogue between Jesus and the woman rather than general civil rights parallels to find the 'unique' word of this text."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 7,
      "findings": "The preacher demonstrates strong knowledge of the socio-religious context (Samaria vs. Judea, gender roles, water rights). The 'six demerits' analysis shows a clear understanding of the scandalous nature of the encounter in its original setting.",
      "quotes": [
        "Jews like Jesus did not go to Samaria if they could help it.",
        "Jewish men of that day were not supposed to address women in public, even Jewish women, let alone Samaritan women."
      ],
      "improvement_point": "While the cultural history is strong, more direct engagement with the Greek nuances of 'living water' (hydōr zōn) would deepen the exposition."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 8,
      "findings": "The application is exceptionally concrete. The preacher uses specific names (Monica Lewinsky, Linda Tripp, Virginia Durr) and personal confession. It avoids generalities by naming the 'Samaritans' of the preacher's own time and place.",
      "quotes": [
        "Last Wednesday night, Monica Lewinsky made a big point of distancing herself from Linda Tripp.",
        "I was living in Richmond in a white neighborhood and going to a white church and paying our housekeeper some appallingly subhuman wage."
      ],
      "improvement_point": "Ensure the political examples do not overshadow the theological reality of the 'water' itself."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 7,
      "findings": "The sermon moves fluidly between the biblical narrative and contemporary parallels. The hearer is not given a lecture followed by a moral, but is drawn into the movement of the text through the examples.",
      "quotes": [
        "Who are the 'Samaritans' and who are the 'Jews'?",
        "Jesus, however, is not ashamed to place himself in the company of those who are needy. Notice, however..."
      ],
      "improvement_point": "The middle section on Virginia Durr is quite long; it risks the text becoming an illustration for the history rather than the history being an exposition of the text."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "Misery is clearly defined as 'original sin' and the universal habit of looking down on others. Redemption is found in Christ's death for the ungodly. Gratitude is present but less developed, appearing mainly as the woman's missionary zeal.",
      "quotes": [
        "It was a perfect demonstration of original sin, an ailment that afflicts every human being on this earth.",
        "While we were still helpless, Christ died for the ungodly."
      ],
      "improvement_point": "Develop the 'gratitude' (sanctification) aspect more clearly—what does the 'spring of water' look like in the life of the believer today?"
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 5,
      "findings": "The sermon emphasizes the 'lostness' of being an outcast or a self-righteous sinner (temporal loss). However, the 'narrow way' and the ultimate seriousness of eternal destruction are softened by a very inclusive tone.",
      "quotes": [
        "We can always find someone worse that we feel superior to.",
        "In the Lord’s sight all of us are ungodly Samaritans."
      ],
      "improvement_point": "Address the consequence of refusing the 'living water' to maintain the gravity Dekker requires regarding the 'two ways'."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 8,
      "findings": "Christ is clearly the telos. The sermon emphasizes that grace is for the 'ungodly' and that Christ is the source of life outside of ourselves. The doctrine of the two natures is implicit in the description of Jesus' weariness and his Messianic authority.",
      "quotes": [
        "The water that Jesus gives is his own self, his own divine life.",
        "He didn’t wait until we had clean hands and a pure heart."
      ],
      "improvement_point": "Explicitly link the 'divine life' offered to the specific promises in the John text to avoid a general 'grace' concept."
    },
    "8_depth_and_length": {
      "score_1_to_10": 5,
      "findings": "At roughly 1850 words, the sermon likely clocks in under 20 minutes in a liturgical setting. According to Dekker, this lacks the 'breadth' required for true depth.",
      "improvement_point": "Expand the exegetical depth of the Romans passage to meet the 20-minute threshold."
    }
  },
  "overall_assessment": {
    "summary": "The sermon is a strong example of concrete application but falls short of Dekker's length requirement and the 'two ways' rigor. It successfully avoids general truths by naming specific contemporary figures and personal sins. The Christocentric focus is sharp, though the dual-text approach slightly diffuses the specificity of a single pericope.",
    "strengths": [
      "Concrete application using specific historical and contemporary names.",
      "Strong socio-historical exposition of the Samaritan context.",
      "Clear articulation of grace for the 'ungodly' (Christ as telos)."
    ],
    "weaknesses": [
      "Duration is likely under the 20-minute minimum for 'depth'.",
      "The 'two ways' (eternal loss) is under-thematized in favor of a more inclusive focus on universal sin.",
      "Uses two main texts instead of one specific passage."
    ],
    "final_judgment_according_to_dekker": "This is a functional sermon that excels in 'application' and 'Christocentricity,' but requires more 'breadth' and a sharper focus on the 'two ways' to fully satisfy Dekker's criteria."
  }
}