{
  "metadata": {
    "sermon_title": "Believing Without Seeing: All Saints Chapel, Sewanee, Tennessee",
    "bible_text": "John 20:29 (Note: Text incorrectly cited as John 21:29 in the source)",
    "estimated_word_length": 1650,
    "estimated_duration_minutes": 16.5,
    "sermon_start_end": "Here are pictures of Jesus on the most recent covers of three newsmagazines: Time, Newsweek, and U.S. News and World Report. As a secular friend said, “Hey, your man made it!” The Newsweek article is the best. Kenneth Woodward, that fine religion reporter, tries his best as a good [...] And so this morning, through the word of this merely human witness, the risen Lord looks at you this very day — looks past Thomas and the other disciples through the walls of All Saints’ Chapel and across eternity and says, “Blessed are they who have not seen, and yet believe.” Alleluia! Amen."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon focuses on the narrative of Thomas. However, it struggles to identify what is unique to this text that cannot be found elsewhere. It treats the text as a general illustration of 'faith vs. sight' rather than mining the specific logic of John's Gospel. The actualization of the Word is present but leans toward narrative retelling rather than a 'new, current, proclamatory word.'",
      "quotes": [
        "As the Gospel of John presents this disciple, he was a congenital pessimist to begin with",
        "The words that Thomas speaks — My Lord and my God — are the supreme titles given to Jesus in the Bible."
      ],
      "improvement_point": "Identify the specific 'scandal' of this text: why does Jesus specifically use Thomas's own words against him? Focus on the unique Johannine 'sign' theology rather than general psychological pessimism."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 5,
      "findings": "The preacher shows awareness of the Johannine structure (the Prologue connection) and cites Calvin/MacLaren. However, there is no evidence of Greek/Hebrew engagement as Dekker requires. The exegesis is more 'character study' (psychologizing Thomas) than a rigorous historical-theological exposition of the text's original meaning for the first readers.",
      "quotes": [
        "Thomas was a believer in Murphy’s law, so to speak.",
        "The fourth Gospel has come full circle; the proclamation of the Prologue... reaches its true destination on the lips of Thomas."
      ],
      "improvement_point": "Move away from psychological labels like 'congenital pessimist' and 'Murphy’s law' toward the specific theological crisis of the post-apostolic community for whom John was writing."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 4,
      "findings": "The application is largely anecdotal (the New York story) or general. It touches on 'modern life feeling' but fails to address the specific zeitgeist or concrete societal/political realities Dekker demands. The 'Carnation Instant Breakfast' is a concrete detail, but it serves a personal narrative rather than a theological application for the congregation.",
      "quotes": [
        "I think many of us can sympathize with the way that Thomas went off to hug his misery to himself",
        "Is there anyone here today who is wondering if the Resurrection could possibly be true?"
      ],
      "improvement_point": "Replace the long personal anecdote about driving in New York with a concrete analysis of why modern 'seeing' (scientific empiricism or digital skepticism) prevents the 'stance of the whole person' described."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 5,
      "findings": "The sermon follows a traditional 'story-then-lesson' structure. The first half is a personal narrative, the middle is biblical retelling, and the end is application. They are not 'mixed' in one movement. The hearer is an observer of the preacher's experience first, then an observer of Thomas, rather than being 'expounded' together with the text.",
      "quotes": [
        "I have a vivid memory of the first Easter Sunday I spent in New York City in 1982.",
        "On the evening of the day of Resurrection... the disciple Thomas had a lot more to feel depressed about"
      ],
      "improvement_point": "Integrate the contemporary struggle with doubt directly into the verse-by-verse movement of the text instead of separating them into distinct blocks."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "Misery is present in the form of Thomas's bitterness and the 'lifeless' streets. Redemption is clear in Christ's appearance. Gratitude is the 'Alleluia' response. However, the misery is framed more as a 'bad mood' or 'bummed' feeling rather than 'misery before God.' It is slightly too psychological.",
      "quotes": [
        "I was beginning to feel really bummed.",
        "Thomas was not with them; he was so angry and bitter and broken up that he could not, or would not, seek fellowship"
      ],
      "improvement_point": "Deepen the 'misery' from psychological depression to the theological state of being 'faithless'—the ontological lostness of being without the Risen Lord."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 3,
      "findings": "This is very weak. There is no mention of the 'broad way' or the possibility of being lost (temporal or eternal). The sermon assumes a 'blessed' outcome for all. The choice is presented as a gentle invitation rather than a life-and-death destination. The seriousness of 'faithless' vs. 'believing' is softened.",
      "quotes": [
        "Jesus doesn’t let Thomas forget it, though. 'Thomas,' he says... 'do not be faithless, but believing.'",
        "The Lord looks up and out... speaking to you and to me, he utters the last Beatitude"
      ],
      "improvement_point": "Address the consequence of remaining 'faithless.' What happens if one stays behind the 'locked doors' or 'iron gates' of the self? The 'two ways' must be made explicit."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 7,
      "findings": "Strongest point. Christ is the telos. The preacher correctly identifies Christ as 'Lord and God' (two natures) and emphasizes that grace precedes knowledge. The sermon successfully points to salvation outside the self.",
      "quotes": [
        "Jesus actually grants to Thomas the signs which he so presumptuously had demanded. It is a perfect example of the way grace goes before knowledge of sin",
        "My Lord and my God — are the supreme titles given to Jesus in the Bible."
      ],
      "improvement_point": "Ensure that Christ as 'telos' is not just a historical figure in a story, but the active, present Lord who 'looks past Thomas' to judge and save the hearer today."
    },
    "8_depth_and_length": {
      "score_1_to_10": 4,
      "findings": "At approximately 16.5 minutes (1650 words), the sermon fails Dekker's 20-minute minimum requirement. It lacks the 'breadth' needed for 'depth.' The long personal introduction consumes space that should have been used for deeper exegetical or dogmatic expansion.",
      "improvement_point": "Expand the theological reflection on the 'two ways' and the specific Johannine context to reach the 20-minute threshold."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker’s criteria primarily due to its length, its heavy reliance on personal anecdote, and its failure to address the 'two ways.' It psychologizes the biblical text (Thomas as a 'pessimist') rather than providing a rigorous theological exposition. While it is Christocentric and emphasizes grace, it lacks the 'sharpness' and 'specificity' of a sermon that finds what is unique to this text alone.",
    "strengths": [
      "Clear Christological focus on the divinity of Jesus ('My Lord and my God').",
      "Effective illustration of grace preceding the recognition of sin in the interaction between Jesus and Thomas.",
      "Adequate connection between the Johannine Prologue and the climax of the narrative."
    ],
    "weaknesses": [
      "Insufficient length (under 20 minutes) prevents the necessary 'breadth' for theological depth.",
      "Excessive personal narrative (the New York drive) that does not serve the exposition of the Word.",
      "Complete absence of the 'two ways' or the seriousness of being lost.",
      "Psychologizing the text (Murphy's Law, 'bummed') instead of theological exegesis."
    ],
    "final_judgment_according_to_dekker": "This is an 'adequate' speech with homiletical qualities, but it is not a 'sermon' in the full sense of Dekker’s theses. It prioritizes the preacher's experience over the text's specific uniqueness and avoids the hard edges of the Gospel's demand for choice and the reality of lostness."
  }
}