{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "Believing Without Seeing",
    "bible_text": "John 21:29 (John 20:19-29)",
    "notes": "Delivered at All Saints Chapel, Sewanee, 1996. Focuses on the narrative of Thomas."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 8,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "Low",
        "analysis": "The preacher avoids 'must' and 'should' language. While he identifies Thomas's behavior as 'obstinate,' he does so to set up a narrative of grace rather than to shame the listener.",
        "quotes": [
          "Thomas is not just a doubter, he is 'downright obstinate'",
          "very much like many of us, don’t you think, when we are mad at God"
        ]
      },
      "healthy_care_NP": {
        "score": 9,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "High",
        "analysis": "The Nurturing Parent is strong but healthy. He validates the listener's feelings of depression and isolation without creating dependency, using personal vulnerability to build a bridge.",
        "quotes": [
          "I was beginning to feel really bummed.",
          "Jesus’ willingness to meet Thomas’s conditions exposes the disciple’s effrontery far more effectively than any rebuke"
        ]
      }
    },
    "adult": {
      "score": 7,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "Medium/High",
      "analysis": "The preacher uses the Adult to process journalistic data (Time, Newsweek) and historical context. He invites the listener to think about their own 'conditions for faith' as a conscious subject.",
      "quotes": [
        "Modern commentators are agreed that... Thomas did not actually touch Jesus.",
        "This morning I have nothing to show you in the way of proofs — no legal arguments, no signs..."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 9,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "Low",
        "analysis": "There is no evidence of the preacher speaking from a place of fear or trying to force the congregation into a submissive, fearful role.",
        "quotes": []
      },
      "free_child_FC": {
        "score": 8,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "High",
        "analysis": "The Free Child is evident in the vivid, sensory storytelling of New York City and the spontaneous 'shouting across Broadway.'",
        "quotes": [
          "I shouted — all the way across Broadway — 'David! The Lord is risen!'",
          "I was seized by this irresistible impulse"
        ]
      }
    },
    "dominant_ego_position": "Nurturing Parent / Adult"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Adult -> Adult with Nurturing Parent support",
    "analysis": "The preacher primarily uses a narrative approach that invites the listener into a shared human experience (Adult). He moves from his own vulnerability to the biblical text, maintaining a peer-like relationship.",
    "ulterior_motives": "Minimal. The preacher is transparent about his lack of 'magical proofs.'",
    "communicative_purity_score": 9,
    "purity_explanation": "10 = Completely transparent/Pure. 0 = Highly manipulative/Ulterior.",
    "risk_explanation": "The only slight risk is the 'we' identification, which can sometimes be a soft-coercion (Parent), but here it feels like authentic solidarity."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "None",
        "probability": "Low",
        "formula_g_analysis": {
          "con": "N/A",
          "gimmick": "N/A",
          "switch": "N/A",
          "payoff": "N/A"
        },
        "evidence_quotes": []
      }
    ],
    "absence_of_games_analysis": "The sermon avoids 'ITHY' (I'm Only Trying to Help You) by not offering a simplistic 3-step solution. It avoids 'NIGYSOB' by treating Thomas's (and the listener's) doubt with empathy rather than judgment. It avoids 'Bait & Switch' by being honest from the start that there are no 'magical proofs' to be offered."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "Low; he does not claim to have the answers that will 'fix' the listener's doubt.",
      "persecutor": "Very Low; even the 'obstinate' label is applied with a sense of shared humanity.",
      "victim": "Low; he shares a moment of feeling 'bummed' but does not stay in the Victim role to garner pity."
    },
    "congregation_position": "The congregation is invited into the role of 'Witness' or 'Fellow Traveler' rather than Victim.",
    "escape_possibilities": "The sermon offers autonomy by defining faith as a 'stance of the whole person' rather than a forced intellectual assent."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 9,
    "summary": "This sermon is psychologically healthy and remarkably game-free. It utilizes the preacher's Adult ego state to analyze the text and his Free Child to provide authentic, relatable anecdotes. By identifying with the 'obstinate' Thomas, the preacher levels the hierarchy, moving away from a Critical Parent position. The sermon promotes autonomy by acknowledging that faith cannot be coerced by 'magical proofs' but is a personal trust. The transition from the preacher's personal loneliness in NYC to the communal joy of the Resurrection is handled without 'smothering' the listener, allowing them space to reflect on their own conditions for belief.",
    "strengths": [
      "High level of transparency and vulnerability.",
      "Avoidance of moralistic 'musts' or 'shoulds'.",
      "Strong Adult-to-Adult engagement regarding the nature of faith."
    ],
    "areas_for_improvement": [
      "The use of 'we' (e.g., 'many of us... stay away from the Lord’s Supper') could be perceived as a mild Parent-to-Child assumption of the listener's behavior."
    ],
    "advice_for_game_free_communication": "Continue to use 'I' statements to describe the struggle with faith, as this maintains the Adult-Adult transaction and prevents the listener from feeling 'parented' or judged."
  }
}