{
  "metadata": {
    "sermon_title": "Jesus Will Show",
    "bible_text": "Matthew 25:31-46 (primary), 1 Corinthians 15:22, Ezekiel 34:17",
    "estimated_word_length": 1950,
    "estimated_duration_minutes": 19.5,
    "sermon_start_end": "Of all days in the calendar of the Christian church, this one has the most spacious horizon. We are poised between the human past and the divine future. On this last Sunday of the liturgical year we look both backward and forward. We look back over the completed story [...] At the last judgment, “Adam” will disappear into outer darkness forever, and we will be refashioned in the image of him who is King of kings and Lord of lords among the least, the last, and the lost. Amen."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon centers on the Matthew 25 pericope. It identifies the specific tension of the 'Judge who was judged,' which is a strong thematic hook. However, it leans heavily on general liturgical themes (Christ the King) rather than mining what is uniquely present in this text that is found 'nowhere else.'",
      "quotes": [
        "The impression burned into our hearts today by the passage from Matthew is this: on that climactic and final day, we will be there."
      ],
      "improvement_point": "Focus more on the specific 'surprise' of the sheep and goats—the unconscious nature of the service—as the unique textual element rather than the general concept of judgment."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 5,
      "findings": "The preacher identifies the historical context of the Messiah and the early church's waiting period. However, there is no evidence of Greek/Hebrew linguistic depth or rigorous historical-critical engagement as Dekker demands. The exegesis remains at a narrative level.",
      "quotes": [
        "When this story was retold by Matthew, the members of his church were asking questions about how they should conduct themselves in the lengthening period of time until Jesus would come back."
      ],
      "improvement_point": "Incorporate deeper philological or historical insights regarding the 'least of these' (adelphoi) to distinguish between general charity and specific solidarity."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 4,
      "findings": "The application is somewhat general. While it mentions Robert Hughes and John McCain, these serve more as illustrations than concrete applications for the specific congregation. The mention of 'Pledge Sunday' is a practical application but feels tacked on rather than derived from the text's spiritual depth.",
      "quotes": [
        "In a strange way, it is also why we have Pledge Sunday. You are being asked, today, to give a substantial amount of your money to organized religion."
      ],
      "improvement_point": "Move beyond 'giving money' to the specific, concrete ways the congregation encounters the 'hidden Christ' in their specific local context (New Canaan)."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 6,
      "findings": "The sermon avoids the 'block' structure (first exegesis, then application). It moves between the text's imagery and contemporary skepticism (Hughes) or human nature (Adam). The hearer is somewhat drawn into the movement of the text.",
      "quotes": [
        "Let us pause for a moment and let this incredible statement sink into our minds and hearts."
      ],
      "improvement_point": "Deepen the 'expounding' of the hearer by showing how the text's specific logic (unconscious service) exposes the hearer's current motivations."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 7,
      "findings": "The sermon strongly reflects the 'three parts.' It deals honestly with human misery ('the old Adam'), the necessity of redemption outside the self ('the Judge judged in our place'), and the resulting gratitude ('rejoice and be glad to offer').",
      "quotes": [
        "If Christ is going to judge me by all the things I have not done... then I am doomed indeed.",
        "covering our unrighteousness with his righteousness, offering his life to save us from death."
      ],
      "improvement_point": "Ensure the 'misery' part is not just a general 'we are all bad' but the specific misery of failing to see Christ in the neighbor."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 7,
      "findings": "The preacher does not shy away from the 'two ways.' The reality of being 'cursed' and 'eternal fire' is mentioned, and the seriousness of the final judgment is maintained against modern skepticism.",
      "quotes": [
        "The goats he will place at his left hand, and to them he speaks terrible words, words that chill the heart: 'Depart from me, you cursed...'"
      ],
      "improvement_point": "Connect the 'being lost' more clearly to the 'temporal loss' Dekker mentions—how failing to answer the call results in a lost life now."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 8,
      "findings": "This is the sermon's strongest point. Christ is clearly the telos. The preacher emphasizes the 'Judge judged in our place,' which is a classic Barthian/Reformed move, ensuring grace is the final word.",
      "quotes": [
        "He has compensated for our too-short list of good deeds by his one great deed.",
        "the Judge judged in our place."
      ],
      "improvement_point": "Explicitly link the 'two natures' of Christ to the ability to be both the cosmic King and the suffering brother."
    },
    "8_depth_and_length": {
      "score_1_to_10": 5,
      "findings": "At roughly 1950 words, the sermon likely clocks in just under the 20-minute threshold at a deliberate pace. According to Dekker's strict rule, it lacks the 'breadth' required for maximum depth.",
      "improvement_point": "Expand the exegetical section to provide more 'breadth' for the theological 'depth' to inhabit."
    }
  },
  "overall_assessment": {
    "summary": "The sermon is a solid theological address that aligns well with the substantive 3-2-1 rule but falls short on the formal requirements of specific exegesis and length. It correctly identifies the human condition (misery) and the substitutionary work of Christ (redemption), but the application to the 'zeitgeist' is somewhat fragmented between an art critic and a political figure, missing a direct hit on the congregation's specific life.",
    "strengths": [
      "Strong Trinitarian and Christocentric focus, avoiding moralism.",
      "Serious treatment of the 'two ways' and the reality of judgment.",
      "Effective use of the 'Adam' motif to explain the human condition."
    ],
    "weaknesses": [
      "Insufficient technical exegesis (Hebrew/Greek/Contextual history).",
      "Application to 'Pledge Sunday' feels like a functional necessity rather than a textual demand.",
      "Duration is slightly below the Dekker threshold for 'depth'."
    ],
    "final_judgment_according_to_dekker": "This is an adequate sermon that functions as a 'proclamatory word.' It succeeds in making the Bible passage current but lacks the scholarly 'exposition' (Thesis 2) and the 'breadth' (Thesis 8) that Dekker considers essential for the craft."
  }
}