{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "Lord, Not My Feet Only",
    "bible_text": "John 13:3-4",
    "notes": "Maundy Thursday service focusing on the footwashing and the atonement."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 8,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "Low",
        "analysis": "The preacher explicitly deconstructs the 'must' and 'duty' of the congregation, replacing it with 'being drawn.' There is a brief CP moment regarding 'pecking orders,' but it is used to critique the congregation's past behavior rather than to shame them now.",
        "quotes": [
          "On the surface, you may think that you came tonight from duty... but those are not the real reasons.",
          "We heard plenty about access to power during the recent uproar... didn't we?"
        ]
      },
      "healthy_care_NP": {
        "score": 9,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "High",
        "analysis": "The Nurturing Parent is very strong, providing a warm welcome and emotional safety. It avoids 'smothering' by emphasizing the listener's autonomy to receive grace.",
        "quotes": [
          "Think of yourselves as Jesus' very own beloved disciples.",
          "It is particularly heartwarming to see young people."
        ]
      }
    },
    "adult": {
      "score": 7,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "Medium/High",
      "analysis": "The preacher uses the Adult to process historical context and biblical scholarship (Greek 'morphe', 'negation'). This invites the listener to think and understand the 'primary meaning' versus the 'secondary meaning.'",
      "quotes": [
        "Biblical interpreters over the centuries almost unanimously agree...",
        "Greek scholars point out that this is a very strong negation."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 7,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "Low/Medium",
        "analysis": "The preacher admits to her own AC ('That alarms me... I found it easier just to pass it by'), which models vulnerability. However, there is a slight push for the congregation to adopt a 'humble' (Adapted) stance at the end.",
        "quotes": [
          "The story burdened me.",
          "We can be stubborn, like Peter... or we can humbly receive."
        ]
      },
      "free_child_FC": {
        "score": 6,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "Medium",
        "analysis": "There is a touch of humor and spontaneity in the descriptions of church life, showing an authentic FC observing the absurdity of human behavior.",
        "quotes": [
          "It was pretty funny, actually.",
          "Peter—always the first one to speak and the first one to regret it."
        ]
      }
    },
    "dominant_ego_position": "Nurturing Parent / Adult"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Adult -> Adult (with NP support)",
    "analysis": "The preacher primarily engages in Adult-to-Adult transactions by explaining the theological shift from 'Law' (footwashing as a task) to 'Gospel' (footwashing as Christ's work).",
    "ulterior_motives": "There is a minor ulterior transaction where the preacher uses her own 'vulnerability' (AC) to lead the congregation into 'compliance' (AC) with the sermon's conclusion.",
    "communicative_purity_score": 8,
    "purity_explanation": "10 = Completely transparent/Pure. 0 = Highly manipulative/Ulterior.",
    "risk_explanation": "The risk is a 'Bait & Switch' where the comfort of the NP leads to a subtle demand for service at the very end, though it is framed as a 'willingness' rather than a 'must'."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "Redemption / Bait & Switch",
        "probability": "Low",
        "formula_g_analysis": {
          "con": "The promise that you don't have to work for your seat (Grace).",
          "gimmick": "The listener's exhaustion from 'pecking orders' and 'duty'.",
          "switch": "The shift from 'Jesus does it all' back to 'you will discover how that makes you more willing to enter other people's darkness'.",
          "payoff": "A renewed sense of obligation, though softened by the 'grace' context."
        },
        "evidence_quotes": [
          "I know it doesn't mean literally go out and wash feet, but I also know that it means doing things for other people that really might be unpleasant."
        ]
      }
    ],
    "absence_of_games_analysis": "The sermon largely avoids games by being honest about the 'burden' of the text. By moving from CP (Law) to A (Interpretation) to NP (Grace), the preacher maintains high transparency."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "Medium. The preacher 'rescues' the congregation from the burden of the Law by providing the 'primary meaning' of the text.",
      "persecutor": "Low. Only appears briefly when describing those who were 'annoyingly self-congratulatory' in the past.",
      "victim": "Low. The preacher briefly steps into the Victim role ('The story burdened me') to build rapport."
    },
    "congregation_position": "The congregation is initially addressed as Victims of social pecking orders and then invited to be the 'Beloved' (Receivers).",
    "escape_possibilities": "Yes. The sermon offers an escape into Autonomy by emphasizing that the 'cleansing' is a gift already given, freeing the listener from the 'points' system."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 8,
    "summary": "This sermon is psychologically healthy and demonstrates a high degree of integration. The preacher successfully moves the listener from a state of 'Adapted Child' (anxiety about worth and duty) into an 'Adult' understanding of grace, supported by a 'Nurturing Parent' voice. By admitting her own struggle with the text, she avoids the 'Persecutor' trap often found in Maundy Thursday sermons. The focus on 'being drawn' rather than 'being told' promotes psychological autonomy.",
    "strengths": [
      "Effective use of Adult ego state to clarify theological confusion.",
      "Strong Nurturing Parent presence that creates a safe environment for reflection.",
      "Vulnerability (Free Child/Adapted Child) used to build authentic connection."
    ],
    "areas_for_improvement": [
      "The transition at the end back to 'serving others' could be more clearly Adult-Adult to avoid a subtle 'Rescuer' dynamic.",
      "Slightly less focus on the 'A list/B list' could prevent the congregation from slipping back into a 'Victim' mindset regarding social status."
    ],
    "advice_for_game_free_communication": "Continue to use the 'Adult' to deconstruct 'Critical Parent' religious structures. Ensure that the call to service at the end remains an invitation for the 'Free Child' to respond in joy, rather than a new 'Adapted Child' requirement."
  }
}