{
  "metadata": {
    "sermon_title": "Lord, Not My Feet Only",
    "bible_text": "John 13:3-4 (with references to John 13:14-15, 15:16, Philippians 2:6-8, Luke 22:27)",
    "estimated_word_length": 1450,
    "estimated_duration_minutes": 14.5,
    "sermon_start_end": "This is a good crowd here tonight, considering the fact that it is a weeknight, but it isn't as large as the Palm Sunday or Easter congregations. That's all right. There wasn't a big crowd at the first Maundy Thursday service either. Rest assured that there is no [...] Do not go away without opening your heart to his love for you, his service to you, his purifying grace so freely offered, and his transforming power for your new life, beginning at this very moment. AMEN."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon stays close to the narrative of John 13, particularly the dialogue with Peter. However, it tends to drift into a 'biblical keyword' approach by pulling in Philippians 2 and Luke 22 to explain the concept of service, rather than letting the specific Johannine imagery of the 'outer garment' and 'basin' speak for itself. It misses the 'nowhere else' factor by treating the text as a generic illustration of the Atonement.",
      "quotes": [
        "There are many other Biblical texts that say the same thing in other words.",
        "The parallel use of words is important: he was in the form (Greek morphe) of God; he took the form (morphe) of a slave."
      ],
      "improvement_point": "Focus more on the unique Johannine irony where the 'glory' is found specifically in the 'humiliation' of the footwashing, rather than harmonizing it immediately with Paul's kenosis hymn."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 5,
      "findings": "The preacher demonstrates knowledge of the original languages (morphe, strong negations in Greek) and the historical context of slavery. However, the exegesis is often used to support a pre-existing dogmatic conclusion (the death of Jesus) rather than letting the text's own historical particularity surprise the hearer.",
      "quotes": [
        "Greek scholars point out that this is a very strong negation.",
        "Biblical interpreters over the centuries almost unanimously agree..."
      ],
      "improvement_point": "Move beyond 'what interpreters say' and show the congregation the specific historical scandal of a Rabbi performing a task that even Jewish slaves were often exempt from."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 7,
      "findings": "Strong concrete examples are provided, particularly regarding church politics (the Peace, footwashing ceremonies) and personal history (the disabled home in Richmond). It avoids the 'general truth' trap by naming specific anxieties about status and 'A-lists'.",
      "quotes": [
        "In the New York City parish where I used to serve, there were a number of pecking orders...",
        "We heard plenty about access to power during the recent uproar about presidential pardons, didn't we?"
      ],
      "improvement_point": "The application regarding 'being lost' (the two ways) remains somewhat soft; it could be sharpened by connecting the refusal of the footwashing to a contemporary form of spiritual self-sufficiency."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 6,
      "findings": "The sermon alternates between the biblical narrative and contemporary anecdotes reasonably well. However, there is a clear 'teaching block' in the middle where the text is explained as a 'parable of humiliation' which feels slightly detached from the earlier concrete stories.",
      "quotes": [
        "But there is wonderful news tonight. Biblical interpreters over the centuries almost unanimously agree...",
        "Now let's turn our attention to the conversation Jesus has with Peter."
      ],
      "improvement_point": "Try to weave the 'pecking order' of the NYC parish directly into the dialogue between Jesus and Peter, rather than keeping them in separate sections."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "The sermon addresses misery (anxiety about status, worthiness) and redemption (Christ's cleansing). Gratitude is present but less developed, appearing mostly as an invitation to the Eucharist. The 'misery' is psychological (anxiety) which Dekker allows, but it could be more 'before God'.",
      "quotes": [
        "Because of this unease we feel, we make up rules about it so that we can be assured of our position.",
        "The primary meaning is that the Son of God is stooping down from his heavenly throne to wash us clean from our transgressions."
      ],
      "improvement_point": "Deepen the 'misery' aspect by showing that Peter’s refusal is not just 'misunderstanding' but a rejection of God's way of salvation."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 4,
      "findings": "This is the weakest point. While the sermon mentions 'no part in me', it quickly moves to the 'wonderful news'. The possibility of being truly lost or the gravity of the 'narrow way' is softened by a very welcoming, inclusive tone that borders on the 'everything is safe' tradition Dekker criticizes.",
      "quotes": [
        "If I do not wash you, you have no part in me.",
        "Maundy Thursday and Good Friday will hold no terrors for you..."
      ],
      "improvement_point": "Address the 'no part in me' with more gravity. What does it mean for a modern person to have 'no part' in Christ? Make the choice of Peter a real crisis for the hearer."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 8,
      "findings": "The sermon is strongly Christocentric. Christ is the subject and the telos. The preacher successfully moves from 'example' (moralism) to 'atonement' (grace), which aligns with Dekker’s insistence on Christ as the goal.",
      "quotes": [
        "The primary meaning is that the Son of God is stooping down...",
        "Man has no life in himself, it is Christ who is his life. [Paraphrased in sermon as: 'he has humbly given himself for us']"
      ],
      "improvement_point": "Ensure the 'two natures' (God and Slave) are even more sharply contrasted to highlight the theological 'nonsense' of the Incarnation."
    },
    "8_depth_and_length": {
      "score_1_to_10": 4,
      "findings": "At approximately 1450 words, the sermon likely clocks in under 15 minutes. According to Dekker, this lacks the 'breadth' required for true depth. The introductory 'small talk' about the crowd size further eats into the time for substantive exposition.",
      "improvement_point": "Remove the introductory remarks about the crowd size and use that space to expand on the 'misery' of the human condition or the depth of the Johannine 'hour'."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker's formal requirements primarily due to its length and a tendency toward 'safe' theology. It lacks the 20-minute breadth required for depth and avoids the sharp edge of the 'two ways'. However, it excels in concrete application and maintains a clear Christocentric focus, successfully subordinating moralism to grace.",
    "strengths": [
      "Concrete application: The use of specific examples like the NYC parish pecking order and the presidential pardons makes the truth 'concrete'.",
      "Christocentric telos: Correctly identifies the footwashing as a sign of the Atonement rather than just a moral example."
    ],
    "weaknesses": [
      "Length: At ~14 minutes, it fails Thesis 8's requirement for 'breadth'.",
      "Lack of existential tension: The warning 'no part in me' is neutralized too quickly by comfort, failing to take the 'two ways' seriously.",
      "Harmonization: Relies on other biblical books (Philippians) rather than mining the unique depths of the specific John 13 passage."
    ],
    "final_judgment_according_to_dekker": "This is a 'strong speech' that approaches being a sermon but ultimately lacks the breadth and the 'seriousness of being lost' required by Dekker's theses. It is too short and too comfortable to be a full actualization of the Word in Dekker's sense."
  }
}