{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "The Apostolic Flame",
    "bible_text": "1 Corinthians 2:12-13; 12:4-13; John 14-16",
    "notes": "Pentecost 1997 sermon at St. John’s Church, Salisbury, CT. Context includes a parish meeting following the service."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 4,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "Medium",
        "analysis": "The CP manifests in dogmatic 'course corrections' and rigid binary choices. The preacher uses the pulpit to enforce specific linguistic and theological boundaries (gender of the Spirit, apostolicity as 'all or nothing').",
        "quotes": [
          "We need to make a course correction right away.",
          "If the church isn’t apostolic, then the entire Christian faith... is a fraud from beginning to end.",
          "There is no Biblical warrant for this [calling the Spirit 'she']."
        ]
      },
      "healthy_care_NP": {
        "score": 6,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "Medium",
        "analysis": "The NP appears in the desire to 'build up' the congregation and the validation of individual gifts. However, it is slightly conditional on accepting the preacher's dogmatic framework.",
        "quotes": [
          "Paul writes that apostolic authority is given by the Spirit for one purpose only: for building you up."
        ]
      }
    },
    "adult": {
      "score": 5,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "Medium",
      "analysis": "The preacher uses Adult data (NY Times statistics, Greek etymology) to set the stage, but quickly pivots to Parent-driven conclusions. The 'Adult' is used as a hook to provide intellectual credibility to a Parent-Child transaction.",
      "quotes": [
        "The 'Deep Blue' Website received 22 million hits.",
        "The word apostolos, in Greek, means 'one who is sent.'"
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 3,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "High",
        "analysis": "The preacher initially models an Adapted Child (feeling 'foolish and small' compared to the world). He then invites the congregation into an AC role by presenting a 'fraud or truth' ultimatum, demanding compliance with his view of the Spirit.",
        "quotes": [
          "For a few minutes I felt very foolish and small.",
          "Is the message you have heard at St. John’s from God or not?"
        ]
      },
      "free_child_FC": {
        "score": 4,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "Low",
        "analysis": "There is a brief glimpse of FC in the mention of the Spanish dancer and 'duende,' but it is quickly re-regulated by the Parent ego to ensure it fits the Nicene Creed.",
        "quotes": [
          "Duende is like the Holy Spirit in that it is mysterious, invisible, unbidden..."
        ]
      }
    },
    "dominant_ego_position": "Critical Parent"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Parent -> Child (Complementary)",
    "analysis": "The preacher establishes authority by correcting the 'fashionable' views of the world (and the congregation) and then offers a 'rescue' through the Holy Spirit. The invitation to stand is a classic P->C transaction: an 'invitation' that carries the weight of a spiritual test.",
    "ulterior_motives": "Social: A->A (Let's discuss the Bible). Psychological: P->C (I will tell you the correct way to speak and think, or your faith is a fraud).",
    "communicative_purity_score": 4,
    "purity_explanation": "10 = Completely transparent/Pure. 0 = Highly manipulative/Ulterior.",
    "risk_explanation": "The 'double bottom' lies in the false choice: either accept the preacher's specific definition of 'apostolic' and 'He' or admit the church is a 'fraud.' This traps the listener in an Adapted Child response."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "Bait & Switch (Redemption)",
        "probability": "High",
        "formula_g_analysis": {
          "con": "The promise of understanding the 'gifts bestowed on us.'",
          "gimmick": "The listener's feeling of insignificance in a high-tech world ('Deep Blue').",
          "switch": "The shift from 'God is light' to 'If you don't believe this specific dogma, it's all a fraud.'",
          "payoff": "The listener feels 'restored' but only through total submission to the preacher's definitions."
        },
        "evidence_quotes": [
          "If it never happened, we should shut down St. John’s this very day.",
          "If the church isn’t apostolic, then the entire Christian faith... is a fraud."
        ]
      }
    ],
    "absence_of_games_analysis": "N/A"
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "High. He 'restores confidence' and offers the 'Spirit' as the solution to the world's overwhelming technology.",
      "persecutor": "Medium. He judges those who use 'she' for the Spirit or follow 'fashions' as lacking biblical warrant.",
      "victim": "Low/Initial. He starts as the victim of the 'Times' report to build rapport."
    },
    "congregation_position": "Victim. They are portrayed as 'insignificant' or 'ordinary' people who need the preacher's 'apostolic' authority to be 'built up.'",
    "escape_possibilities": "Minimal. The sermon ends with an 'invitation' to stand, which in a liturgical setting acts as a pressure for public compliance rather than an autonomous choice."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 3,
    "summary": "The sermon is psychologically coercive. It utilizes an 'All-or-Nothing' cognitive distortion (splitting) to force the congregation into a submissive Adapted Child position. By framing the validity of the entire Christian faith on a specific, rigid interpretation of 'apostolic' and 'gendered' language, the preacher creates a high-anxiety environment where the only relief is compliance. The use of the 'Deep Blue' anecdote serves to make the listener feel small, only to offer the preacher's dogma as the sole source of significance.",
    "strengths": [
      "Effective use of contemporary metaphors (Internet/Deep Blue) to engage the Adult ego initially.",
      "Strong Nurturing Parent intent to validate the 'gifts' of the individual members."
    ],
    "areas_for_improvement": [
      "High level of Critical Parent 'course-correcting' creates a culture of fear/compliance.",
      "Binary 'Truth or Fraud' ultimatums discourage Adult reflection and personal responsibility."
    ],
    "advice_for_game_free_communication": "Try moving from 'I must admit/We must' to 'I invite you to consider.' Instead of presenting the faith as a 'fraud' if it doesn't meet a specific definition, allow the Adult ego of the listener to process the mystery of the Spirit. Reduce the use of the Drama Triangle by not positioning the 'world' as a Persecutor that makes the Church a Victim."
  }
}