{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "Jesus Will Show",
    "bible_text": "Matthew 25:31-46; 1 Corinthians 15:22",
    "notes": "Preached at St. Mark’s, New Canaan, CT, on the Feast of Christ the King (1999)."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 8,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "Low",
        "analysis": "The preacher avoids the typical 'must' and 'should' of moralistic preaching. Instead of using the Law to coerce behavior, the preacher uses the 'terrible words' of the text to establish a reality-check, then immediately pivots to grace.",
        "quotes": [
          "The person who trembles to think of herself before the judgment seat is closer to the Kingdom of heaven than the one who complacently assumes she is on the side of the angels."
        ]
      },
      "healthy_care_NP": {
        "score": 9,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "High",
        "analysis": "The Nurturing Parent is present through the promise of transformation and the 'covering' of unrighteousness, but it promotes autonomy by insisting that the change is an organic 'indwelling Spirit' rather than a dependency on the preacher.",
        "quotes": [
          "The living Lord who brings us patiently and lovingly into his divine life."
        ]
      }
    },
    "adult": {
      "score": 9,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "High",
      "analysis": "The preacher engages the Adult by addressing intellectual objections (Robert Hughes) and historical context. The listener is treated as a thinking subject capable of processing the 'contradiction' of a crucified Judge.",
      "quotes": [
        "It should make our brains crunch just to think about it.",
        "Don’t be sidetracked by literal-minded speculations... What we are intended to feel is not intellectual curiosity but the overwhelming majesty."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 8,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "Low",
        "analysis": "The preacher explicitly deconstructs the 'Adapted Child' response (doing good works to be noticed or to comply with rules), calling it 'moralistic pabulum.'",
        "quotes": [
          "He who congratulates himself on having done enough is precisely the one who has not."
        ]
      },
      "free_child_FC": {
        "score": 7,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "Medium",
        "analysis": "There is a sense of 'glad amazement' and 'rejoicing' that stems from the Free Child's capacity for wonder, though the tone remains appropriately solemn for the subject matter.",
        "quotes": [
          "I was thrilled to be reminded of this saying.",
          "In glad amazement because they did not even notice that they were ministering to him."
        ]
      }
    },
    "dominant_ego_position": "Adult-informed Nurturing Parent"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Adult -> Adult (with a Nurturing Parent invitation)",
    "analysis": "The preacher speaks as one Adult to another, processing the 'data' of the Gospel while inviting the listener into a secure relationship with the 'Judge.'",
    "ulterior_motives": "The mention of 'Pledge Sunday' is a potential ulterior transaction (Social: A->A about the creed; Psychological: P->C about financial support), but it is handled with enough transparency to remain largely Adult.",
    "communicative_purity_score": 9,
    "purity_explanation": "10 = Completely transparent/Pure. 0 = Highly manipulative/Ulterior.",
    "risk_explanation": "The transition to 'Pledge Sunday' is the only moment where the 'Social' message of theology might be a 'Con' for the 'Psychological' goal of fundraising, but the preacher acknowledges the 'lumps' of organized religion, maintaining Adult integrity."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "None",
        "probability": "Low",
        "formula_g_analysis": {
          "con": "N/A",
          "gimmick": "N/A",
          "switch": "N/A",
          "payoff": "N/A"
        },
        "evidence_quotes": [
          "The division between bad people and good people is actually a division that runs through each of us."
        ]
      }
    ],
    "absence_of_games_analysis": "The preacher avoids NIGYSOB by including themselves in the 'poor specimens' category. They avoid ITHY by pointing to Christ as the only Rescuer, rather than the preacher's own advice or the church's programs."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "Low. The preacher points to Christ as the Rescuer, refusing to take the role themselves.",
      "persecutor": "Low. While the 'terrible words' of judgment are mentioned, the preacher does not use them to attack the congregation.",
      "victim": "Low. The preacher acknowledges the 'lumps' the church takes but does not plead for pity."
    },
    "congregation_position": "The congregation is initially positioned as 'Adam' (potential Victim of sin/death), but is immediately invited into 'Christ' (Autonomy).",
    "escape_possibilities": "The sermon offers an escape by moving from the 'Old Adam' (dysfunctional script) to 'In Christ' (New Script/Autonomy)."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 9,
    "summary": "This sermon is psychologically robust and remarkably free of the 'games' often found in pulpit rhetoric. By identifying the 'Old Adam' in both the preacher and the listener, the speaker collapses the hierarchy of the Critical Parent. The sermon addresses the listener as an Adult capable of handling complex theological paradoxes (the Judge who is judged). It successfully navigates the 'Pledge Sunday' trap by being transparent rather than manipulative, and it promotes authentic autonomy by suggesting that true 'good works' are unconscious and organic rather than performed for approval.",
    "strengths": [
      "Collapses the 'Us vs. Them' dynamic by placing the line of judgment through every human heart.",
      "Engages with secular skepticism (Robert Hughes) in an Adult-to-Adult manner.",
      "Avoids moralism (Adapted Child) in favor of transformation (Free Child/Adult)."
    ],
    "areas_for_improvement": [
      "The transition to the financial 'Pledge Sunday' is slightly abrupt.",
      "Could further explore the 'Free Child's' joy to balance the solemnity of the 'Critical Parent' imagery in the text."
    ],
    "advice_for_game_free_communication": "Continue to use 'we' and 'us' when discussing human failings to prevent the congregation from feeling 'persecuted' by a Critical Parent position."
  }
}