{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "Who Will Feed the Wolf?",
    "preacher": "Fleming Rutledge",
    "bible_text": "Romans 7:21–25",
    "estimated_word_length": 650,
    "estimated_duration_minutes": 7,
    "speaking_speed_explanation": "Based on 100 words per minute",
    "sermon_start_end": "I have been told that I have only eight minutes to speak to you this morning. Some of you I may never see again. [...] Here is food indeed, here is drink indeed, the bread and wine and Word of eternal life. Thanks be to God through Jesus Christ our Lord! AMEN.",
    "liturgical_context": "Lent, Bethlehem Chapel in the National Cathedral, Washington, D.C.",
    "historical_context": "Delivered March 8, 2006. Context includes the post-9/11 era, the Iraq War (implied by 'young men we arm and send overseas'), and the release of the film 'Crash' (2004).",
    "notes": "A brief, occasional sermon delivered in a high-stakes liturgical setting."
  },
  "domain_a_poetics_of_language": {
    "criterion_a1_imagery": {
      "score": 7,
      "analysis": "The sermon centers on a singular, powerful metaphor: the two wolves. This image provides a concrete visual for the abstract Pauline struggle between the 'law of the mind' and the 'law of sin.' Rutledge effectively uses the Cherokee legend to ground the theological concept of total depravity and the divided self in sensory reality. The imagery extends to the 'carnivorous wolf' and the 'Good Shepherd,' creating a biblical-metaphorical clash. While the 'wolves' are a common trope (bordering on cliché in modern digital culture), Rutledge revitalizes them by connecting them to the 'body of death.' The mention of the film 'Crash' adds a contemporary visual layer, though it remains a 'tell' rather than a 'show' due to the brevity of the sermon. The imagery is effective because it is visceral and easily visualized by a diverse audience.",
      "quotes": [
        "One wolf is violent, wild, and destructive. The other wolf is disciplined, wise, and benevolent.",
        "Left to ourselves, we will feed the carnivorous wolf every time.",
        "The one who, as he said himself, lays down his life to keep the wolves from destroying the sheep."
      ],
      "strengths": [
        "The central wolf metaphor is highly 'sticky' and easy to visualize.",
        "Effective use of contrasting adjectives to paint the nature of the internal conflict.",
        "Successful transition from the cultural 'wolf' image to the biblical 'Good Shepherd' imagery."
      ],
      "improvement_points": [
        "The reference to the movie 'Crash' could be more descriptive to 'show' the conflict rather than just naming the film.",
        "The 'body of death' image from the text could have been explored with more sensory detail to heighten the stakes.",
        "Avoid the 'Internet story' framing which slightly cheapens the aesthetic weight of the metaphor."
      ],
      "show_vs_tell_balance": "The sermon leans toward 'showing' through the parable of the wolves, but 'tells' when listing human vices (stingy, slothful, etc.) and political critiques."
    },
    "criterion_a2_carefulness_and_precision": {
      "score": 8,
      "analysis": "Rutledge exhibits high stewardship of language, characteristic of her 'sober-Reformed' style. The word choice is economical and sharp. She avoids 'Canaanite' jargon, instead using words like 'triumphalist,' 'duplicitous,' and 'fatuous'—words that carry intellectual weight and precision without being obscure. Her use of the George Whitefield quote and Thomas Cranmer’s Collect demonstrates a deep respect for the historical weight of words. The transition from the individual 'wolf' to the 'national level' is handled with surgical precision, avoiding vague generalities. Every sentence serves the primary goal of the eight-minute window. The language is 'loving' in the sense that it does not coddle the hearer but speaks the truth of the human condition with clarity.",
      "quotes": [
        "The ugly America is arrogant, bullying, triumphalist.",
        "One of the most fatuous slogans ever dreamed up is ‘the triumph of the human spirit.’",
        "Why is ‘our prayer so languid and our faith so dim’?"
      ],
      "strengths": [
        "Excellent use of precise, high-register vocabulary that avoids fluff.",
        "Integration of historical liturgical and homiletical voices (Whitefield, Cranmer) adds authority.",
        "Clear, punchy sentences that respect the listener's intelligence."
      ],
      "improvement_points": [
        "The list of vices ('stingy, slothful, duplicitous...') feels a bit like a standard catalog; more specific, contemporary examples could increase precision.",
        "The phrase 'all over the Internet' is a rare moment of linguistic sloppiness compared to the rest of the text.",
        "The transition to the 'national level' is very brief and could be perceived as a jarring shift in focus."
      ],
      "jargon_analysis": "Theological terms like 'law of sin' and 'body of death' are used, but they are immediately 'reframed' through the wolf metaphor, making them accessible."
    },
    "criterion_a3_musicality_and_rhythm": {
      "score": 7,
      "analysis": "The sermon has a distinct rhetorical cadence, likely influenced by the preacher's familiarity with the Book of Common Prayer. There is a clear use of parallelism ('The good America... The ugly America') and a rhythmic repetition of the central question ('Which wolf will win?'). The short, staccato sentences in the dialogue between the boy and the old man create a narrative pace that contrasts well with the longer, more reflective theological inquiries. The ending is particularly musical, echoing the liturgical language of the Eucharist ('food indeed, drink indeed'). It is clearly 'oral language' designed to be heard in a cathedral space, utilizing pauses and rhetorical questions to maintain a pulse.",
      "quotes": [
        "Which wolf will win? The one that is fed.",
        "I preached as one never to preach again …, as a dying man to dying men.",
        "Here is food indeed, here is drink indeed, the bread and wine and Word of eternal life."
      ],
      "strengths": [
        "Strong use of rhetorical questions to drive the rhythm.",
        "Parallelism in the description of the 'two Americas' and 'two wolves' creates a balanced sound.",
        "The conclusion has a liturgical 'legato' feel that provides a satisfying resolution."
      ],
      "improvement_points": [
        "The middle section listing personal vices is somewhat monotonous in its 'Why... why... why...' structure.",
        "The transition from the movie reference to the list of desires is a bit clunky in its rhythm.",
        "Some sentences are slightly overloaded with adjectives ('violent, wild, and destructive'), which can muddy the cadence."
      ],
      "paper_language_diagnosis": "Decidedly oral language. The structure is built for delivery, with short sentences and clear transitions."
    },
    "average_score_language": 7.33,
    "summary_language": "The language is characterized by a 'sober beauty' that avoids sentimentality. Rutledge uses a central, visceral metaphor to translate complex Pauline theology into a memorable image. Her stewardship of language is evident in her precise vocabulary and the integration of historical liturgical texts. While the 'Internet story' framing is a slight aesthetic risk, the overall poetics are sharp, economical, and rhetorically sophisticated. The sermon avoids religious jargon in favor of words that bite into reality, maintaining a rhythm that is both urgent and contemplative."
  },
  "domain_b_dramaturgy_of_structure": {
    "criterion_b1_narrative_arc": {
      "score": 8,
      "analysis": "For an eight-minute sermon, the narrative arc is exceptionally tight. Rutledge begins by 'upsetting the equilibrium' with the Whitefield quote, creating a sense of urgency. She introduces the 'conflict' (the wolves), moves to the 'complication' (we cannot feed the good wolf ourselves), and reaches a 'climax' in the cry of 'Wretched man that I am!' The turning point is the introduction of the Good Shepherd, which provides the 'resolution.' It follows the 'Lowry Loop' effectively: starting with an itch/problem, intensifying it to the point of despair, and then providing the gospel as the only possible solution. The movement from the individual to the national and then to the universal 'bondage to decay' expands the scope of the drama before narrowing it back down to the person of Christ.",
      "quotes": [
        "I preached as one never to preach again …, as a dying man to dying men.",
        "Who is going to feed the good wolf? Are you?",
        "But we are not left to ourselves."
      ],
      "strengths": [
        "The 'dying man' opening immediately establishes high stakes.",
        "The movement from 'two wolves' to 'no power to help ourselves' is a logical and dramatic escalation.",
        "The conclusion is not just an ending but a theological resolution to the tension created."
      ],
      "improvement_points": [
        "The shift to the 'national level' feels like a subplot that doesn't get enough time to resolve within the main arc.",
        "The 'Oscar-winning movie' reference momentarily breaks the 'sacred' tension of the narrative.",
        "The transition to the Romans 8 text at the end is very rapid; the 'turning point' could be given more weight."
      ],
      "plot_diagnosis": "A dynamic journey from the 'law of sin' to 'deliverance in Christ,' avoiding a static three-point structure."
    },
    "criterion_b2_integration_text_and_context": {
      "score": 7,
      "analysis": "Rutledge performs a classic 'reframing.' She takes the ancient text of Romans 7 and frames it through a (pseudo) indigenous legend and contemporary film. The 'context' is not just the immediate setting of the National Cathedral, but the broader cultural context of 2006 (war, PTSD, national arrogance). She respects the 'strangeness' of the text—the idea that we are 'captive'—and refuses to smooth it over with self-help advice. The integration is organic because she uses the wolf metaphor to explain the 'law' Paul is describing. However, the 'reframing' of America as having 'two wolves' is a bold move that connects the biblical 'bondage to decay' with the political reality of the hearers in D.C.",
      "quotes": [
        "America has two wolves fighting for dominance.",
        "The more young men we arm and send overseas... the more come back with post-traumatic stress disorder.",
        "The deepest meaning of the Christian story is that we have been delivered by the self-offering of the Good Shepherd."
      ],
      "strengths": [
        "Strong connection between the 'universal predicament' and specific contemporary issues like PTSD.",
        "The text is not a springboard but the actual lens through which the 'wolf' story is interpreted.",
        "Reframes 'the triumph of the human spirit' as a 'fatuous slogan' in light of the Gospel."
      ],
      "improvement_points": [
        "The connection between the 'Cherokee' story and the 'Reformed' theology of Cranmer is a bit of a cultural stretch.",
        "The 'national level' application could be seen as 'pasted on' given the short timeframe.",
        "More attention could be paid to the 'body of death' metaphor in the contemporary context."
      ],
      "reframing_present": "Yes. It reframes the human struggle from 'self-improvement' to 'deliverance from captivity.'"
    },
    "criterion_b3_openness_vs_closedness": {
      "score": 6,
      "analysis": "In terms of Stark’s 'open work of art,' this sermon is relatively 'closed,' which is typical for a kerygmatic, Reformed style. It does not leave the hearer with a question but with a definitive 'Answer' (Jesus Christ). However, it remains 'open' in its acknowledgment of the 'ambivalence of existence'—the reality that the struggle continues. It avoids the 'kitsch' of a happy ending where the wolves stop fighting; instead, it points to a deliverance that happens *in* the struggle. The hearer is treated as a 'mature conversation partner' who knows the reality of being 'bad-tempered' or 'slothful.' While the theological conclusion is dogmatically 'sealed,' the human experience described remains appropriately messy and open.",
      "quotes": [
        "Which wolf will win? The boy, looking alarmed, says, ‘I don’t know.’",
        "We have no power of ourselves to help ourselves.",
        "Thanks be to God through Jesus Christ our Lord!"
      ],
      "strengths": [
        "Acknowledges the ongoing 'war' within the person, avoiding a simplistic 'victory' narrative.",
        "The use of the boy's 'I don't know' leaves room for the hearer's own uncertainty.",
        "The sermon avoids moralistic 'to-do' lists, leaving the 'appropriation' to the hearer's faith."
      ],
      "improvement_points": [
        "The ending is very traditional and 'closed'; an open question might have lingered longer in the mind.",
        "The theological 'solution' is presented as a 'deus ex machina' that might feel too 'neat' for some hearers.",
        "The 'Space for Grace' is somewhat crowded by the strong, declarative dogmatic statements."
      ],
      "open_work_diagnosis": "Primarily monovalent and kerygmatic, but with 'open' windows into human frailty."
    },
    "average_score_structure": 7.0,
    "summary_structure": "The sermon exhibits a masterful dramaturgical arc within a very limited timeframe. It moves from an urgent opening to a deep diagnosis of the human condition, using a cultural metaphor to unlock a difficult biblical text. The integration of text and context is sharp, particularly in its critique of national 'triumphalism.' While the structure is theologically 'closed' in its Christocentric resolution, it maintains aesthetic integrity by refusing to offer cheap moralistic solutions, instead sustaining the tension of the 'divided self' until the very end."
  },
  "kitsch_diagnosis": {
    "anti_kitsch_score": 9,
    "analysis": "This sermon is a powerful antidote to religious kitsch. Rutledge explicitly attacks kitsch in the form of 'fatuous slogans' like 'the triumph of the human spirit.' She refuses to offer 'immediate comfort' or a 'happy ending' based on human effort. The sermon takes the 'pain of suffering' (PTSD, the 'body of death') seriously. There is no sentimentality here; the 'wolves' are violent and destructive. By quoting Cranmer's 'we have no power of ourselves,' she shuts the door on the 'kitsch of self-help.' The emotion is authentic because it is rooted in the 'wretchedness' of the human condition rather than manufactured 'heartwarming' stories. The 'Good Shepherd' is not a Hallmark image but a sacrificial figure who 'lays down his life.'",
    "examples_of_kitsch": [
      "The potential kitsch of the 'Internet wolf story' is subverted by its connection to 'the law of sin' and 'bondage to decay.'",
      "The 'triumph of the human spirit' is identified as the ultimate secular kitsch."
    ],
    "authentic_moments": [
      "The acknowledgment of the 'ugly America' as 'arrogant, bullying, triumphalist.'",
      "The honest question: 'Why do you find yourself being stingy, slothful, duplicitous...?'"
    ],
    "recommendation": "Continue to contrast cultural 'slogans' with the 'hard' grace of the Gospel to maintain this level of depth."
  },
  "space_for_grace_analysis": {
    "space_score": 8,
    "analysis": "Space for grace is opened precisely through the closing of space for human effort. By emphasizing that we are 'captive' and have 'no power,' Rutledge creates a vacuum that only grace can fill. This is the 'Space for Grace' in the Cilliers sense: it is the 'between' space where we realize our despair and look for a deliverer. The mystery of the 'Holy' is respected in the sense that deliverance is an 'event' (Immink) that comes from outside the self ('The law of the Spirit... has set me free'). The sermon does not resolve the tension of the two wolves through 'better feeding' by the human, but through the 'self-offering' of Christ. This is a 'sober-Reformed' aesthetics of grace.",
    "tension_sustained": "The tension between the 'two wolves' is sustained as a 'universal predicament' that only God can resolve.",
    "mystery_respected": "Yes, the 'mystery' of how the Spirit sets one free is left as a theological reality rather than a psychological explanation.",
    "moralization_vs_grace": "Grace prevails entirely. Moralization ('Who is going to feed the good wolf? Are you?') is used as a foil to show the necessity of grace.",
    "recommendation": "Ensure the 'Good Shepherd' imagery doesn't become too 'cozy,' maintaining the 'strangeness' of the cross."
  },
  "overall_aesthetics": {
    "overall_aesthetic_score": 7.5,
    "summary": "This sermon is a model of 'sober-Reformed' aesthetics, characterized by linguistic precision, dramaturgical urgency, and a fierce rejection of religious kitsch. Despite its brevity, it manages to 'reframe' the human condition using a combination of cultural parable and Pauline theology. The 'poetic power' lies not in flowery language, but in the 'beauty of simplicity' and the sharp edges of its diagnosis. It creates a 'Space for Grace' by systematically dismantling the hearer's illusions of self-sufficiency. The imagery of the wolves provides a 'cinematic' quality that makes the abstract 'law of sin' palpable. While the structure is kerygmatically 'closed,' the sermon's aesthetic depth comes from its honest engagement with the 'ambivalence of existence' and its refusal to offer cheap, moralistic solutions. It is a 'performance' of the Gospel that moves from the 'wretchedness' of the human to the 'deliverance' found in Christ, making the 'Holy happen' in the space of eight minutes.",
    "strengths_top_3": [
      "The 'Anti-Kitsch' stance: A rigorous rejection of sentimental 'human spirit' slogans in favor of the radicality of grace.",
      "Linguistic Precision: The use of high-weight, economical vocabulary that respects the 'stewardship of language.'",
      "Dramaturgical Arc: A perfectly executed 'Lowry Loop' that creates and resolves theological tension in a very short time."
    ],
    "improvement_points_top_3": [
      "Cultural Integration: The 'Internet story' and 'movie reference' could be integrated with more 'sacred' gravitas to match the rest of the tone.",
      "National Application: The 'two Americas' section feels slightly underdeveloped and could be more organically woven into the 'universal predicament.'",
      "Imagery Expansion: The 'body of death' image from the text could have been 'shown' with the same vividness as the 'wolves.'"
    ],
    "primary_aesthetic_style": "Sober-Reformed / Poetic-Imagistic",
    "comparison_with_specialists": "Fits Johan Cilliers (reframing, anti-kitsch) and Paul Scott Wilson (imagery, 'show don't tell' via the wolf parable).",
    "audience_analysis": "Appeals to intellectually engaged hearers who are weary of 'sentimental' religion and seek a 'hard' but hopeful diagnosis of reality.",
    "recommendations_for_next_sermon": [
      "Experiment with an 'open ending' to see if the tension of the 'two wolves' can linger even more provocatively.",
      "Deepen the 'sensory' description of biblical metaphors (like the 'Good Shepherd' or 'Body of Death') to match the vividness of the cultural parables.",
      "Maintain the 'dying man to dying men' urgency, as it is the sermon's strongest dramaturgical engine."
    ],
    "conclusion": "An aesthetically strong, 'tight' sermon that demonstrates how brevity can enhance rather than diminish theological depth. It succeeds by using a 'sticky' metaphor to unlock a profound truth, avoiding the pitfalls of kitsch and moralism. It is a 'Space for Grace' that honors the Reformed tradition's focus on the 'Word' while embracing the 'Aesthetic Turn' through imagery and performance."
  }
}