{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "Righteous Deeds Like Filthy Rags",
    "bible_text": "Isaiah 64:5–7; Jeremiah 33:14–16; Romans 9:30–10:4",
    "notes": "An Advent sermon focusing on the total depravity of human effort and the substitutionary righteousness of God."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 3,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "High",
        "analysis": "The preacher utilizes a strong Critical Parent voice to dismantle the listener's sense of agency. By defining even 'righteous deeds' as 'ritually unclean' and 'filthy,' the preacher enforces a state of total inadequacy.",
        "quotes": [
          "That’s what our righteous deeds are worth.",
          "This congregation is a bunch of sinners and hypocrites, misfits and marplots."
        ]
      },
      "healthy_care_NP": {
        "score": 4,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "Medium",
        "analysis": "Nurturing Parent appears in the second half, but it is conditional on the total surrender of the Adult ego. It offers comfort only after the listener has been thoroughly 'humbled' (crushed).",
        "quotes": [
          "Then, beloved of God, you have been granted a clue to the Lord’s grace and mercy."
        ]
      }
    },
    "adult": {
      "score": 5,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "Medium",
      "analysis": "The preacher uses Adult data (Rwanda, election news, NGO failures) but processes them through a Parent filter to prove a predetermined theological point rather than inviting objective reflection.",
      "quotes": [
        "It makes you wonder if you should ever send another cent to a humanitarian agency."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 2,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "High",
        "analysis": "The sermon explicitly invites the congregation into the role of the 'guilty child' standing before a judgment seat. It demands an admission of failure as the only acceptable response.",
        "quotes": [
          "We are summoned as the people of God to come before his judgment seat.",
          "A realistic assessment... could only result in profound repentance and lamentation."
        ]
      },
      "free_child_FC": {
        "score": 2,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "Low",
        "analysis": "Spontaneity is suppressed by the weight of 'introspection' and 'judgment.' Joy is only permitted as a derivative of theological relief, not as an primary authentic experience.",
        "quotes": [
          "It will be said with joy that 'this is the name by which our house is called...'"
        ]
      }
    },
    "dominant_ego_position": "Critical Parent (CP)"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Parent -> Child (Complementary)",
    "analysis": "The preacher speaks as the authoritative Parent (interpreting history and scripture) to the Adapted Child (the 'sinful' congregation). The transaction is stable because the congregation is conditioned to accept the 'filthy rags' label.",
    "ulterior_motives": "Socially, the preacher is teaching scripture (A->A). Psychologically, the preacher is shaming the listener's attempts at goodness to ensure total dependency on the institution/theology (P->C).",
    "communicative_purity_score": 4,
    "purity_explanation": "10 = Completely transparent/Pure. 0 = Highly manipulative/Ulterior.",
    "risk_explanation": "The 'double bottom' is that 'good deeds' are attacked to promote 'grace,' but this grace is then used to motivate the very deeds (helping the burned church) that were just called 'filthy.'"
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "Bait & Switch (Redemption)",
        "probability": "High",
        "formula_g_analysis": {
          "con": "The promise of 'Advent comfort' and 'salvation.'",
          "gimmick": "The listener's inherent desire to be a 'good person' and their inevitable failures.",
          "switch": "The preacher declares all 'goodness' to be 'filthy rags' and 'ritually unclean.'",
          "payoff": "The listener feels worthless (guilt), making the preacher's 'solution' the only relief."
        },
        "evidence_quotes": [
          "We were comforted... by the promise... but [Isaiah says] all our righteous deeds are like filthy rags."
        ]
      },
      {
        "name": "ITHY (I'm Only Trying To Help You)",
        "probability": "Medium",
        "formula_g_analysis": {
          "con": "Providing a 'realistic assessment' of the human condition.",
          "gimmick": "The listener's empathy for victims (Rwanda, burned churches).",
          "switch": "Blaming the 'helpers' for making things worse (NGOs, missionaries).",
          "payoff": "The listener is paralyzed; only the preacher's theological 'Branch' can act."
        },
        "evidence_quotes": [
          "The inability or unwillingness of the NGOs... resulted in the reconstitution of the Hutu Power movement."
        ]
      }
    ],
    "absence_of_games_analysis": "N/A - The sermon is structured around the 'Bait & Switch' of Law and Gospel."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "High. The preacher offers the 'Righteous Branch' as the only way out of the filth.",
      "persecutor": "High. The preacher indicts NGOs, churches, and the congregation's 'righteousness' as 'polluted.'",
      "victim": "Low. Only appears briefly when mentioning being 'jaundiced' by church signs."
    },
    "congregation_position": "Victim (of their own 'sinful nature' and 'iniquities'). They are told they are 'delivered into the hand of our iniquities.'",
    "escape_possibilities": "The sermon offers a theological escape (Grace), but not a psychological one. The listener remains dependent on the 'Rescuer' (God/Preacher) because their own Adult agency is labeled 'filthy.'"
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 3,
    "summary": "This sermon is a classic example of 'Crush and Comfort' homiletics. While theologically consistent with certain traditions, it is psychologically coercive. It systematically disables the listener's Adult ego by labeling all human effort—even humanitarian aid—as 'filthy' or 'unclean.' This creates a state of learned helplessness (Adapted Child) that can only be relieved by the specific theological solution the preacher provides. The use of extreme examples (genocide) to invalidate small-scale human kindness is a high-pressure tactic that discourages autonomous moral development.",
    "strengths": [
      "Strong use of narrative and current events to engage attention.",
      "Internal consistency within the 'Law/Gospel' theological framework."
    ],
    "areas_for_improvement": [
      "The total invalidation of the Adult ego's efforts leads to passivity or religious scrupulosity.",
      "The 'Switch' from condemning all deeds to asking for 'contributions' for the burned church is logically inconsistent and manipulative."
    ],
    "advice_for_game_free_communication": "Try addressing the congregation as Adult partners in a broken world rather than as 'misfits and hypocrites.' Acknowledge the complexity of human effort (Adult) without resorting to totalizing 'filthy rags' metaphors (Critical Parent). Allow 'Grace' to be a foundation for agency rather than a replacement for it."
  }
}