{
  "metadata": {
    "sermon_title": "The Open Tombs",
    "bible_text": "Matthew 27:50-54",
    "estimated_word_length": 1150,
    "estimated_duration_minutes": 11.5,
    "sermon_start_end": "The third sign that took place on the day that Jesus died is described for us in the Gospel of Matthew: And Jesus cried again with a loud voice and yielded up his spirit. And behold... the earth shook, and the rocks were split; the tombs also were opened [...] His death has set us free - free from doubt and despair, free from sin and guilt, free from darkness and everlasting death, free for the praise and service and glory of our God who on this day makes you and me and the whole creation new. And that is why this terrible day is called Good. AMEN."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon focuses on the specific 'third sign' in Matthew. It attempts to find the unique element (the timing of the tombs opening). However, it quickly pivots to general Pauline concepts of 'two ages' rather than staying strictly within the unique narrative logic of Matthew's specific pericope.",
      "quotes": [
        "The opening of the tombs takes place, not on the morning of the Resurrection, but at the moment of Jesus' last struggle for breath."
      ],
      "improvement_point": "Resist the urge to harmonize with Paul (Galatians/Romans) so early; explore the specific Matthean 'apocalyptic' imagery further before importing external theological frameworks."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 7,
      "findings": "The preacher demonstrates the required linguistic and academic competence. Reference to the 'triple passive' and the 'Golgotha Earthquake' shows engagement with the text's structure and scholarly discourse.",
      "quotes": [
        "In Greek there is a triple passive it has even been called 'the great triple passive'"
      ],
      "improvement_point": "Deepen the 'religious history' aspect: why 'the saints'? What did this mean for a first-century Jewish-Christian audience regarding the restoration of Israel?"
    },
    "3_application_concrete_concrete_contemporary": {
      "score_1_to_10": 4,
      "findings": "The application starts strong by identifying the 'Old Age' with concrete modern realities (Internet, State Department), but the final application to the hearer's life becomes a list of general psychological categories that lack the 'true truth' of concrete specificity Dekker demands.",
      "quotes": [
        "Is it a fear of failure, of not making the cut, of not being good enough? Is it a loss of love..."
      ],
      "improvement_point": "Move beyond rhetorical questions about 'feelings' and address concrete contemporary situations where the 'Age to Come' disrupts specific modern societal or ecclesiastical structures."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 5,
      "findings": "The sermon follows a traditional 'block' structure: text, then theological explanation (the two ages), then application. The hearer is not 'drawn into the text' in a single movement; rather, the text serves as a springboard for a lecture on two-age theology.",
      "quotes": [
        "Fundamental to understanding the New Testament is the concept of the two ages..."
      ],
      "improvement_point": "Integrate the 'two ages' tension directly into the description of the earthquake and tombs, so the application is felt within the exposition itself."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "The categories are present. Misery is defined as the 'downward spiral' of the Old Age. Redemption is clearly outside the self (Christ's death). Gratitude is mentioned as 'praise and service'.",
      "quotes": [
        "This is the normal progression of our lives a downward spiral through increasing weakness, loss, and deterioration"
      ],
      "improvement_point": "The 'misery' here feels somewhat naturalistic/biological (aging/weakness). It needs to be sharpened into 'misery before God' (sin/rebellion) to meet Dekker's criteria."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 3,
      "findings": "This is the weakest point. While the 'Old Age' is called 'evil' and 'passing away,' there is no real sense of the hearer being a 'willing and responsible being' who faces the possibility of being lost. The ending is a general assurance of freedom for 'all'.",
      "quotes": [
        "Jesus' unconditional love of us all... has changed everything."
      ],
      "improvement_point": "Introduce the 'narrow way.' If the Age to Come is invading, what is the cost of remaining in the Old Age? The sermon lacks the 'ultimate possibilities of life design'."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 7,
      "findings": "Christ is clearly the telos. The sermon correctly identifies that the resurrection life is not an inherent human potential but a gift through the death of the Son of God. The doctrine of the two natures is implicit in the 'Son of God' confession.",
      "quotes": [
        "The resurrection life is not given indiscriminately; it is given through the death of Jesus Christ."
      ],
      "improvement_point": "Ensure the 'Christ as God' aspect is more explicitly linked to the 'directing intelligence' mentioned in the earthquake section."
    },
    "8_depth_and_length": {
      "score_1_to_10": 3,
      "findings": "At approximately 1150 words, the sermon would last roughly 11-12 minutes. According to Thesis 8, this is insufficient for the 'breadth' required for 'depth'.",
      "improvement_point": "The sermon ends abruptly after the list of rhetorical questions. It needs another 8-10 minutes of substantive development to reach the 20-minute threshold."
    }
  },
  "overall_assessment": {
    "summary": "The sermon fails significantly on length and the 'two ways' requirement. It is too brief to achieve the depth Dekker demands and lacks the existential urgency of the choice between life and destruction. While it possesses strong exegetical foundations and a clear Christocentric focus, the application devolves into general psychological categories rather than concrete, situational truth.",
    "strengths": [
      "Strong exegetical start regarding the 'triple passive' in the Greek text.",
      "Clear Christocentric telos; grace is the foundation of the message.",
      "Effective identification of the 'Old Age' with contemporary secular institutions."
    ],
    "weaknesses": [
      "Insufficient length (approx. 12 minutes), failing the 'depth needs breadth' criterion.",
      "Lack of the 'two ways' perspective; no serious warning of being 'lost'.",
      "Application becomes a generic list of psychological struggles rather than specific 'true truth'."
    ],
    "final_judgment_according_to_dekker": "This is a theological speech with strong elements, but it is not yet a 'sermon' by Dekker's standards due to its brevity and the absence of the 'two ways' tension."
  }
}