{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "The Things That Do Not Exist",
    "preacher": "Fleming Rutledge",
    "bible_text": "Romans 4:17",
    "estimated_word_length": 1850,
    "estimated_duration_minutes": 18,
    "speaking_speed_explanation": "Based on 100 words per minute",
    "sermon_start_end": "Last week my husband and I went to a screening of Sophie Scholl: The Last Days, a film of unforgettable power. Its subject is The White Rose, a small group of German university students, ardent Christians, who resisted the Nazis. [...] I have come by the grace of God with the apostolic message entrusted to me, to declare to you the presence and power of “the God who raises the dead and calls into existence the things that do not exist.” AMEN.",
    "liturgical_context": "Gathering of clergy and lay people from the Church of Scotland and Charlotte Presbyterian congregations",
    "historical_context": "September 26, 2006. Context of post-9/11 America, the Iraq War, and the decline of the Church of Scotland.",
    "notes": "The sermon addresses a specific audience of clergy facing institutional decline."
  },
  "domain_a_poetics_of_language": {
    "criterion_a1_imagery": {
      "score": 8,
      "analysis": "Rutledge demonstrates a high level of imagistic competence, adhering to the 'show, don't tell' principle advocated by Paul Scott Wilson. She avoids abstract theological drift by anchoring the concept of 'nothingness' in visceral, historical, and contemporary images. The use of the film 'Sophie Scholl' provides a cinematic frame that persists throughout the sermon. She effectively uses sensory details—the 'frozen head in a can' of Ted Williams, the 'brown tulip bulb', and the 'night sky' of Abraham—to ground the metaphysical claim of creation ex nihilo. The imagery is not merely decorative; it serves as a vehicle for the 'reframing' Cilliers describes, forcing the hearer to see the 'deadness' of their own potential before the 'life' of God's Word.",
      "quotes": [
        "until we found out that his head had been frozen in a can and his body suspended in a tank",
        "the brown tulip bulb that emerges in the spring as a brilliant flower, or the green shoot that pokes out of the apparently dead tree stump",
        "imagine the night sky as it must have been four or five thousand years ago—no city lights, no pollution."
      ],
      "strengths": [
        "Strong use of cinematic framing through the Sophie Scholl narrative.",
        "Concrete biological and historical examples prevent the sermon from becoming a dry lecture on Romans.",
        "Effective contrast between natural 'wonders' and supernatural 'resurrection'."
      ],
      "improvement_points": [
        "The transition to the 'swimming pool' image at the end feels slightly less integrated than the opening film image.",
        "Could have explored the 'stench' of death more to contrast with the 'brilliant flower'.",
        "The description of the stars could be even more sensory to emphasize Abraham's smallness."
      ],
      "show_vs_tell_balance": "Strongly weighted toward 'showing'. The preacher allows the image of the frozen head and the Nazi trial to carry the weight of the argument before stating the theological conclusion."
    },
    "criterion_a2_carefulness_and_precision": {
      "score": 8,
      "analysis": "Rutledge exhibits what McEntyre calls 'stewardship of language.' Her word choice is precise, particularly in her handling of the Greek 'logizomai' and 'logos'. She avoids the 'Canaanite jargon' of typical evangelicalism, instead opting for a sober, almost surgical precision when describing human depravity. The language is 'loving' in its honesty, refusing to hide behind platitudes about 'human potential.' By critiquing the phrase 'more easily' in Pelagius, she demonstrates a high sensitivity to how small linguistic shifts can alter entire theological frameworks. The precision here serves the content: the radicality of grace requires the radicality of precise, unvarnished language about death.",
      "quotes": [
        "Abraham is called the progenitor of all people not because of his strength but because of his impotence.",
        "What’s with this 'more easily'? Why not just say simply, we need the help of God to overcome evil?",
        "The Christian view of humanity is tragic."
      ],
      "strengths": [
        "Excellent deconstruction of religious and secular clichés (e.g., 'human potential').",
        "Precise theological distinctions between 'natural wonders' and 'resurrection'.",
        "Clear, economical sentence structure that avoids fluff."
      ],
      "improvement_points": [
        "The mention of 'nice American boys' could be more precisely tied to the specific Iraqi context mentioned earlier.",
        "Some theological terms like 'incarnate' could be further unpacked for a lay audience.",
        "The transition between the 'Ordinary Men' book and the Cambodian survivor is very rapid."
      ],
      "jargon_analysis": "Theological terms (reckon, logos, ex nihilo) are used but always defined or contextualized through narrative, making them accessible without losing their depth."
    },
    "criterion_a3_musicality_and_rhythm": {
      "score": 7,
      "analysis": "The sermon possesses a rhythmic cadence typical of the 'New Homiletic.' Rutledge uses parallelism ('Peace does not exist where... Growth does not exist where...') to create a liturgical atmosphere. There is a clear variation in sentence length: short, punchy declarations ('Death begets death. That is the human story.') are followed by longer, more reflective passages. The repetition of the phrase 'the things that do not exist' acts as a musical refrain, anchoring the listener's attention. While it leans toward the 'sober-Reformed' aesthetic, it avoids the 'paper language' of a manuscript by utilizing rhetorical questions and direct address that suggest a strong oral performance.",
      "quotes": [
        "Peace does not exist where there is war. Growth does not exist where there is decay. Faith does not exist where there is disbelief.",
        "Death begets death. That is the human story. Life out of death is not the human story. Life out of death is the divine story.",
        "Ordinary men."
      ],
      "strengths": [
        "Effective use of anaphora (repetition at the beginning of sentences).",
        "Strong rhythmic contrast between human failure and divine action.",
        "The 'Amen' is preceded by a powerful, crescendo-like summary of the apostolic message."
      ],
      "improvement_points": [
        "The middle section regarding Isaiah and Augustine becomes slightly more academic and loses some of the initial rhythmic drive.",
        "Could utilize more alliteration to make key theological points more memorable.",
        "The transition into the Mississippi swimming pool story breaks the established rhythmic flow of the previous section."
      ],
      "paper_language_diagnosis": "Primarily oral language. Despite the depth of content, the sentence structures are designed for the ear, utilizing repetition and directness."
    },
    "average_score_language": 7.67,
    "summary_language": "The language is characterized by a 'sober beauty' that avoids sentimentality. Rutledge uses imagery not to decorate the gospel, but to expose the reality of death and the necessity of a Word from outside. Her stewardship of language is evident in her rejection of 'human potential' jargon, opting instead for a tragic but hopeful precision. The rhythm is steady and authoritative, utilizing repetition to reinforce the central theme of God's creative power. It is a high-level example of Reformed aesthetics where the form (simplicity and directness) serves the radicality of the content."
  },
  "domain_b_dramaturgy_of_structure": {
    "criterion_b1_narrative_arc": {
      "score": 8,
      "analysis": "The sermon follows a clear 'Lowry Loop' or homiletical plot. It begins with an 'upsetting of the equilibrium' through the story of the angry man at the movie screening, which introduces the central conflict: the apparent pointlessness of sacrifice in the face of death. The movement follows a descent into the 'nothingness' of human potential (the 'trouble') before reaching the turning point in the 'Logos'—the Word that creates from nothing. The energy does not drop; rather, it shifts from the historical (Sophie Scholl) to the biblical (Abraham) to the contemporary (Iraq/Mississippi), creating a sense of progression. The conclusion returns to the opening tension, providing a theological resolution without a 'cheap' happy ending.",
      "quotes": [
        "A man in an imposing suit... got up and said very angrily, 'What good did those students do?'",
        "The reason for this stands against reason: Abraham is called the progenitor of all people not because of his strength but because of his impotence.",
        "I have not come from New York to Charlotte to preach human potential... I have come... to declare to you the presence and power of 'the God who raises the dead'."
      ],
      "strengths": [
        "Compelling opening that immediately establishes a 'stake' for the listener.",
        "Clear movement from 'human story' (death) to 'divine story' (life).",
        "The 'turning point' is clearly located in the Word (Logos) rather than human effort."
      ],
      "improvement_points": [
        "The section on Isaiah feels like a slight detour that slows the narrative momentum.",
        "The connection between the 'Ordinary Men' and the 'New Humanity' could be more tightly woven into the Abrahamic arc.",
        "The conclusion is strong but could have revisited the 'angry man' more explicitly to close the narrative circle."
      ],
      "plot_diagnosis": "A dynamic journey. It moves from a specific question of 'utility' to a cosmic answer of 'creation,' taking the hearer through a necessary valley of 'impotence'."
    },
    "criterion_b2_integration_text_and_context": {
      "score": 9,
      "analysis": "This is a masterclass in Cilliers' 'reframing.' Rutledge takes the 'deadness' of the Church of Scotland and the 'optimism' of American culture and reframes them through the 'impotence' of Abraham. She respects the 'strangeness' of the biblical text—specifically the unromantic nature of 'reckoning'—and uses it to critique contemporary political and social realities (Iraq, 9/11, racial history). The integration is organic; she doesn't just 'apply' the text at the end, but allows the text to provide the lens through which we see the 'Ordinary Men' of the Holocaust and the 'Ordinary Men' of today. The synthesis of Romans 4 with the film Sophie Scholl is particularly effective in showing how the 'non-existent' becomes a 'sign'.",
      "quotes": [
        "Abraham’s place in the story of salvation depends not upon Abraham’s sufficiency, but upon his lack.",
        "The Christian view of humanity means that we are horrified but not surprised that nice American boys do terrible things to Iraqi civilians.",
        "Full reconciliation, lasting peace, universal liberation: at the present time these things are present to us only in the mode of promise."
      ],
      "strengths": [
        "Brilliant use of the 'impotence' of Abraham as a mirror for the 'decline' of the church.",
        "Courageous integration of contemporary political critique without becoming a political speech.",
        "The concept of 'signs' effectively bridges the gap between the 'already' and 'not yet'."
      ],
      "improvement_points": [
        "The transition to the Mississippi swimming pool story is a bit abrupt compared to the rest of the sermon.",
        "Could have more explicitly addressed the 'Church of Scotland' context mentioned in the note.",
        "The 'biostasis' example, while humorous, is slightly less integrated than the historical examples."
      ],
      "reframing_present": "Yes. It reframes 'failure' and 'decline' not as problems to be solved by 'human potential,' but as the very space where God's creative Word operates."
    },
    "criterion_b3_openness_vs_closedness": {
      "score": 7,
      "analysis": "The sermon is an 'open work of art' in the sense that it does not offer a 'five-step plan' for church growth or moral improvement. It leaves the hearer in the 'space of the between'—between the promise and the fulfillment. By defining the actions of Sophie Scholl and the Mississippi businessman as 'signs' rather than 'solutions,' Rutledge leaves room for the hearer to interpret their own life as a potential sign. However, the theological framework is very 'closed' in its dogmatic insistence on human depravity. While this is a Reformed strength, aesthetically it borders on a 'coercive schema' where the hearer has little room to move outside the 'tragic view of humanity.' Yet, the ending remains open to the mystery of God's future action.",
      "quotes": [
        "The Resurrection of the dead does not yet exist... at the present time these things are present to us only in the mode of promise.",
        "What good will the new pool do... Maybe there will be fights. Maybe the whites won’t want to swim in it. Maybe.",
        "Signs of it in this life are only signs; they are not the thing itself."
      ],
      "strengths": [
        "Refusal to provide 'cheap' answers to the problem of evil.",
        "The 'Maybe' regarding the swimming pool respects the complexity of reality.",
        "The ending focuses on the 'presence and power' of God rather than a moralistic 'must'."
      ],
      "improvement_points": [
        "The dogmatic rejection of 'human potential' is so absolute it might cause 'resistance' (in Stark's terms) that blocks the hearer.",
        "Could leave more room for the 'joy' of the new creation, even if only in promise.",
        "The 'angry man' at the beginning is dismissed somewhat quickly; his question could be allowed to linger more."
      ],
      "open_work_diagnosis": "Polyvalent. It allows the hearer to see their own 'impotence' as a site of grace, though the theological path to that conclusion is strictly defined."
    },
    "average_score_structure": 8.0,
    "summary_structure": "The dramaturgy is exceptionally strong, moving from a concrete human question about the utility of sacrifice to a cosmic theological answer. Rutledge avoids a static three-point structure, opting instead for a narrative journey that 'reframes' human failure as the necessary condition for divine action. The integration of text and context is seamless, using the biblical narrative of Abraham to interpret the Holocaust, the Iraq War, and racial tensions. While the theological boundaries are firm, the sermon remains 'open' by pointing toward a promise that is not yet fully realized, inviting the hearer into a life of 'signs'."
  },
  "kitsch_diagnosis": {
    "anti_kitsch_score": 9,
    "analysis": "This sermon is a powerful antidote to religious kitsch. Rutledge explicitly attacks the 'happy ending' mentality and the 'pre-chewed emotions' of American optimism. By bringing in the 'Ordinary Men' of the Holocaust and the 'impotence' of a hundred-year-old Abraham, she refuses to offer immediate comfort. She sustains the 'pain of suffering' and the 'nothingness' of death. The sermon does not use 'Jesus' as a magic wand to fix the Iraq War or church decline; instead, it maintains the tension of the 'not yet.' The emotion is authentic because it is rooted in the 'tragic view' of reality, not in sentimental platitudes.",
    "examples_of_kitsch": [
      "The 'brown tulip bulb' is identified as a potential kitsch-analogy and then critiqued for not being 'the thing itself'.",
      "The 'incurable optimism' of American culture and the 'nice American boys' narrative are exposed as false sentiment."
    ],
    "authentic_moments": [
      "The description of the reserve police battalion murdering 70,000 people provides a chilling, anti-kitsch reality check.",
      "The admission that 'full reconciliation' and 'lasting peace' do not yet exist in reality, only in promise."
    ],
    "recommendation": "Maintain this level of 'tragic realism' as it is the only ground upon which the 'radicality of grace' can be aesthetically convincing."
  },
  "space_for_grace_analysis": {
    "space_score": 8,
    "analysis": "Rutledge creates a 'space for grace' by systematically closing all other doors. By destroying the 'space for human potential,' she forces the hearer to look toward the 'vertical dimension' of the Word. The 'space' here is not a cozy room, but the 'desert at night' where Abraham stood—a space of vastness, mystery, and human smallness. She sustains the tension between the 'old humanity' (Adam) and the 'new humanity' (Christ) without resolving it through moralism. The mystery of God's creative power is respected; it is not explained away as a psychological process but proclaimed as an 'event' (Immink).",
    "tension_sustained": "The tension between the 'deadness' of the present and the 'promise' of the future is sustained until the very last word.",
    "mystery_respected": "The 'boggling of the mind' regarding the Logos is highlighted, not simplified.",
    "moralization_vs_grace": "Grace prevails. The sermon is a declaration of what God does, not what we must do, though it invites us to be 'signs'.",
    "recommendation": "To further open the space, she could perhaps emphasize the 'vulnerability' of the Word made flesh, adding a layer of 'pathos' to the 'power'."
  },
  "overall_aesthetics": {
    "overall_aesthetic_score": 8.2,
    "summary": "This sermon is an aesthetically robust example of the 'Aesthetic Turn' within a Reformed framework. Fleming Rutledge avoids the pitfalls of both dry intellectualism and sentimental kitsch. Her 'poetics of language' is characterized by a stewardship that treats words as serious instruments of truth, utilizing cinematic imagery and historical narrative to 'show' the reality of death and the necessity of the Word. The 'dramaturgy of structure' is dynamic, successfully reframing the contemporary experience of institutional and moral decline through the lens of Abrahamic impotence. By refusing to offer 'cheap grace' or moralistic solutions, she creates a profound 'space for grace' that honors the mystery of God's creative action. The sermon functions as an 'open work' that invites the hearer to see their own life as a 'sign' of a promise not yet fulfilled. It is a sober, authoritative, and aesthetically coherent performance that demonstrates how 'how' something is said (with tragic realism and linguistic precision) is inseparable from 'what' is said (the gospel of the God who raises the dead).",
    "strengths_top_3": [
      "Masterful 'reframing' of human impotence as the site of divine creation.",
      "Complete absence of religious kitsch and sentimentalism.",
      "High level of linguistic precision and stewardship of theological terms."
    ],
    "improvement_points_top_3": [
      "The transition between the various historical/contemporary examples could be smoother.",
      "The dogmatic intensity could be balanced with more moments of 'sober joy'.",
      "The ending could more explicitly tie back to the 'angry man' to complete the narrative arc."
    ],
    "primary_aesthetic_style": "Sober-Reformed / Poetic-Tragic",
    "comparison_with_specialists": "Fits Johan Cilliers (reframing, anti-kitsch) and Paul Scott Wilson (imagery, Four Pages).",
    "audience_analysis": "Clergy and intellectually engaged laypeople who are weary of 'easy' church growth answers and seek a deeper, more 'tragic' but hopeful theology.",
    "recommendations_for_next_sermon": [
      "Experiment with more 'staccato' rhythm in the theological turning point to emphasize the 'event' of the Word.",
      "Incorporate more sensory 'pathos' when describing the 'new humanity' to provide a stronger aesthetic contrast to the 'old humanity'.",
      "Use a single, sustained metaphor throughout the entire sermon to deepen the 'cinematic' quality."
    ],
    "conclusion": "A high-quality sermon that serves as a model for how to preach the 'hard' truths of the Reformation with aesthetic power. It successfully navigates the tension between the 'already' and the 'not yet,' providing a 'space for grace' that is both intellectually demanding and spiritually evocative. The score of 8.2 reflects its excellence in integration and its refusal to compromise the 'strangeness' of the gospel for the sake of easy consumption."
  }
}