{
  "metadata": {
    "sermon_title": "Doubting and Believing",
    "bible_text": "John 20:27, 20:30-31; 1 Corinthians 15:17",
    "estimated_word_length": 1850,
    "estimated_duration_minutes": 18.5,
    "sermon_start_end": "I cannot remember a time in my life span when Christian faith was under direct attack as much as it is today. Much of the skepticism and even ridicule is coming from within the church itself. This week I saw an English magazine, The New Statesman, with a cover [...] These things were written that you believe that Jesus is the Christ, the Son of God, and that, believing, you may have life in his name. AMEN."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 5,
      "findings": "The sermon uses John 20 as a primary text but relies heavily on 1 Corinthians 15 to interpret it. It fails Dekker's requirement of finding what is in THIS text that is nowhere else. Instead, it treats the text as a general defense of the Resurrection against modern skepticism.",
      "quotes": [
        "Today, the first Sunday after Easter Day, the story of 'Doubting Thomas' is always read.",
        "I stood at the lectern... and I began to read the lesson appointed for the Tuesday of Easter Week, the words of the Apostle Paul to the Corinthian church"
      ],
      "improvement_point": "Focus specifically on the unique Johannine detail of the 'breath' or the specific nature of Thomas's confession 'My Lord and my God' as the unique climax of this Gospel, rather than using it as a springboard for a general polemic against the Jesus Seminar."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 4,
      "findings": "There is no evidence of Greek/Hebrew study or deep engagement with the religious history of Israel. The 'exposition' is largely a summary of the narrative and a citation of Raymond Brown's modern scholarship rather than the biblical text's own historical-theological horizon.",
      "quotes": [
        "Interpreters tend to agree that Thomas never actually touches Jesus",
        "the great Roman Catholic New Testament scholar, Raymond Brown... a unique work of research"
      ],
      "improvement_point": "The preacher should move beyond citing modern scholars and instead explain the specific theological weight of the wounds in the context of Johannine Christology."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 7,
      "findings": "Application is the sermon's strongest point. It engages concretely with the 'zeitgeist' (New Age, Jesus Seminar) and specific tragedies (Alabama tornado). It avoids vague generalities by naming names and specific events.",
      "quotes": [
        "Marla Maples appears this week on the cover of New York magazine to tout the virtues of auto-enlightenment",
        "the church in Piedmont, Alabama, that was destroyed by a tornado on Palm Sunday morning"
      ],
      "improvement_point": "Ensure the application flows from the text's specific logic rather than using the text as a mirror for contemporary media stories."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 6,
      "findings": "The sermon avoids a strict 'block' structure, mixing personal anecdote, cultural critique, and biblical narrative. However, the 'exposition' is so thin that the 'application' often takes over, leading to a sermon that feels more like a topical speech.",
      "quotes": [
        "Thomas stands for all of us here. We haven’t seen the risen Lord... We would like proof.",
        "This brings us to a critical point. It is quite true that Christianity stands or falls on the question of divine revelation."
      ],
      "improvement_point": "Deepen the exposition so that the hearer is 'expounded' by the text itself rather than by the preacher's personal struggle with doubt."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "Misery is present in the form of doubt and the tragedy of death. Redemption is external (the Word of God). Gratitude is less explicitly developed but implied in the restoration of faith. The psychological aspect is handled well without becoming 'soft'.",
      "quotes": [
        "My 'inner voice' was saying all sorts of treacherous things",
        "the Word of Jesus can create faith where there is no faith"
      ],
      "improvement_point": "Make the 'gratitude' (the life in His name) more concrete as a response to the specific Word heard."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 5,
      "findings": "The sermon hints at the 'two ways' by contrasting the 'man-made god' (which leads to death) with the 'God who is really God'. However, the urgency of being 'lost' is somewhat muted by a focus on intellectual doubt rather than existential destination.",
      "quotes": [
        "A god that we ourselves have made up will die with us.",
        "So we have a real choice. We can choose a god who suits us... or the Bible sets before us a baffling... God."
      ],
      "improvement_point": "The preacher should more sharply define the 'destruction' inherent in the 'broad way' of self-made religion."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 7,
      "findings": "Christ is clearly the telos. The sermon emphasizes the two-natures (Lord and God) and insists that salvation is 'outside' the self. Grace is the foundation of the response to doubt.",
      "quotes": [
        "Christ is the telos of the sermon... Christ can only be the telos when He is God.",
        "Man has no life in himself, it is Christ who is his life."
      ],
      "improvement_point": "Avoid making Christ a 'solution' to the problem of the Jesus Seminar; let Him be the Lord of the text's own specific claim."
    },
    "8_depth_and_length": {
      "score_1_to_10": 5,
      "findings": "At approximately 18.5 minutes, the sermon falls just short of Dekker's 20-minute minimum. While it has breadth in cultural references, it lacks the 'depth' of rigorous exegetical labor required to sustain a truly substantive sermon.",
      "improvement_point": "Expand the exegetical section (Thesis 2) to reach the 20-minute mark and provide the 'breadth' necessary for theological depth."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker’s ideal primarily in its lack of rigorous, original-language exegesis and its tendency to use the Bible passage as a springboard for a topical defense of faith against modern skepticism. It functions more as an apologetic speech than a strict 'exposition and application' of a specific pericope. However, it succeeds in its concrete application and its insistence on an external, revelatory Word over internal 'inner voices'.",
    "strengths": [
      "Concrete application that engages the zeitgeist directly without falling into generalities.",
      "Strong Christocentric focus that identifies Christ as the external source of life and faith.",
      "Honest treatment of 'misery' in the form of doubt and death."
    ],
    "weaknesses": [
      "Lack of specific exegetical depth regarding the Johannine text's original context.",
      "Duration is below the 20-minute threshold required for 'depth'.",
      "Heavy reliance on secondary scholarship (Raymond Brown) and personal anecdote over the specific mechanics of the biblical text."
    ],
    "final_judgment_according_to_dekker": "This is a borderline sermon. While it rightly identifies the sermon as the 'Word of God' and avoids 'soft' psychology, it lacks the formal exegetical rigor and the specific 'uniqueness' of the text that Dekker demands. It is more of a 'speech about the gospel' than a recreation of the specific Bible passage into a current proclamatory word."
  }
}