{
  "metadata": {
    "analysis_date": "2024-05-22",
    "sermon_title": "The Apostolic Flame",
    "bible_text": "I Corinthians 2:12-13; I Corinthians 12:4-13",
    "notes": "Pentecost 1997, St. John’s Church, Salisbury, CT."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 4,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "Medium",
        "analysis": "The preacher uses CP to enforce dogmatic boundaries, particularly regarding gender and the validity of the church. There is an 'all or nothing' ultimatum presented: either the church is apostolic or it is a 'fraud'.",
        "quotes": [
          "There is a fashion nowadays for calling the Spirit “she,” but with all due respect, there is no Biblical warrant for this.",
          "If it never happened, we should shut down St. John’s this very day and convert the building to secular use."
        ]
      },
      "healthy_care_NP": {
        "score": 7,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "High",
        "analysis": "The preacher exhibits strong Nurturing Parent energy when validating the congregation's individual gifts and connecting the Spirit to acts of love and memorial.",
        "quotes": [
          "Working hard to understand another person is a work of love.",
          "Paul doesn’t say “to some”; he says, “to each.” That means that every one of you has a gift."
        ]
      }
    },
    "adult": {
      "score": 5,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "Medium",
      "analysis": "The preacher begins with an Adult observation (the NYT article) and provides linguistic/historical data (Babel, Greek definitions). However, the Adult is often bypassed by the Parent's dogmatic 'course corrections'.",
      "quotes": [
        "The word apostolos, in Greek, means 'one who is sent.'",
        "I read in the Times that in one single day... the 'Deep Blue' Website received 22 million hits."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 6,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "Medium",
        "analysis": "The preacher admits to feeling 'foolish and small' (AC) in the face of technology, but quickly moves to a Parent position. The congregation is invited into a compliant AC role through the 'standing' ritual.",
        "quotes": [
          "For a few minutes I felt very foolish and small.",
          "If you feel moved to do so, simply stand up in your places..."
        ]
      },
      "free_child_FC": {
        "score": 4,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "Low",
        "analysis": "There is a brief mention of 'duende' and dancing, but the overall tone is more solemn and dogmatic than spontaneous or joyful.",
        "quotes": [
          "The great Spanish dancer Pilar Rioja builds her dance programs around... duende."
        ]
      }
    },
    "dominant_ego_position": "Critical Parent (masked as Nurturing Parent)"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Parent -> Child (Complementary)",
    "analysis": "The preacher establishes a hierarchy where he corrects 'fashionable' errors and provides the definitive interpretation of reality, inviting the congregation to receive these 'gifts' and stand in compliance.",
    "ulterior_motives": "Social: A->A (Let's discuss Pentecost). Psychological: P->C (I will tell you what is true so you don't feel small like I did).",
    "communicative_purity_score": 5,
    "purity_explanation": "10 = Completely transparent/Pure. 0 = Highly manipulative/Ulterior.",
    "risk_explanation": "The 'Bait & Switch' risk: The sermon starts with a vulnerable Adult admission but switches to a rigid Parent defense to ward off the preacher's own feelings of insignificance."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "Bait & Switch / Redemption",
        "probability": "High",
        "formula_g_analysis": {
          "con": "The preacher shares a vulnerable feeling of being 'small' in a high-tech world.",
          "gimmick": "The listener's own fear of irrelevance in a changing world.",
          "switch": "The shift from 'I feel small' to 'We have the Spirit, and those who call the Spirit \"she\" or secularize it are wrong.'",
          "payoff": "A sense of superior certainty; the 'Apostolic' group is safe while the 'World' is secular/fraudulent."
        },
        "evidence_quotes": [
          "For a few minutes I felt very foolish and small... Then the Lord reminded me of the power of the Holy Spirit, and I was restored to confidence."
        ]
      }
    ],
    "absence_of_games_analysis": "N/A"
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "High. He 'rescues' the congregation from the 'Spirit of the world' and technological insignificance.",
      "persecutor": "Medium. He targets 'modern fashions' (gendered language) and threatens the 'fraud' of a non-apostolic church.",
      "victim": "Low. Briefly appears at the start ('foolish and small') before rotating to Rescuer."
    },
    "congregation_position": "Victim (of the 'Spirit of the world' or 'Babel') needing the preacher's Rescuing truth.",
    "escape_possibilities": "The emphasis on 'each having a gift' offers a potential Adult exit, but it is framed within a Parent-controlled ritual (standing on command)."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 5,
    "summary": "The sermon is a classic example of using religious dogma to soothe existential anxiety. While it offers comfort (NP), it does so by establishing rigid boundaries and correcting 'errors' (CP), creating a dependency on the preacher's 'Apostolic' authority. The psychological impact is one of 'enclosed safety'—it makes the listener feel important again, but only by rejecting the outside world and modern thought.",
    "strengths": [
      "Strong validation of individual worth through the 'gifts' theology.",
      "Effective use of personal vulnerability to build initial rapport."
    ],
    "areas_for_improvement": [
      "High level of dogmatic coercion regarding gender and institutional validity.",
      "The use of 'all-or-nothing' ultimatums creates a fear-based compliance (AC)."
    ],
    "advice_for_game_free_communication": "Try to stay in the Adult ego state when addressing modern challenges. Instead of using the Spirit to 'defeat' the Internet, explore the 'Here-and-Now' reality of both. Avoid 'course corrections' that shame different perspectives (like gendered language) to maintain an Adult-Adult dialogue."
  }
}