{
  "metadata": {
    "sermon_title": "The Consuming Fire",
    "bible_text": "Hebrews 12:18-29; Psalm 71:1-2",
    "estimated_word_length": 1550,
    "estimated_duration_minutes": 15,
    "sermon_start_end": "A couple of years ago, when I was teaching homiletics in Toronto during the Advent season, I was invited to preach a series of Advent sermons in a local church. One of my students asked me what my theme would be. I said, “Wrath and judgment!” He laughed. [...] We believe that thou shalt come to be our Judge. We therefore pray thee, help thy servants whom thou hast redeemed with thy precious blood. Amen."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon focuses on the contrast between Sinai and Zion in Hebrews 12. However, it tends to drift into general themes of 'wrath and judgment' and 'God's plan' rather than mining the specific uniqueness of the Hebrews text. The 'nowhere else' quality is weakened by the inclusion of Psalm 71, which dilutes the specific intensity of the Hebrews pericope.",
      "quotes": [
        "In the reading today from the epistle to the Hebrews, there are two word pictures.",
        "Let’s take a look at the psalm we just read, the first two verses"
      ],
      "improvement_point": "Focus more sharply on the specific imagery of the 'shaking' of heaven and earth (v. 26-27) which is unique to this passage's eschatology."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 5,
      "findings": "The exegesis is largely thematic. While it correctly identifies the Sinai/Zion typology, it lacks depth regarding the specific situation of the Hebrew congregation (persecution, drifting away). The mention of 'Abel' is treated as a general biblical reference rather than exploring why the author of Hebrews uses it here.",
      "quotes": [
        "This reference to Abel reminds us of what happened immediately after the fall of Adam and Eve"
      ],
      "improvement_point": "Incorporate the historical-critical context of the original readers—a community in danger of apostasy—to explain why the 'consuming fire' was a necessary warning for them."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 7,
      "findings": "The application is concrete and avoids vague pietism. It addresses specific contemporary evils (Taliban, drug cartels, melanoma, oil spills). It correctly identifies the 'zeitgeist' of a culture that has lost the sense of shame and awe.",
      "quotes": [
        "It was not God’s plan that humanitarian aid workers should be shot point-blank by the Taliban.",
        "I don’t think many parents tell children they ought to be ashamed of themselves when they do something wrong"
      ],
      "improvement_point": "Connect the 'unshakeable kingdom' more concretely to the specific political or ecclesiastical instabilities of the present day."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 6,
      "findings": "The sermon moves back and forth between the text and the world. However, the 'exposition' often feels like a springboard for the preacher's own reflections on the 'demonic' or 'God's plan' rather than the hearer being 'expounded' by the text itself.",
      "quotes": [
        "Is it not good news that God will judge all of this?",
        "What do we make of this? It is one sign among a trillion others that the creation is bent out of shape."
      ],
      "improvement_point": "Ensure the contemporary examples serve the text's logic rather than the text serving as a proof-text for contemporary observations."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 7,
      "findings": "The three parts are clearly present in the background. Misery is defined as the 'bent' creation and sin; redemption is the blood of Christ; gratitude is the 'acceptable worship' and 'confident hope.' It avoids over-objectification by including the preacher and congregation in the need for judgment.",
      "quotes": [
        "Every one of us... is far gone in unrighteousness",
        "Therefore let us be grateful for receiving [this unshakeable] kingdom"
      ],
      "improvement_point": "Deepen the 'misery' aspect by moving beyond physical ailments (cancer) to the specific 'misery' of the heart that refuses to hear 'Him who speaks' (Heb 12:25)."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 5,
      "findings": "The sermon mentions judgment and 'consuming fire,' but the 'two ways'—the possibility of being lost—is softened. The conclusion suggests a somewhat universalist 'confident hope' where evil is judged but the personal responsibility of 'refusing Him' (v. 25) is underplayed.",
      "quotes": [
        "Our great and unconquerable hope is this: sin and the demons will be judged and consumed by the Lord himself."
      ],
      "improvement_point": "Address the warning in verse 25: 'See that you do not refuse Him who speaks.' The 'two ways' require a more explicit call to decision."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 7,
      "findings": "Christ is the telos. The sermon correctly identifies Christ as the mediator and the one who bears shame. It maintains the two-natures theology by identifying the God of Sinai with the Father of Jesus.",
      "quotes": [
        "Jesus is the one who took our shame upon himself on the cross",
        "It is his blood that speaks more graciously than the blood of Abel"
      ],
      "improvement_point": "Strengthen the link between the 'consuming fire' and Christ's own person—how is Christ himself the fire that purifies?"
    },
    "8_depth_and_length": {
      "score_1_to_10": 4,
      "findings": "At approximately 1550 words, the sermon likely lasts 15-16 minutes. According to Dekker's Thesis 8, this is insufficient for the 'breadth' required for true depth.",
      "quotes": [],
      "improvement_point": "Expand the exegetical section (Thesis 2) to reach the 20-minute threshold, allowing the text's own logic more room to breathe."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short primarily in its duration and the depth of its exegetical grounding. It relies heavily on external anecdotes (Barth, Dillard, personal family) rather than the internal mechanics of the Hebrews passage. However, it effectively challenges modern 'cheerful' Christianity with the reality of God's judgment and concrete contemporary misery.",
    "strengths": [
      "Strong rejection of the Marcionite split between the 'Old' and 'New' Testament God.",
      "Concrete application that avoids generalities and addresses the 'zeitgeist' of a shame-free culture.",
      "Clear Trinitarian framework in the background (misery, redemption, gratitude)."
    ],
    "weaknesses": [
      "Duration is below the 20-minute minimum required for homiletical depth.",
      "The 'two ways' are obscured by a focus on the destruction of 'evil' as an abstract force rather than the hearer's own responsibility.",
      "Exegesis of the original context is thin, replaced by literary and personal anecdotes."
    ],
    "final_judgment_according_to_dekker": "This is a 'speech about the gospel' that approaches the status of a sermon but lacks the necessary exegetical breadth and the sharp 'two ways' distinction required by Dekker. It is adequate in content but insufficient in formal depth."
  }
}