{
  "metadata": {
    "sermon_title": "What Is the Source?",
    "bible_text": "Amos 5:21-24; 8:11-12",
    "estimated_word_length": 1950,
    "estimated_duration_minutes": 19.5,
    "sermon_start_end": "IN LAST week’s New Yorker magazine, there is an arresting article in “The Talk of the Town.” It is about two “Marches on Washington” — the great and famous one in 1963 and the anniversary one this year. Here are the opening sentences in the article [...] Having heard this news, having known this love, having received this Word, is there any one of us who cannot now go forth from this place strengthened for the service of the one true God who is the powerful source of all charity, all mercy, and all reconciliation? May it be so. AMEN.!"
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 6,
      "findings": "The sermon uses Amos 5 and 8 as a foundation. It correctly identifies the 'famine of the Word' as a unique element of Amos. However, it tends to treat Amos as a 'prophet of social justice' (a general category) rather than wrestling with the specific, terrifying 'nowhere else' quality of Amos's absolute rejection of cultic life.",
      "quotes": [
        "I was re-reading the whole book of Amos prior to writing this sermon, I was forcibly struck by a theme that I had completely missed... the 'might, majesty, power, dominion, and glory' of the Lord God of hosts."
      ],
      "improvement_point": "Focus more sharply on the specific paradox of Amos: why does God specifically 'hate' these feasts compared to other prophetic critiques? Avoid merging it into a general 'social justice' theme."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 5,
      "findings": "The preacher provides basic historical context (8th century B.C., sheep-breeder). However, there is no evidence of engagement with the original languages or the specific theological structure of the Book of Twelve. The exegesis is largely thematic and historical-critical at a surface level.",
      "quotes": [
        "Amos was a prophet in Israel in the eighth century B.C., which means that he appeared on the world scene much earlier than Socrates or Buddha or Confucius."
      ],
      "improvement_point": "Incorporate deeper exegetical insights into the Hebrew terminology of 'justice' (mishpat) and 'righteousness' (tsedeqah) to move beyond modern political definitions."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 7,
      "findings": "The application is very concrete, referencing specific contemporary events (New Yorker article, MLK Jr., local parish initiatives). It avoids 'general truths' by naming specific social failures and specific congregational responses.",
      "quotes": [
        "On October 3, this congregation will open its shelter for six homeless men of New York City.",
        "The members of our chapter of Evangelicals for Social Action tell me that they have had a 'phenomenal' response..."
      ],
      "improvement_point": "The application relies heavily on a magazine article as the primary lens. Ensure the application flows from the text's own logic rather than using the text to validate a secular observation."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 4,
      "findings": "The sermon follows a somewhat 'blocky' structure: New Yorker article, then Amos history, then three points of application, then back to the article. The hearer is not so much 'drawn into the text' as they are shown parallels between the text and the world.",
      "quotes": [
        "If this sounds familiar, it is intended to. In all three areas... the nation of Israel in Amos’s day was very much like America in our day."
      ],
      "improvement_point": "Avoid the 'three points of comparison' method. Try to let the exposition of the text itself be the application, where the Word 'strikes' the hearer immediately."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "The 'misery' is well-articulated as both social injustice and the 'famine of the Word.' Redemption is placed in the 'mercy of Jesus Christ.' Gratitude is linked to the parish's social work. However, the 'misery' of being under God's judgment is somewhat softened by the focus on social progress.",
      "quotes": [
        "...the most devastating judgment of all will not be the destruction of the economy... but the withdrawal of the life-giving Word of God.",
        "Not one of us deserved the love that has been shown to us..."
      ],
      "improvement_point": "Strengthen the sense of 'misery' before God's holiness, specifically the 'idolatrous' nature of our own religious activities mentioned in Thesis 5."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 4,
      "findings": "The sermon touches on being 'lost' (existential loss), but it shies away from the radical 'two ways' of life and destruction. It frames the choice more as 'aligning with God's movement' rather than the ultimate destination of the soul.",
      "quotes": [
        "...the people gathered by the reflecting pool could hardly bear even to look at each other, they felt so lost.",
        "A person can be lost in time and in eternity. (Dekker)"
      ],
      "improvement_point": "Address the reality of divine rejection more seriously. If God 'hates' the worship, what is the consequence for the worshiper who does not change? Make the 'lostness' more than just a feeling of sadness."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 5,
      "findings": "Christ is mentioned at the end as the 'mercy of Jesus Christ' and the 'sacrifice of the Son of God.' However, Christ feels like an add-on to an Amos-themed lecture on social ethics rather than the 'telos' (goal) that the whole sermon builds toward.",
      "quotes": [
        "...not one of us could by any stretch of the imagination be called a saint except through the mercy of Jesus Christ..."
      ],
      "improvement_point": "Integrate the 'two natures' of Christ more fundamentally. Show how Christ is the 'ever-flowing stream' of righteousness that Amos could only point toward."
    },
    "8_depth_and_length": {
      "score_1_to_10": 5,
      "findings": "At approximately 1950 words, the sermon likely clocks in just under 20 minutes in a liturgical setting. According to Dekker, it barely reaches the threshold for 'breadth' required for 'depth.'",
      "improvement_point": "Expand the theological wrestling with the 'God of hosts' section to provide more substantive 'breadth' to the proclamation."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker's ideal primarily in its structural separation of text and world, and its tendency to use the Bible as a mirror for contemporary social commentary rather than a 'new, current, proclamatory word.' While it is concrete and avoids vague pieties, it lacks the 'sharpness' of the two ways and the deep Christological telos Dekker demands.",
    "strengths": [
      "Concrete application to the life of the specific congregation (homeless shelter, legal aid).",
      "Identification of the 'famine of the Word' as the ultimate misery.",
      "Avoidance of 'general truths' by grounding the message in the specific context of 1983 New York."
    ],
    "weaknesses": [
      "Heavy reliance on secular literature (The New Yorker) as the interpretive framework.",
      "Christology appears as a late-stage addition rather than the internal logic of the sermon.",
      "The 'two ways' (eternal/temporal loss) are replaced by existential 'sadness'."
    ],
    "final_judgment_according_to_dekker": "This is an adequate speech on biblical themes, but it struggles to be a 'sermon' in Dekker's sense because the exposition and application remain too distinct, and the 'seriousness' of God's judgment is partially eclipsed by social activism."
  }
}