{
  "metadata": {
    "analysis_date": "2024-05-23",
    "sermon_title": "Die Auferstehung der Frauen",
    "bible_text": "John 20:1-18",
    "notes": "A collaborative sermon by Luise Schottroff and Dorothee Sölle, blending feminist theology, political activism, and existentialist poetry."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 8,
        "score_explanation": "10 = Completely free from coercive judgments. 0 = Very dominant Critical Parent.",
        "presence_of_coercion": "Low",
        "analysis": "The sermon avoids traditional dogmatic 'shaming.' However, a subtle CP emerges in the political demands (anti-capitalism, self-sufficiency), framing those who don't comply as living in 'death logic.'",
        "quotes": [
          "Ich will uns Deutsche... nicht von dieser Schuld befreien.",
          "Wer heute weitererzählt... der partizipiert an Christi Auferstehung."
        ]
      },
      "healthy_care_NP": {
        "score": 9,
        "score_explanation": "10 = Healthy, non-smothering care. 0 = Absent or smothering.",
        "presence": "High",
        "analysis": "Strong Nurturing Parent presence that validates grief and tears as a legitimate human state rather than a weakness to be fixed.",
        "quotes": [
          "Gott, bitte, sieh ihre Traurigkeit vergibt ihnen ihre Versteinerung und sammle die ungeweinten Tränen"
        ]
      }
    },
    "adult": {
      "score": 7,
      "score_explanation": "10 = Strong Adult presence (Reason, Here-and-Now). 0 = Absent.",
      "presence": "Medium/High",
      "analysis": "The sermon uses historical-critical methods (Tacitus, Roman law) and political analysis (Chernobyl, Apartheid) to ground the text in reality. It invites the listener to analyze power structures.",
      "quotes": [
        "Dazu ist eine klare politische Analyse notwendig, sonst wissen wir nicht, wer die 'Letzten' sind."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 6,
        "score_explanation": "10 = Free from fear/compliance. 0 = Strong Adapted Child (fear culture).",
        "presence_of_adaptation": "Medium",
        "analysis": "The preacher admits to her own AC (resignation, fear of the 'world'). She models the transition from a fearful AC to a Free Child, but the heavy focus on 'guilt' and 'catastrophe' keeps the AC active.",
        "quotes": [
          "Ich bin müde, resigniert und habe leider recht behalten.",
          "Tief erschrocken ist meine Seele, denn ich lebe von Ausbeutung."
        ]
      },
      "free_child_FC": {
        "score": 8,
        "score_explanation": "10 = Authentic, playful, joyful. 0 = Absent.",
        "presence": "High",
        "analysis": "The 'X-factor' and the 'extra pot of hope' represent the Free Child—spontaneous, hopeful, and connected to the 'joy of life' despite the darkness.",
        "quotes": [
          "Ich habe einen kleinen heimlichen Extratopf... er ist voller Hoffnung.",
          "Gott, wie du Leben hervorbringst und Lachen"
        ]
      }
    },
    "dominant_ego_position": "Nurturing Parent / Adult (Integrated)"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Adult -> Adult (with NP support)",
    "analysis": "The preachers primarily address the listener as a peer ('sisters and brothers') capable of political and emotional maturity. They use their own vulnerability (Child) to invite the listener's Adult to reflect.",
    "ulterior_motives": "The social level is 'Let us reflect on the Gospel,' while the psychological level is 'Join my political movement to alleviate our collective guilt.'",
    "communicative_purity_score": 7,
    "purity_explanation": "10 = Completely transparent. 0 = Highly manipulative. The sermon is very honest about its biases, but uses the 'Resurrection' as a psychological hook for political action.",
    "risk_explanation": "The 'Bait and Switch' risk: Using the emotional relief of the Resurrection to sell a specific economic model (Selbstversorgungswirtschaft)."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "Ain't It Awful",
        "probability": "High",
        "formula_g_analysis": {
          "con": "Validation of the listener's despair about the world.",
          "gimmick": "The listener's fear of nuclear/ecological catastrophe.",
          "switch": "Moving from 'we are all victims' to 'we are all guilty' (shifters).",
          "payoff": "A shared sense of moral superiority through collective lamentation."
        },
        "evidence_quotes": [
          "Die Welt ist voller Gefahren, Tod und Finsternis, Lüge und Gottesferne.",
          "Ich bin ein Schrecken für meine Bekannten, wenn ich von der Gewalttat unseres deutschen Wohlstandes anfange."
        ]
      },
      {
        "name": "I'm Only Trying To Help You (ITHY)",
        "probability": "Low",
        "formula_g_analysis": {
          "con": "Offering a 'way out' through small alternative lifestyle choices.",
          "gimmick": "The listener's desire for efficacy in a complex world.",
          "switch": "The admission that these are only 'fragments' and might be 'ineffective symbols'.",
          "payoff": "Maintaining the role of the 'enlightened' guide even if the solution is small."
        },
        "evidence_quotes": [
          "Brot selbst backen... Anfangs habe ich gedacht, das sei nur gut als Symbol... letztlich wirkungslos."
        ]
      }
    ],
    "absence_of_games_analysis": "The sermon avoids NIGYSOB by including the preacher in the circle of guilt, preventing a Persecutor-Victim dynamic."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "High: Offering the 'X-factor' and 'Tradition' as the cure for despair.",
      "persecutor": "Low: Occasional judgment of 'the powerful' or 'the apathetic'.",
      "victim": "Medium: Identifying with the 'weeping Maria' and the 'resigned' citizen."
    },
    "congregation_position": "Pushed into the Victim role (oppressed by 'death logic') but invited to become Rescuers of the earth.",
    "escape_possibilities": "Yes, through the 'Adult' move of 'Political Analysis' and the 'Free Child' move of 'Hope,' the sermon encourages autonomy (Self-sufficiency)."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 7,
    "summary": "The sermon is psychologically complex. It avoids the 'Critical Parent' trap of traditional moralism but risks falling into 'Ain't It Awful' by dwelling extensively on catastrophe. However, the preachers' willingness to show their own 'Adapted Child' (fear, resignation) creates an authentic Adult-Adult connection. The focus on 'tears' as a valid ego-state is highly therapeutic, preventing the suppression of the Child.",
    "strengths": [
      "High level of vulnerability and self-disclosure.",
      "Validation of the 'Child' ego state (grief/joy).",
      "Strong Adult appeal for social reality testing."
    ],
    "areas_for_improvement": [
      "The link between 'Resurrection' and 'Baking Bread' can feel like a psychological 'Gimmick'.",
      "Risk of smothering the listener with a 'Nurturing Parent' who demands a specific political response."
    ],
    "advice_for_game_free_communication": "To remain game-free, ensure that the 'payoff' isn't just a shared feeling of 'being right' against the world. Encourage the listener to find their own 'Adult' solutions rather than prescribing a specific 'Self-sufficiency' model as the only way to experience Resurrection."
  }
}