{
  "metadata": {
    "analysis_date": "2024-05-23",
    "sermon_title": "Die Auferstehung der Frauen",
    "bible_text": "John 20:1-18",
    "notes": "Co-authored/delivered by Luise Schottroff and Dorothee Sölle. Strong feminist and liberation theology context (1980s West Germany)."
  },
  "ego_positions_scan": {
    "parent": {
      "freedom_from_critical_parent_CP": {
        "score": 8,
        "score_explanation": "The sermon avoids traditional dogmatic moralism. However, a 'Political CP' emerges that judges the 'silent majority' and 'capitalist logic'.",
        "presence_of_coercion": "Low",
        "analysis": "Coercion is not religious/legalistic but ideological. The 'must' is directed toward political awakening rather than ritual obedience.",
        "quotes": [
          "Ich will uns Deutsche... nicht von dieser Schuld befreien.",
          "Wer heute weitererzählt... der partizipiert an Christi Auferstehung."
        ]
      },
      "healthy_care_NP": {
        "score": 9,
        "score_explanation": "High Nurturing Parent presence. It validates the 'right to weep' and provides a protective space for grief.",
        "presence": "High",
        "analysis": "The care is autonomy-promoting; it uses the NP to give the Child permission to feel, rather than to keep the listener dependent.",
        "quotes": [
          "Gott, bitte, sieh ihre Traurigkeit vergibt ihnen ihre Versteinerung."
        ]
      }
    },
    "adult": {
      "score": 7,
      "score_explanation": "Strong Adult presence in historical-critical analysis, though sometimes blurred by poetic/prophetic language.",
      "presence": "High",
      "analysis": "The preacher provides historical data (Tacitus, ANC, Chernobyl) to ground the sermon in reality. It invites the listener to analyze economic structures.",
      "quotes": [
        "Dazu ist eine klare politische Analyse notwendig...",
        "Das Johannesevangelium ist das Evangelium von kleinen christlichen Gemeinden Ende des ersten Jahrhunderts..."
      ]
    },
    "child": {
      "freedom_from_adapted_child_AC": {
        "score": 9,
        "score_explanation": "The sermon explicitly calls for the overthrow of the Adapted Child (fear of authorities, 'silent' compliance).",
        "presence_of_adaptation": "Low",
        "analysis": "The preacher models a shift from the 'fearful' AC (hiding behind closed doors) to the 'Free' Child.",
        "quotes": [
          "Wir alle verstummen, verschweigen, verdrängen, lügen mit.",
          "Ich will mich nicht mehr zum Schweigen bringen lassen."
        ]
      },
      "free_child_FC": {
        "score": 8,
        "score_explanation": "High presence of FC through Sölle's poetry and the 'visionary' ending.",
        "presence": "High",
        "analysis": "Authentic joy and spontaneity are found in the 'Extratopf' (extra pot) of hope and the vision of a 'Frauenkirche'.",
        "quotes": [
          "...ich habe einen kleinen heimlichen Extratopf habe, der ist voller Hoffnung.",
          "Wir haben die Vision: Die Menschen werden als Handwerker und Bauern die Natur pflegen."
        ]
      }
    },
    "dominant_ego_position": "Nurturing Parent / Adult (Integrated)"
  },
  "transaction_analysis": {
    "primary_transaction_style": "Adult -> Adult with NP support",
    "analysis": "The preacher speaks as an equal ('I too am tired') while providing a parental permission to grieve. It avoids the traditional P->C hierarchy of the pulpit.",
    "ulterior_motives": "The 'Social' level is a Bible study; the 'Psychological' level is a call to political resistance.",
    "communicative_purity_score": 8,
    "purity_explanation": "Very transparent about its political goals. Minimal 'double bottoms' because the preacher includes herself in the critique.",
    "risk_explanation": "The risk of a 'Rescue' operation where the preacher defines the only 'correct' way to be a Christian (political activism)."
  },
  "games_analysis": {
    "detected_games": [
      {
        "name": "Ain't It Awful",
        "probability": "Medium",
        "formula_g_analysis": {
          "con": "Sharing the pain of the world (Chernobyl, Sandoz).",
          "gimmick": "The listener's genuine fear of catastrophe.",
          "switch": "The shift from 'we are victims' to 'we are the resistors'.",
          "payoff": "A sense of moral superiority over the 'unthinking' masses."
        },
        "evidence_quotes": [
          "Ich bin keine Prophetin, und doch kann ich euch die nächste Katastrophe weissagen."
        ]
      }
    ],
    "absence_of_games_analysis": "The sermon largely avoids games by using the 'Adult' to take responsibility. Instead of blaming the listener (NIGYSOB), the preacher uses 'I' statements to model vulnerability."
  },
  "drama_triangle_analysis": {
    "preacher_roles": {
      "rescuer": "Moderate: Offers the 'Extratopf' of hope and the 'Alternative' as a way out.",
      "persecutor": "Low: Only targets 'the powerful' and 'the logic of death', rarely the congregation.",
      "victim": "High (Authentic): Preacher identifies as a victim of the 'logic of death' and resignation."
    },
    "congregation_position": "The congregation is invited to move from 'Victim' (paralyzed by fear) to 'Rescuer/Agent' of the earth.",
    "escape_possibilities": "Yes, through 'Autonomy' (Selbstversorgung) and 'Awareness' (Analyse)."
  },
  "conclusion_and_recommendation": {
    "psychological_health_score": 8,
    "summary": "This sermon is psychologically robust because it breaks the traditional Parent-Child hierarchy of preaching. By validating the 'Child's' grief (Maria Magdalena) and using the 'Adult' to analyze reality, it promotes autonomy. It avoids the 'I'm OK, You're Not OK' trap by the preacher's admission of her own resignation and complicity. The primary psychological movement is from 'Adapted/Frozen' to 'Free/Active'.",
    "strengths": [
      "Use of 'I' statements prevents the Persecutor role.",
      "Validation of grief (NP) provides a safe base for the Adult to function.",
      "Encourages autonomy through 'Selbstversorgung' (self-sufficiency)."
    ],
    "areas_for_improvement": [
      "The 'Ain't It Awful' dynamic regarding technology could lead to a new 'Adapted Child' role (compliance with the preacher's specific lifestyle choices).",
      "Potential for 'Moral Superiority' payoff in the 'Extratopf' metaphor."
    ],
    "advice_for_game_free_communication": "Continue to emphasize that the 'Vision' is an invitation, not a new Law (CP). Ensure the 'Free Child's' joy isn't entirely eclipsed by the 'Adult's' political burden."
  }
}