{
  "metadata": {
    "sermon_title": "An \"i Am\" Saying Of Jesus",
    "bible_text": "John 14:6",
    "estimated_word_length": 1150,
    "estimated_duration_minutes": 11,
    "sermon_start_end": "The whole thing was coming \"down to the wire,\" as they say in horse-racing circles. These men who had followed Jesus, betting on him everything they had and were, now began to see some hazards and horrors for which, quite frankly, they had not bargained. [...] So the Shepherd will search and find his sheep \"and when he hath found it, he layeth it on his shoulders, rejoicing. And when he cometh home, he calleth together his friends and neighbours, saying unto them, Rejoice with me; for I have found my sheep which was lost.\""
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 4,
      "findings": "The sermon uses John 14:6 as a springboard for general reflections on 'the way' rather than mining the specific uniqueness of this text. It fails Dekker's test of finding what is 'NOWHERE else' by drifting into general metaphors of sheep and highways from other biblical books.",
      "quotes": [
        "Suppose the poor pilgrims cannot find the way, though it is said that \"...an highway shall be there...\"",
        "So the Shepherd will search and find his sheep"
      ],
      "improvement_point": "Focus exclusively on the Johannine context of the 'I Am' statements and the specific dialogue with Thomas, rather than importing imagery from Isaiah or Luke."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 5,
      "findings": "The preacher attempts to set the scene of the Upper Room, but it remains at the level of psychological dramatization rather than rigorous theological exposition. There is no evidence of the linguistic or historical-critical depth Dekker demands.",
      "quotes": [
        "Slow-witted though the disciples were, they were beginning to see for themselves that things were not going well",
        "It was like a teacher drilling his students once again"
      ],
      "improvement_point": "Incorporate the theological weight of the Greek 'ego eimi' and the specific covenantal implications of 'the Truth' and 'the Life' in Johannine theology."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 6,
      "findings": "The application to 'the altar of greed' and the California university survey provides a concrete cultural critique. However, it often veers into moralism or general 'life philosophy' which Dekker warns against.",
      "quotes": [
        "A California university carried on a survey recently of more than 200,000 college students...",
        "this self-centeredness has been baptized and sanctified by the health-and-wealth TV evangelists"
      ],
      "improvement_point": "Connect the critique of greed more directly to the specific claim of Christ as 'The Way' rather than treating it as a separate sociological observation."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 4,
      "findings": "The sermon follows a traditional 'three-point' structure (Way out, Way through, Way in) which separates the text from the application. The hearer is not 'drawn into the text' so much as the text is used to illustrate the preacher's points.",
      "quotes": [
        "\"I am the way.\" Jesus is the way out.",
        "\"I am the way,\" says Jesus. He is the way through...",
        "Yes, and he is the way in."
      ],
      "improvement_point": "Abandon the artificial three-point structure in favor of a narrative movement where the text's own logic 'expounds' the hearer's life simultaneously."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "The element of 'misery' is present in the description of captivity and greed. 'Redemption' is present in Christ as the way. 'Gratitude' is the weakest link, appearing only as a 'firmer tread' rather than a life of service.",
      "quotes": [
        "We are all captives and slaves. There is something wrong with our humanity.",
        "A person so believing walks with a firmer tread through the winding and often troubled ways of life."
      ],
      "improvement_point": "Deepen the 'misery' from mere 'dis-ease' to a theological state of being lost before God, and ground 'gratitude' in specific ethical response."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 3,
      "findings": "The sermon almost entirely avoids the 'narrow way' that leads to destruction. It leans heavily toward a universalist comfort, suggesting everyone is a 'child of a Father's house' without the gravity of choice Dekker requires.",
      "quotes": [
        "We are children of a Father's house and our ways may be ordered of the Lord.",
        "The Shepherd will search and find his sheep... when he hath found it, he layeth it on his shoulders"
      ],
      "improvement_point": "Address the second half of the text: 'no man cometh unto the Father, but by me,' which implies the reality of being lost or excluded."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 7,
      "findings": "Christ is clearly the telos. The sermon correctly identifies Christ as the source of salvation outside of man. However, it flirts with 'life philosophy' rather than strictly the 'two natures' theology Dekker seeks.",
      "quotes": [
        "Man has no life in himself, it is Christ who is his life.",
        "Jesus is the way out of our foiled sense of destiny and purpose."
      ],
      "improvement_point": "Ensure Christ is presented not just as a 'way out' of psychological frustration, but as the incarnate God who reconciles the world."
    },
    "8_depth_and_length": {
      "score_1_to_10": 2,
      "findings": "At approximately 1150 words, the sermon would last roughly 11-12 minutes. This is significantly below Dekker's 20-minute minimum for 'depth.'",
      "improvement_point": "Expand the exegetical and dogmatic sections to provide the 'breadth' necessary for theological 'depth.'"
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker's criteria primarily due to its brevity and its tendency to substitute psychological comfort for rigorous theological exposition. It lacks the 'two ways' gravity and relies on a thematic 'three-point' structure that hinders the actualization of the specific Bible passage. While it contains a strong Christocentric focus and some concrete contemporary critique, it remains too general and brief to achieve the 'present of revelation' Dekker describes.",
    "strengths": [
      "Clear Christocentric telos where Christ is the only source of salvation.",
      "Concrete contemporary application regarding the 'altar of greed' and societal vulnerability."
    ],
    "weaknesses": [
      "Insufficient length (11-12 minutes) precludes the necessary depth.",
      "Failure to address the 'two ways' or the possibility of being lost, resulting in a one-sided emphasis on comfort.",
      "Thematic structure (Out/Through/In) imposes a framework on the text rather than letting the text's unique voice speak."
    ],
    "final_judgment_according_to_dekker": "This is an 'adequate' speech about a biblical theme, but it is not a 'sermon' in the strict sense of Dekker's theses. It lacks the required length for depth, avoids the offense of the 'two ways,' and uses the text as an illustration for a general philosophy of life rather than recreating the Word as a current, specific proclamation."
  }
}