{
  "metadata": {
    "sermon_title": "Hearts Waiting For What?",
    "bible_text": "Isaiah 25:9 (implied), Isaiah 63:9, Deuteronomy 33:27, Psalm 103:13, Isaiah 43:1-3",
    "estimated_word_length": 1450,
    "estimated_duration_minutes": 14,
    "sermon_start_end": "In Lines Composed Above Tintern Abbey, William Wordsworth, in words among the sweetest in the English language, speaks of the haunting sense of high destiny that belongs to us. He speaks for all of us when he describes an inward yearning toward something worthy which he has not yet reached [...] God close to my crying heart, God close to our broken society — that is the gospel of the New Testament!"
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 3,
      "findings": "The sermon fails Dekker's first requirement. It does not recreate one specific Bible passage into a current word. Instead, it uses the Bible as a reservoir of 'recurring notes' and 'themes' to support a general human sentiment of yearning. It is a speech about a 'biblical idea' rather than an exposition of a specific pericope.",
      "quotes": [
        "In all the sweep of the Bible there is this constantly recurring note.",
        "Beneath the events that fill the Bible there is this continuing theme..."
      ],
      "improvement_point": "Select one specific pericope (e.g., Isaiah 25:1-9) and identify what is unique to that text which cannot be found elsewhere, rather than treating the Bible as a collection of interchangeable proof-texts for human longing."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 2,
      "findings": "There is no evidence of the 'requirement of exposition.' The preacher does not engage with Hebrew, the specific historical context of the exile or post-exilic period, or the theology of the book of Isaiah. The text is treated as a 'haunting poet's' expression of general truth rather than a specific historical revelation.",
      "quotes": [
        "So it was with the ancient prophet, this strangely haunting poet whom we call Isaiah."
      ],
      "improvement_point": "The preacher must move beyond poetic appreciation and investigate the specific historical crisis the text addressed to understand what it 'meant for the first readers.'"
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 6,
      "findings": "The application is the strongest part of the text, specifically regarding the American civil rights struggle and racial division. It attempts to be concrete about the 'zeitgeist.' However, it often lapses back into generalities about 'humanity' and 'yearning' which Dekker forbids as 'not true truths.'",
      "quotes": [
        "Is our last court of appeal our own Supreme Court, or is God going it with us?",
        "We shall yet stand together in this land with all races and regions united in liberty's holy cause..."
      ],
      "improvement_point": "Avoid the 'general truths' of Wordsworth's poetry and focus the application strictly on the specific demands or promises of the chosen biblical text."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 3,
      "findings": "Because there is almost no formal exposition, there is no movement between text and hearer. The hearer is drawn into a literary and psychological reflection, not into the biblical text itself. The 'present of revelation' is replaced by a 'present of human experience.'",
      "quotes": [
        "Whatever the term, we are aware of something about to happen — big, wonderful."
      ],
      "improvement_point": "Structure the sermon so that the contemporary situation (e.g., racial injustice) is 'expounded' through the lens of the specific biblical passage's logic."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 5,
      "findings": "The sermon touches on misery (racial sin, personal failure) and redemption (God's presence). However, it leans heavily toward a psychological 'yearning' rather than the objective misery of man before God. Redemption is presented as God 'sitting where we sit' rather than a radical act of grace.",
      "quotes": [
        "How does he look upon our cemeteries of wasted years?",
        "God close to my crying heart... that is the gospel."
      ],
      "improvement_point": "Deepen the 'misery' aspect by defining it not just as 'unfulfilled yearning' or 'social struggle,' but as man's condition before God."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 4,
      "findings": "The sermon acknowledges 'national sins' and 'bitter harvest,' suggesting a form of temporal loss. However, it lacks the 'seriousness of the two ways.' The tone is overwhelmingly optimistic ('Our land, America, has a better day on ahead'), which risks making the 'lostness' appear non-threatening.",
      "quotes": [
        "For the foreseeable future we shall doubtless find ourselves in a painful period of being purged and cleansed of our great national sins."
      ],
      "improvement_point": "Incorporate the possibility of being 'lost in time' more sharply; the current tone suggests an inevitable progress toward 'liberty's holy cause' that lacks the biblical tension of judgment."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 2,
      "findings": "Christ is almost entirely absent as the 'telos' of the sermon. While 'the gospel' is mentioned, it is defined as God's empathy rather than the person and work of Jesus Christ. The sermon fails the '3-2-1 rule' because the 'One Lord' is not the specific center or goal.",
      "quotes": [
        "God close to my crying heart... that is the gospel of the New Testament!"
      ],
      "improvement_point": "Explicitly move toward Christ as the fulfillment of the promise. As Dekker states: 'In no sermon can Christ be completely silenced.'"
    },
    "8_depth_and_length": {
      "score_1_to_10": 4,
      "findings": "At approximately 14 minutes, the sermon falls short of Dekker's 20-minute minimum. It lacks the 'breadth' required for 'depth.' The brevity contributes to the reliance on generalities rather than rigorous exposition.",
      "quotes": [],
      "improvement_point": "Increase the substantive weight by adding rigorous exegesis and a more developed dogmatic framework to reach the 20-minute threshold."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker’s criteria primarily because it lacks a specific biblical pericope as its foundation, opting instead for a thematic approach supported by secular poetry and general human psychology. It fails to provide rigorous exegesis and almost entirely silences the specific person of Christ as the telos. While the application to the American racial context is concrete, it is grounded more in democratic idealism than in the specific Word of God.",
    "strengths": [
      "Concrete application to the contemporary sociopolitical 'zeitgeist' (racial injustice).",
      "Effective use of the 'misery' category regarding national sins and personal failure."
    ],
    "weaknesses": [
      "Lack of a specific Bible passage; the sermon is a topical speech.",
      "Total absence of original context exegesis (Hebrew/history).",
      "Insufficient duration (14 min) to achieve the required depth.",
      "Christ is not the telos; the 'gospel' is reduced to divine empathy."
    ],
    "final_judgment_according_to_dekker": "This is not a sermon in the sense of Dekker's definition. It is a religious-ethical speech. It fails the formal requirement of being an 'exposition and application of a specific Bible passage' and the substantive requirement of the 3-2-1 rule, particularly regarding the 'One Lord.'"
  }
}