{
  "metadata": {
    "sermon_title": "Two Names In The Morning",
    "bible_text": "John 20:1-18",
    "estimated_word_length": 1450,
    "estimated_duration_minutes": 14,
    "sermon_start_end": "When our astronauts first reached the moon, an American president, in that excessive, excited way of speaking which many political people, and preaching ones, too, have, exclaimed that the trip to the moon was the greatest news story since the creation. The astonishing feat made the statement understandable [...] The music here of the spiritual celebrates the supreme meeting and dialogue in all of the universe — that between the risen Lord and one who knows that life can be forever different only when the Lord's voice has spoken and the enraptured soul has heard it and replied. 'Mary.' 'Master!'"
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 5,
      "findings": "The sermon focuses on John 20, specifically the encounter between Mary and Jesus. However, it fails Dekker's requirement of finding what is 'NOWHERE else' in the Bible. The preacher treats the text as a general illustration of the Resurrection or the 'voice of God' rather than mining the specific theological particularity of this pericope.",
      "quotes": [
        "In the yet-dark morning hours, Mary Magdalene makes her quiet and reverent way to the sepulchre",
        "Mary's word to the disciples is, 'They have taken away the Lord out of the sepulcher'"
      ],
      "improvement_point": "Identify the unique theological contribution of the Johannine 'Noli me tangere' or the specific naming of Mary, rather than using it as a springboard for general reflections on love and persistence."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 4,
      "findings": "There is no evidence of Greek/Hebrew study or rigorous historical-critical engagement. The preacher relies on 'musing' (Ellen G. White) or 'fancying' (Chrysostom) rather than systematic exposition of the text's original meaning for its first readers.",
      "quotes": [
        "John of Antioch... fancied that Mary Magdalene turned because the eyes of the angels alerted her",
        "Ellen G. White... mused that Mary may have thought that someone decided that the grave of a rich man... was too fine"
      ],
      "improvement_point": "Replace speculative 'musings' with rigorous exegesis of the Johannine context, focusing on the specific vocabulary and theological structure of the Fourth Gospel."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 6,
      "findings": "The application is concrete regarding the socio-political context (Black Power movement, Marxism), which Dekker values. However, it often drifts into general psychological truths about 'love' and 'persistence' which lack the 'true truth' of specific biblical application.",
      "quotes": [
        "The dashikis are gone; the church is still here. The black-power people are living abroad or are in jail",
        "Someone here got through school because a teacher somewhere kept coming back to the empty tomb."
      ],
      "improvement_point": "Ground the contemporary application more strictly in the text's specific logic rather than using the text as a metaphor for general human perseverance."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 5,
      "findings": "The sermon alternates between narrative retelling and anecdotal application. While not a strict 'block' structure, the 'exposition' is largely descriptive storytelling rather than a movement where the hearer is 'expounded' by the text.",
      "quotes": [
        "Mary saw what she took to be two angels... Someone pondered if these bright forms were the same who hovered over the manger",
        "There are people listening to me now who found a firm footing in life because a mother, a father kept coming back"
      ],
      "improvement_point": "Integrate the contemporary struggle for identity and recognition directly into the moment Jesus calls Mary's name, making the text the active agent of the application."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "Misery (the 'cold, chill heaviness' of death) and Redemption (the Resurrection) are present. Gratitude is implied through the response of the 'enraptured soul.' However, the misery is described more as a psychological state than a theological condition 'before God.'",
      "quotes": [
        "all who knew and loved Jesus were dazed and numb with that cold, chill heaviness which death ever brings",
        "the stone rolled away from her poor, sorrowing heart. 'Rabboni, Master, it is you.'"
      ],
      "improvement_point": "Deepen the 'misery' aspect by addressing the theological lostness of the disciples apart from the Resurrection, moving beyond mere grief."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 4,
      "findings": "The sermon hints at the 'two ways' by mentioning the 'wise and the foolish' and the 'eternity of difference' our conduct makes. However, it lacks the sharp call to decision Dekker demands. It feels 'safe' rather than presenting the ultimate possibility of being lost.",
      "quotes": [
        "it may make a world of difference as to how we conduct this life. A world? An eternity of difference.",
        "what is there that gives meaning to this crazy quilt we call life where all, the wise and the foolish, die alike?"
      ],
      "improvement_point": "The preacher must more explicitly address the consequence of not hearing the Lord's voice—the reality of being 'lost in time' or 'eternity'."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 7,
      "findings": "Christ is clearly the telos. The sermon moves toward the encounter with the Risen Lord as the only source of life. The emphasis on the voice of Jesus as the one who heals and calls is a strong Christocentric element.",
      "quotes": [
        "The resurrection of Jesus Christ is the greatest news story in the history of this planet",
        "life can be forever different only when the Lord's voice has spoken"
      ],
      "improvement_point": "Strengthen the 'extra nos' (outside ourselves) aspect of this grace to ensure it doesn't become a purely internal psychological experience."
    },
    "8_depth_and_length": {
      "score_1_to_10": 3,
      "findings": "At approximately 1450 words, the sermon would take roughly 14-15 minutes. This fails Dekker's absolute minimum of 20 minutes. The 'depth' is sacrificed for narrative speed and anecdotal breadth.",
      "improvement_point": "Expand the exegetical and dogmatic depth to reach the 20-minute threshold required for substantive proclamation."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker's criteria primarily due to insufficient length, a lack of rigorous exegetical exposition (Hebrew/Greek/Context), and a tendency toward psychological sentimentality over theological specificity. While it successfully engages the zeitgeist and maintains a Christocentric focus, it treats the biblical text more as a narrative backdrop than a unique word from God that can be found nowhere else.",
    "strengths": [
      "Concrete engagement with contemporary social movements (Black Power, Marxism) as a foil for the Gospel.",
      "Strong Christocentric telos, focusing on the transformative power of the Risen Lord's voice.",
      "Effective use of the 'three parts' (misery/redemption) in a psychological-pastoral sense."
    ],
    "weaknesses": [
      "Failure to meet the 20-minute minimum requirement for 'depth'.",
      "Lack of scholarly exegesis; reliance on speculative musings rather than linguistic or historical analysis.",
      "Insufficient development of the 'two ways' and the serious possibility of being lost."
    ],
    "final_judgment_according_to_dekker": "This is an evocative speech with biblical themes, but according to Dekker's strict formal definition, it is not yet a 'sermon' because it lacks the necessary breadth of depth (length) and the specific exegetical rigor required to recreate the Bible into a current, proclamatory word."
  }
}