{
  "metadata": {
    "sermon_title": "What Are You Doing Here?",
    "bible_text": "John 13:34",
    "estimated_word_length": 1450,
    "estimated_duration_minutes": 14.5,
    "sermon_start_end": "Someone has told of a bleary-eyed, whisky-logged man wandering into the side door of a downtown church in a Midwestern city and finding himself facing a worshiping congregation. The story runs that this poor, drunken man, somewhat unsteady on his feet, cried out in a loud voice, \"Hello, folks, what are you doing here?\" [...] Really, that's what you and I are meant to be doing here."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 3,
      "findings": "The sermon fails to treat the Bible passage as central. It uses John 13:34 as a thematic springboard for a general discourse on the meaning of life rather than recreating the specific text into a current word. The preacher treats 'love' as a general biblical idea rather than exploring what this specific pericope says that can be found nowhere else.",
      "quotes": [
        "Jesus said that we are here that we might fulfill his commandment.",
        "And to all this someone says, the best that the Christian gospel can offer is a commandment that we should love one another?"
      ],
      "improvement_point": "Identify the unique 'nowhere else' quality of John 13:34—specifically the 'as I have loved you' as the ground of the 'new' commandment—rather than treating it as a general ethical obligation."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 2,
      "findings": "There is almost no exposition of the original context. The preacher mentions it is a 'farewell discourse,' but fails to engage with the Greek text, the Johannine theology of the 'hour,' or the historical situation of the disciples. The sermon relies on anecdotes and cultural observations rather than scholarly exegesis.",
      "quotes": [
        "It is his farewell discourse in the bosom of the fellowship. He is laying to his friends' hearts what he thinks of them and what he expects of them."
      ],
      "improvement_point": "Incorporate the historical and linguistic context of the 'Mandatum.' Explain why this commandment is 'new' (kainos) in the context of the Torah and the impending cross."
    },
    "3_application_concrete_contemporary": {
      "score_1_to_10": 5,
      "findings": "The application is contemporary but tends toward the general. While it mentions specific societal issues (race, industry, government), it remains at the level of 'aggressive good will' rather than concrete, specific actions for the specific congregation. It functions more as a cultural philosophy than a specific application of the Word.",
      "quotes": [
        "To be aggressively committed to the good of all people in our businesses and in our industries seems to most of us utterly too large an order.",
        "Our country continues a broken and divided land. We are race against race and generation against generation."
      ],
      "improvement_point": "Move from 'aggressive good will' as a concept to specific, concrete ways this love manifests in the local congregation’s immediate social and political context."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 4,
      "findings": "Exposition and application are not mixed because there is very little exposition to begin with. The sermon is a series of reflections on life stages and cultural tropes (Western heroes, toothpaste ads) followed by a brief turn to the text at the end. The hearer is not 'expounded' together with the text.",
      "quotes": [
        "The truth is that we are not here to be merely self-reliant people... Jesus said that we are here that we might fulfill his commandment."
      ],
      "improvement_point": "Start with the text and let the contemporary analysis flow directly from the exegesis, rather than using the text as a late-stage solution to a philosophical problem."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 6,
      "findings": "The three parts are present in the background. Misery is identified as the 'planet of pain' and the futility of self-reliance. Redemption is hinted at through Christ's strength. However, the sermon leans heavily on man as the subject of 'doing' rather than man as the subject of God's action.",
      "quotes": [
        "There is sorrow and there is sin and there is sickness and there is death in this world...",
        "Really, that's what you and I are meant to be doing here."
      ],
      "improvement_point": "Strengthen the 'redemption' aspect by emphasizing that the ability to love is a gift of the Spirit (gratitude) rather than an 'aggressive will' (human effort)."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 4,
      "findings": "The sermon touches on the 'mystery of our time' and the 'darkness of death,' but it avoids the sharp edge of being 'lost.' It frames the choice as a 'splendid destiny' versus a 'shallow' life, which lacks the gravity of Dekker’s 'two ways' leading to life or destruction.",
      "quotes": [
        "But to be always gaily happy is too shallow a destiny for the sons and daughters of God.",
        "A person can be lost in time and in eternity."
      ],
      "improvement_point": "Address the consequence of rejecting the commandment of love more seriously; define the 'lostness' of a life lived in self-reliant isolation more sharply."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 5,
      "findings": "Christ is mentioned as the one who gives the commandment and as the 'fairest life,' but He functions more as an example or a source of 'strength' than the ontological telos. The doctrine of the two natures is not utilized. Grace is mentioned but is quickly turned into a call for human 'aggressive good will.'",
      "quotes": [
        "For there is an audacious optimism, realistic and cleareyed, he offers to those who surrender to him...",
        "throwing in our small strength, all of it... with his great strength"
      ],
      "improvement_point": "Present Christ not just as the commander, but as the one who is our life. Shift the focus from our 'alliance' with Him to His finished work as the only ground for our love."
    },
    "8_depth_and_length": {
      "score_1_to_10": 4,
      "findings": "At approximately 14.5 minutes, the sermon falls significantly short of the 20-minute minimum required for 'depth.' The brevity contributes to the lack of substantive exegesis and the reliance on anecdotal breadth over theological depth.",
      "improvement_point": "Expand the exegetical section and the dogmatic grounding of the 'new commandment' to reach the necessary breadth for spiritual depth."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker's criteria primarily because it functions as a moral-philosophical speech rather than an exposition of a specific Bible passage. It lacks the necessary length for depth, bypasses rigorous exegesis of the Greek/Hebrew context, and treats the text as a thematic anchor for general truths about human interdependence. While it correctly identifies human misery and the need for a contemporary application, it relies too heavily on human 'will' and 'strength' rather than the proclamatory power of the Word itself.",
    "strengths": [
      "Adequate identification of the 'misery' of modern self-reliance and the 'planet of pain'.",
      "Clear attempt to apply the gospel to massive structural arrangements of society (industry, government).",
      "Traceable movement from human transiency to the divine mandate."
    ],
    "weaknesses": [
      "Insufficient length (approx. 14.5 minutes) prevents the 'breadth' required for depth.",
      "Lack of specific exegesis; the text is used as a keyword rather than a unique revelation.",
      "The 'two ways' are softened into a choice between 'splendid' and 'shallow' rather than life and destruction."
    ],
    "final_judgment_according_to_dekker": "This is not a sermon in the strict sense of Dekker's definition. It is a religious speech about a biblical idea. To become a sermon, it must subject itself to the specific constraints of the Johannine text and move from general moral encouragement to the concrete proclamation of God's Word."
  }
}