{
  "metadata": {
    "sermon_title": "The Answer To A Riddle",
    "bible_text": "John 14:12-13",
    "estimated_word_length": 1450,
    "estimated_duration_minutes": 14,
    "sermon_start_end": "The question was whether this subject should read: \"The Answer to a Riddle\" or \"The Answer to a Puzzle.\" I think there is a difference between a riddle and a puzzle [...] We have but to ask him, to call him, to talk to him, and to plead with him, for he is at the right hand of the Father."
  },
  "analysis_per_criterion": {
    "1_specific_bible_passage": {
      "score_1_to_10": 5,
      "findings": "The sermon centers on a specific verse (John 14:12), but it struggles to identify what is unique to this passage. The preacher treats the text as a 'riddle' to be solved rather than a unique revelation. The specificity is diluted by general references to the cross and resurrection which, while biblical, are not the unique 'point' of this specific text as Dekker demands.",
      "quotes": [
        "There is one passage which I have never dared to use as a text.",
        "I have looked upon a certain saying of Jesus as a riddle whose answer I did not have."
      ],
      "improvement_point": "Identify what John 14:12 says that cannot be found in 1 Corinthians or the Gospels' passion accounts. Focus on the specific pneumatological link between the 'greater works' and the 'going to the Father'."
    },
    "2_exegesis_original_context": {
      "score_1_to_10": 4,
      "findings": "Exegesis is largely absent. There is no mention of the Johannine context, the specific meaning of 'works' (erga) in John, or the Greek nuances. The preacher uses a personal anecdote about 1937 and a secular riddle about a king to frame the text rather than historical-critical or linguistic analysis.",
      "quotes": [
        "The simplest mind can understand what it says.",
        "I had been reading, or seeing, only that part... It was being read out of context."
      ],
      "improvement_point": "Incorporate the original context of the Farewell Discourses. Explain the theological necessity of the Ascension in Johannine theology rather than relying on a mechanical 'branch office' metaphor."
    },
    "3_application_concrete_concrete_contemporary": {
      "score_1_to_10": 3,
      "findings": "The application is remarkably general and borders on 'general truths' which Dekker forbids. References to 'hospitals' and 'monasteries' are historical generalizations, not concrete contemporary applications for the specific congregation. The list of cities (Brooklyn to Budapest) is a rhetorical device, not a concrete spiritual application.",
      "quotes": [
        "Christ is equally in Brooklyn and in Budapest, equally in San Francisco and in Savannah...",
        "In his name, old evils have been faced, pagan customs have been overthrown..."
      ],
      "improvement_point": "Move away from global historical generalizations. Apply the 'greater works' to the specific psychological or social 'misery' of the current congregation in their specific time and place."
    },
    "4_interwoveness_exposition_application": {
      "score_1_to_10": 4,
      "findings": "The sermon follows a 'problem-solution' structure rather than an interwoven movement. The first half is a personal struggle with the text; the second half is a series of general theological assertions. The hearer is an observer of the preacher's 'riddle' rather than being 'expounded' by the text itself.",
      "quotes": [
        "No, sir, I was not about to try to preach that until two weeks ago — it all came clear."
      ],
      "improvement_point": "Avoid the 'preacher-centric' narrative. Draw the hearer into the text immediately so that the exposition of the 'greater works' is simultaneously an application to the hearer's life."
    },
    "5_three_parts_misery_redemption_gratitude": {
      "score_1_to_10": 5,
      "findings": "The 'misery' is defined primarily as the preacher's intellectual confusion or the disciples' sadness at Jesus' departure. This is a 'soft' misery. Redemption is present as the 'death and resurrection,' but it feels like a dogmatic addition rather than the background of the sermon's movement.",
      "quotes": [
        "The dear Lord was preparing his friends for his death and his physical absence. He was saying to them, 'I go away.'"
      ],
      "improvement_point": "Deepen the 'misery' part. Address the actual inability of the hearer to perform 'works' without the Spirit, rather than just the sadness of Jesus' absence."
    },
    "6_two_ways_seriousness_of_choice": {
      "score_1_to_10": 2,
      "findings": "This is the weakest point. There is no sense of the 'two ways' or the possibility of being lost. The sermon is overwhelmingly optimistic ('the best days are not in the past'), ignoring the responsibility and the 'narrow way' Dekker emphasizes.",
      "quotes": [
        "The best days are not in the past.",
        "Greater works yet shall Christ's people do."
      ],
      "improvement_point": "Address the alternative to the 'greater works.' What does it mean to fail to answer this calling? Introduce the gravity of human choice in relation to the 'name' of Jesus."
    },
    "7_christocentric_grace": {
      "score_1_to_10": 6,
      "findings": "Christ is the telos, and the doctrine of the two natures is implied in the discussion of localization vs. universality. However, the focus on 'greater works' risks becoming human-centered (triumphalism) if not carefully grounded in Christ's high-priestly work.",
      "quotes": [
        "This is Jesus talking, who split the centuries in two...",
        "We have a friend at court; Christ is gone unto his Father."
      ],
      "improvement_point": "Ensure that the 'greater works' are clearly shown as Christ's own work through the believer, to avoid the 'human-oriented' preaching becoming detached from the 'One Lord'."
    },
    "8_depth_and_length": {
      "score_1_to_10": 4,
      "findings": "At approximately 14 minutes (1450 words), the sermon fails Dekker's 20-minute minimum. It lacks the 'breadth' required for 'depth.' The repetition of the 'riddle' metaphor takes up space that could have been used for deeper exegetical or psychological exploration.",
      "improvement_point": "Expand the exegetical foundation and the concrete application to reach the 20-minute threshold, ensuring the 'breadth' serves the 'depth'."
    }
  },
  "overall_assessment": {
    "summary": "The sermon falls short of Dekker’s criteria primarily due to its brevity, lack of rigorous exegesis, and its tendency toward general, triumphalist truths. It treats the biblical text as a personal intellectual puzzle rather than a current, proclamatory Word that 'expounds' the hearer. The 'two ways' are entirely absent, leading to a sermon that takes neither the possibility of being lost nor the gravity of human responsibility seriously enough.",
    "strengths": [
      "Strong focus on the person of Christ as the telos of the message.",
      "Clear attempt to link the specific text to the broader economy of salvation (Ascension/Pentecost)."
    ],
    "weaknesses": [
      "Insufficient length (14 minutes) prevents the necessary 'breadth' for depth.",
      "Lack of original language or historical-critical exegesis.",
      "Application is too general and lacks contemporary concreteness.",
      "Absence of the 'two ways' (the seriousness of being lost)."
    ],
    "final_judgment_according_to_dekker": "According to Dekker's definition, this is an inadequate sermon. It functions more as a personal reflection or a general motivational speech than a 'recreation of the Bible into a new, current, proclamatory word.' It lacks the necessary exegetical weight and the concrete application to the 'zeitgeist' required for true preaching."
  }
}